{
  "version": 1,
  "nodes": [
    {
      "id": "land",
      "label": "Acquire Land",
      "category": "start",
      "phase": 0,
      "cost": null,
      "status": "locked",
      "description": "300-400 acres of contiguous forested land in Southern Maine  -  the permanent physical foundation of New Doggerland. The target parcel combines mature mixed forest with varied terrain, adequate natural water features, and proximity to Southern Maine's population centers without being so accessible as to compromise the sense of arrival and seclusion the resort model depends on. Land is secured under a long-term stewardship lease structured for a minimum 200-year term rather than outright purchase, preserving the landowner's underlying ownership while giving New Doggerland the operational security required to invest at institutional scale. The right landowner understands they are not selling; they are partnering with a governance-locked institution designed to outlast them. Finding the land and the right landowner is the founding act  -  everything else is contingent on it. Target acquisition: 2026.",
      "dependencies": [],
      "unlocks": [
        "porta_potties",
        "node_7cjvxjl",
        "node_938mdhr",
        "node_7aai9m0",
        "inaugural_use",
        "build_visits"
      ],
      "generalFundMin": null,
      "repeatableReqs": [],
      "perk": "",
      "phaseEssential": false,
      "costMonthly": null,
      "costYearly": null,
      "emphasis": false,
      "incomeMin": null,
      "incomeMax": null,
      "minProjectedIncome": null,
      "potentialGrantRevenue": null
    },
    {
      "id": "porta_potties",
      "label": "Porta-Potties",
      "category": "infrastructure",
      "phase": 0,
      "cost": 3000,
      "status": "locked",
      "description": "The first physical infrastructure on the land  -  portable sanitation units installed before any human activity begins on site. Maine law and basic safety require sanitation provision before volunteers, contractors, or staff work the property. The $3,000 setup covers delivery and initial service; monthly rental runs approximately $270 per unit, covering scheduled servicing and consumables. Two units minimum for early operations. This node is the literal first unlock: nothing else happens until it is in place. It is also the first named donor opportunity on the skill tree  -  modest, unglamorous, and a useful early test of whether a donor's commitment to the mission runs deeper than their preference for prestige.",
      "dependencies": [
        "land"
      ],
      "unlocks": [
        "perimeter_fence",
        "water_well",
        "power_solar",
        "access_road",
        "master_waller_dwelling",
        "tree_art"
      ],
      "generalFundMin": null,
      "repeatableReqs": [],
      "perk": "\"Sanitation made possible by [Donor Name]\" acknowledgment on the public tree for each month sponsored.",
      "emphasis": true,
      "costMonthly": null,
      "costYearly": null,
      "incomeMin": null,
      "incomeMax": null,
      "minProjectedIncome": null,
      "potentialGrantRevenue": null,
      "phaseEssential": false
    },
    {
      "id": "perimeter_fence",
      "label": "Fencing",
      "category": "infrastructure",
      "phase": 1,
      "cost": 35000,
      "status": "locked",
      "description": "Boundary and operational fencing installed in phases across the estate as different zones come online. The $35,000 Phase 1 allocation covers the highest-priority enclosures: the sanctuary dog runs (welded wire panel, minimum 6 ft), the founder home yard (timber post and rail, dog-safe infill), and initial livestock perimeters for the goat and donkey facilities. Later phases extend fencing to villa yards ($8,000-$15,000 per yard), the campground perimeter, the public dog park airlocks, and the off-leash trail loop. The perimeter wall program gradually takes over the estate boundary function over 25+ years, but operational fencing within the estate is a permanent, expanding infrastructure thread  -  virtually every node that requires secure containment depends on it. Material selection follows the estate aesthetic: timber post and rail where guest-visible, agricultural wire where functional, wildlife-appropriate specification at the forest boundary.",
      "dependencies": [
        "porta_potties"
      ],
      "unlocks": [
        "sanctuary_core",
        "master_waller_dwelling"
      ],
      "generalFundMin": null,
      "repeatableReqs": [],
      "perk": "",
      "phaseEssential": true,
      "costMonthly": null,
      "costYearly": null,
      "emphasis": false,
      "incomeMin": null,
      "incomeMax": null,
      "minProjectedIncome": null,
      "potentialGrantRevenue": null
    },
    {
      "id": "water_well",
      "label": "Temporary Water",
      "category": "infrastructure",
      "phase": 1,
      "cost": 2500,
      "status": "locked",
      "description": "Temporary potable water provision bridging land acquisition and permanent well installation. IBC (Intermediate Bulk Container) storage tanks  -  typically 275-gallon food-grade totes  -  are filled by scheduled water delivery truck at approximately $300 per month, supporting the founder home, volunteer staging area, and early animal care operations. The $2,500 setup covers tank procurement and plumbing connections. The system is deliberately minimal: reliable enough to sustain early operations, uncomfortable enough to maintain urgency around funding the permanent well. Two to four IBC tanks in series provide 550-1,100 gallons of buffer storage. The temporary system is retired when the Well and Permanent Water node is funded and operational, typically 6-18 months after land acquisition depending on drilling permitting timelines.",
      "dependencies": [
        "porta_potties"
      ],
      "unlocks": [
        "node_5rnby5e",
        "node_min2uja",
        "node_b60pxf9"
      ],
      "generalFundMin": 450,
      "repeatableReqs": [],
      "perk": "\"Founding Water made possible by [Donor Name]\" acknowledgment on the public tree.",
      "phaseEssential": true,
      "emphasis": true,
      "costMonthly": null,
      "costYearly": null,
      "incomeMin": null,
      "incomeMax": null,
      "minProjectedIncome": null,
      "potentialGrantRevenue": null
    },
    {
      "id": "power_solar",
      "label": "Power & Solar",
      "category": "infrastructure",
      "phase": 1,
      "cost": 120000,
      "status": "locked",
      "description": "A solar-primary electrical system sized for the founder home, volunteer staging area, and early sanctuary operations. The $120,000 installation covers a 20-30 kW solar array, battery storage bank sufficient for 2-3 days of autonomy at early operational loads, a backup generator interface for extended Maine winter overcast periods, and the distribution panel and wiring to serve the first structures. The system is deliberately oversized relative to Phase 1 demand to provide headroom for the sanctuary core's climate control, lighting, and veterinary equipment when those nodes come online. A grid connection application is filed concurrently as a prudent emergency fallback  -  Maine winters and animal welfare obligations make a backup supply non-negotiable. Monthly costs are minimal at this scale; the Power Upgrade node later scales the system for full institutional operations.",
      "dependencies": [
        "porta_potties"
      ],
      "unlocks": [
        "basic_trails",
        "node_min2uja",
        "node_5mltlag",
        "node_dlhwug3"
      ],
      "generalFundMin": 10000,
      "repeatableReqs": [],
      "perk": "\"Founding Power System made possible by [Donor Name]\" (signage at the staging area power hub), plus a permanent donor plaque on the electrical room wall.",
      "phaseEssential": true,
      "emphasis": true,
      "costMonthly": null,
      "costYearly": null,
      "incomeMin": null,
      "incomeMax": null,
      "minProjectedIncome": null,
      "potentialGrantRevenue": null
    },
    {
      "id": "basic_trails",
      "label": "Basic Trail Network",
      "category": "infrastructure",
      "phase": 1,
      "cost": 75000,
      "status": "locked",
      "description": "15 miles of hand-cut and machine-assisted forest trails across the estate, graded for three ability levels  -  easy (wide, level, suitable for strollers and older visitors), intermediate (natural surface, moderate terrain), and challenge (rooted, hilly, for confident walkers and trail runners). All trails are dog-friendly and marked with color-coded posts. Trailheads feature printed maps, tick-check stations, and waste bag dispensers. The network forms the connective tissue of the entire estate  -  nearly every outdoor program, activity, and experience depends on it being in place.",
      "dependencies": [
        "power_solar",
        "node_b60pxf9",
        "node_k2vimcu"
      ],
      "unlocks": [
        "memory_lane_trail",
        "extreme_fetch",
        "ice_rink",
        "tree_art",
        "mood_meadow",
        "sound_pads",
        "matchmaking_walks",
        "node_nxnzzqr",
        "node_xy757nh",
        "node_5rnby5e",
        "node_aaji5ku",
        "node_0p03fw9",
        "node_37li943",
        "node_8s8q8at",
        "node_rfaxsc3",
        "node_8k7m7qj",
        "node_40jlnzf",
        "chaga_program",
        "node_p7dxajh",
        "node_v9vmmm3"
      ],
      "generalFundMin": null,
      "repeatableReqs": [
        {
          "repeatableId": "utv_trailer",
          "minCount": 1
        },
        {
          "repeatableId": "chainsaw_kit",
          "minCount": 1
        }
      ],
      "perk": "Trail network naming: \"Trail Network made possible by [Donor Name]\", acknowledgment on all printed and digital trail maps, a named trailhead entry marker at the main access point, and optional named trail segments for secondary donors (discreet carved-post markers consistent with the estate aesthetic).",
      "phaseEssential": true,
      "emphasis": true,
      "costMonthly": 500,
      "costYearly": null,
      "incomeMin": null,
      "incomeMax": null,
      "minProjectedIncome": null,
      "potentialGrantRevenue": null
    },
    {
      "id": "access_road",
      "label": "Access Road",
      "category": "infrastructure",
      "phase": 1,
      "cost": 35000,
      "status": "locked",
      "description": "An all-weather access route from the nearest public road to the estate's operational core  -  the physical prerequisite for every delivery, emergency vehicle, contractor, and guest that will ever arrive at New Doggerland. The $35,000 Phase 1 cost covers a compacted gravel base road of approximately 0.25-0.5 miles depending on the chosen parcel's road frontage, with adequate width for delivery trucks and emergency vehicles (minimum 12 ft, target 16 ft), basic drainage culverts, and a defined entry point. Cost is site-dependent and should be re-evaluated once land is acquired  -  a parcel with existing forest road infrastructure could reduce this significantly; one requiring new construction through dense forest could increase it to $80,000-$150,000. The entry point is the first impression of the estate for every visitor, contractor, and donor who arrives  -  the entry marker stone is accordingly the first named donor opportunity with genuine public visibility.",
      "dependencies": [
        "porta_potties"
      ],
      "unlocks": [
        "dutch_snackbar",
        "node_mzsbyr5",
        "node_coro4fa",
        "node_ivc46ur",
        "node_6j8nnxz",
        "node_nxnzzqr",
        "node_xy757nh",
        "node_ijjcwty",
        "node_min2uja",
        "node_5mltlag",
        "node_k2vimcu"
      ],
      "generalFundMin": null,
      "repeatableReqs": [],
      "perk": "\"Access Road made possible by [Donor Name]\" entry marker stone at the start of the road (non-intrusive, consistent with the aesthetic).",
      "phaseEssential": true,
      "emphasis": true,
      "costMonthly": null,
      "costYearly": null,
      "incomeMin": null,
      "incomeMax": null,
      "minProjectedIncome": null,
      "potentialGrantRevenue": null
    },
    {
      "id": "sanctuary_core",
      "label": "Sanctuary Rescue Core",
      "category": "sanctuary",
      "phase": 2,
      "cost": 250000,
      "status": "locked",
      "description": "A purpose-built 12-dog rescue and adoption facility forming the operational heart of New Doggerland's charitable mission. The facility includes individual kennel suites sized above industry minimum standards, an indoor/outdoor run system, a low-stress intake area, a quarantine suite, a socialisation and assessment space, a volunteer handling room, and a public adoption viewing area. All spaces are designed to minimise kennel stress  -  sound-dampened walls, natural light, visual barriers between kennels, and enrichment infrastructure built in from day one. Dogs are assessed, rehabilitated where needed, matched with adopters through the staff-led matchmaking program, and transitioned through a structured adoption process. At a 12-dog capacity with average length of stay of 12-25 days, the facility can process approximately 175-350 adoptions per year depending on intake type and rehabilitation needs.",
      "dependencies": [
        "perimeter_fence",
        "node_b60pxf9",
        "node_5mltlag",
        "node_dlhwug3",
        "node_k2vimcu"
      ],
      "unlocks": [
        "vet_facility",
        "communication_boards",
        "dog_daycare",
        "scent_system",
        "animal_adoption",
        "node_nlp6pnm"
      ],
      "generalFundMin": null,
      "repeatableReqs": [],
      "perk": "Facility naming: \"Rescue Center made possible by [Donor Name]\", permanent donor plaque at the main entrance, named individual kennel suites available for secondary donors, and an invitation to the inaugural intake day  -  the first dog through the door.",
      "phaseEssential": true,
      "emphasis": true,
      "costMonthly": 11500,
      "incomeMin": 96250,
      "incomeMax": 192500,
      "costYearly": null,
      "minProjectedIncome": null,
      "potentialGrantRevenue": null
    },
    {
      "id": "vet_facility",
      "label": "Veterinary Facility",
      "category": "infrastructure",
      "phase": 2,
      "cost": 780000,
      "status": "locked",
      "description": "A purpose-built veterinary hospital constructed to the specifications of a partner veterinarian, operated as an independent practice on-site rather than as a salaried ND department. New Doggerland builds and maintains the facility; the partner DVM operates their own practice within it, serving sanctuary and rescue dogs at cost and generating revenue through public clientele  -  resort guests, local pet owners, and regional referrals drawn by the quality of the facility and the unusual setting.\nThe Phase 1 facility is sized for a single DVM with two to three vet techs: one surgical suite, full diagnostic capability (digital X-ray, ultrasound, in-house bloodwork), a dental suite, pharmacy, treatment rooms, and a recovery kennel wing integrated with the sanctuary. At 1,000 dogs per year at full build, this facility scales to a multi-DVM hospital with three to four surgical suites, CT access, a dedicated ICU, and a specialist rotation  -  but Phase 1 establishes the bones of that institution at a scale that can open and operate immediately.\nThe DVM this facility is designed to attract is leaving corporate veterinary medicine  -  the consolidation, the moral injury of profit-driven care, the loss of autonomy. New Doggerland offers the opposite: a world-class facility in a forest, a rescue mission worth serving, a public practice that is financially sustainable, and complete professional autonomy. In exchange, rescue dogs receive the best available care at cost. This is not a compromise for either party.\nThe facility is a named donor opportunity of the highest tier. It is also, practically, the infrastructure that makes 1,000 dogs per year possible  -  without it, ND is a shelter. With it, ND is a rescue institution.",
      "dependencies": [
        "sanctuary_core",
        "node_k2vimcu"
      ],
      "unlocks": [
        "transport_fleet"
      ],
      "generalFundMin": null,
      "repeatableReqs": [],
      "perk": "Facility naming: \"Veterinary Hospital made possible by [Donor Name]\", permanent donor plaque at the hospital entrance, and an invitation to be present at the first surgery performed in the facility.",
      "phaseEssential": true,
      "costMonthly": 8500,
      "incomeMin": 66000,
      "incomeMax": 144000,
      "emphasis": true,
      "costYearly": null,
      "minProjectedIncome": null,
      "potentialGrantRevenue": null
    },
    {
      "id": "communication_boards",
      "label": "FluentPet Program",
      "category": "sanctuary",
      "phase": 2,
      "cost": 25000,
      "status": "locked",
      "description": "Every dog in New Doggerland's sanctuary receives training on a standardised 24-button communication board before adoption, using a consistent vocabulary and layout across all environments  -  sanctuary, villas, public spaces, and the adopter's home. The board travels with the dog. Adoption fees include the board at no additional cost to the adopter. The 24-button standard vocabulary covers needs (outside, water, food, play, walk, potty, rest, help), emotions (happy, sad, scared, want, love, no), social context (parent figures, friend, stranger, alone, together), and locations (inside, outside, go, home). Expansion boards are available in standardised sets of 12, up to a maximum of 48 buttons across three boards  -  same buttons, same layout as the standard board, ensuring consistency as vocabulary grows. Boards are installed throughout the estate  -  in every villa, at key public locations including the dog park, trail entrances, and Aqua Fetch Bay  -  so dogs can communicate in any environment they encounter during their stay or after adoption. A dog that has learned this vocabulary at New Doggerland will find the same board in their adopted home, in any ND villa, and at any ND public point. The program includes a formal research partnership commitment with FluentPet and academic partners in dog cognition research. New Doggerland's throughput  -  hundreds of dogs per year trained on a standardised board in a controlled environment  -  creates a longitudinal dataset of significant research value. This partnership may offset board costs through sponsorship. This commitment may not be eliminated for cost-saving purposes.",
      "dependencies": [
        "sanctuary_core"
      ],
      "unlocks": [],
      "generalFundMin": null,
      "repeatableReqs": [],
      "perk": "Program naming: \"Communication Program made possible by [Donor Name]\", acknowledgment on all board packaging and the program page, and a FluentPet-partnered \"Founding Voice\" recognition for the primary sponsor.",
      "costMonthly": 900,
      "costYearly": null,
      "emphasis": false,
      "incomeMin": null,
      "incomeMax": null,
      "minProjectedIncome": null,
      "potentialGrantRevenue": null,
      "phaseEssential": false
    },
    {
      "id": "dog_daycare",
      "label": "Outdoor Dog Daycare",
      "category": "revenue",
      "phase": 1,
      "cost": 23000,
      "status": "locked",
      "description": "Outdoor dog daycare operation for up to 50 dogs, divided into 4 fenced play areas, staffed to supervision ratio guidance, with water provision, shade or shelter, waste stations, basic tick-control points, making use of trails and facilities, and controlled entry and exit handling.",
      "dependencies": [
        "perimeter_fence",
        "node_b60pxf9",
        "node_k2vimcu"
      ],
      "unlocks": [],
      "generalFundMin": 18000,
      "repeatableReqs": [],
      "perk": "Daycare naming: \"Dog Daycare made possible by [Donor Name]\", named yards (four area plaques), named water stations, named shade or shelter structure, and a sponsor plaque at the entry control point.",
      "incomeMin": 180000,
      "incomeMax": 690000,
      "costMonthly": null,
      "costYearly": null,
      "emphasis": false,
      "minProjectedIncome": null,
      "potentialGrantRevenue": null,
      "phaseEssential": false
    },
    {
      "id": "matchmaking_walks",
      "label": "Dog Matchmaking Walks",
      "category": "sanctuary",
      "phase": 2,
      "cost": 2000,
      "status": "locked",
      "description": "Guests without dogs  -  or guests who want company on the trail  -  request a matched walk through the sanctuary team. Staff assess the guest's energy, pace, experience with dogs, and personality before selecting a specific sanctuary dog for them. The match is deliberate, not random. They walk together for 1-2 hours on the trail network with no adoption pressure and no sales pitch. Just a walk.\nThe match is logged. Returning guests are reunited with the same dog on subsequent visits. Relationships develop across multiple stays. Some end in adoption  -  the guest has already spent hours with this dog in a forest, in all weathers, at their own pace. That is not a purchase. That is a decision made from knowledge. All matchmaking walks are valuable regardless of whether adoption follows.\nFor sanctuary dogs, the program provides structured human socialisation, trail time, and the kind of calm one-to-one attention that kennel life cannot replicate. A dog that has walked regularly with guests is a more accurately assessed, more adoptable dog.\nThe program is also available to guests who simply want canine company on the trail and have no interest in adoption. No qualification required.",
      "dependencies": [
        "sanctuary_core",
        "basic_trails"
      ],
      "unlocks": [],
      "generalFundMin": null,
      "repeatableReqs": [],
      "perk": "Program naming: \"Matchmaking Walks Program made possible by [Donor Name]\", acknowledgment on the program page and trail signage, and an invitation to walk with the first matched pair on launch day.",
      "costMonthly": null,
      "costYearly": null,
      "emphasis": false,
      "incomeMin": null,
      "incomeMax": null,
      "minProjectedIncome": null,
      "potentialGrantRevenue": null,
      "phaseEssential": false
    },
    {
      "id": "scent_system",
      "label": "Scent Coding System",
      "category": "resort",
      "phase": 2,
      "cost": 18000,
      "status": "locked",
      "description": "An estate-wide scent architecture designed around the primary sense of the dog, applied consistently across four domains.\nVillas. Each villa carries a unique, subtle scent signature delivered via a low-level diffuser using natural essential oil blends. A dog that stays in Villa 7 learns within hours that this specific scent means home base  -  safety, their humans, their bed. The scent persists at low concentration throughout the stay, reducing anxiety particularly for rescue dogs and dogs in unfamiliar environments. Returning guests can request the same scent profile on subsequent stays, allowing a dog to re-orient immediately upon arrival.\nStaff uniforms. Each department carries a distinct scent worked into a collar or wristband worn by all staff in that role  -  light enough to be imperceptible to most humans, unambiguous to a dog. Veterinary and medical staff carry one signature; kennel and animal care staff another; guest-facing and hospitality staff a third; sanctuary behavior staff a fourth. A dog smells an approaching staff member and has a moment of preparation before the interaction begins  -  the vet tech scent triggers mild alert, the play coordinator scent triggers anticipation, the foster carer scent triggers calm. Dogs read intent before body language even begins.\nTrails. Scent markers at trail junctions and decision points  -  subtle posts at dog nose height  -  provide directional and territorial information in the dog's own language. Safe zones carry one scent family; caution or boundary areas carry another. A dog moving through the trail network reads their environment continuously rather than navigating it blind.\nBoundaries. The perimeter of safe off-leash zones is scent-marked as well as physically fenced, providing a redundant sensory boundary that dogs register instinctively. This is particularly valuable for sanctuary dogs being introduced to off-leash freedom for the first time  -  the scent boundary communicates \"this is the edge\" in a language more immediate than a fence line.\nThe system requires formulation of consistent, species-appropriate scent blends, staff training in application and maintenance, and a refresh protocol to maintain concentration levels year-round.",
      "dependencies": [
        "sanctuary_core",
        "node_p7dxajh"
      ],
      "unlocks": [
        "scent_menu"
      ],
      "generalFundMin": null,
      "repeatableReqs": [],
      "perk": "System naming: \"Scent Environment made possible by [Donor Name]\", acknowledgment on the system's interpretive signage, and an invitation to work with the scent formulation team on the villa signature series.",
      "costMonthly": 600,
      "costYearly": null,
      "emphasis": false,
      "incomeMin": null,
      "incomeMax": null,
      "minProjectedIncome": null,
      "potentialGrantRevenue": null,
      "phaseEssential": false
    },
    {
      "id": "scent_menu",
      "label": "Dog Scent Menu",
      "category": "revenue",
      "phase": 3,
      "cost": 8000,
      "status": "locked",
      "description": "A purpose-built interactive scent station installed in the restaurant, allowing dogs to express a meal preference before food is prepared. The $8,000 covers fabrication of the station  -  a low, angled panel at dog nose height with sealed scent cartridges corresponding to each available protein and carbohydrate option on the dog menu. A dog that lingers at the salmon cartridge is indicating salmon; one that returns repeatedly to chicken is telling its owner something worth acting on. Staff record the preference and prepare accordingly. The system is deliberately low-tech: no electronics, no data capture. Just a dog being consulted about its meal in the language available to it. For guests, watching their dog make a deliberate food choice is one of the more quietly remarkable moments the estate offers. The scent menu also feeds into the Kustom Kibble consultation process  -  a dog's demonstrated preferences in the restaurant inform the Koncierge's blend recommendation in the store. Scent cartridges are replaced monthly at minimal ongoing cost.",
      "dependencies": [
        "scent_system",
        "node_wuyygx4"
      ],
      "unlocks": [],
      "generalFundMin": null,
      "repeatableReqs": [],
      "perk": "",
      "costMonthly": null,
      "costYearly": null,
      "emphasis": false,
      "incomeMin": null,
      "incomeMax": null,
      "minProjectedIncome": null,
      "potentialGrantRevenue": null,
      "phaseEssential": false
    },
    {
      "id": "animal_adoption",
      "label": "On-Site Animal Adoption",
      "category": "sanctuary",
      "phase": 2,
      "cost": 5000,
      "status": "locked",
      "description": "A zoo-style animal sponsorship program allowing visitors, resort guests, and remote supporters to sponsor a specific named animal in New Doggerland's care. Sponsors pay the full annual cost footprint of their animal  -  covering food, veterinary care, enrichment, and housing  -  on an annual renewable contract. Available across all sanctuary species: dogs, donkeys, goats, and ducks.\nSponsors receive a named plaque on their animal's stall or pen, monthly photo and video updates, unlimited scheduled visits, participation in supervised care activities (grooming, feeding, walking), and immediate notification if their animal requires significant medical attention. Sponsors may provide input on enrichment and, where an animal is unnamed at the time of sponsorship, naming rights. New Doggerland retains full care authority in all circumstances  -  animal welfare supersedes sponsor preferences.\nThe program is designed to serve people who love animals but cannot keep them: elderly visitors who want a specific animal to visit regularly, families with rental restrictions or allergies, urban supporters who want a genuine ongoing connection, and children learning responsibility without the full commitment of ownership. A sponsored donkey or rescue dog is also an unusually good gift. Sponsorship does not confer ownership or adoption rights. Animals that are adopted out of the sanctuary are retired from the program with a closing update to their sponsor.\nThis program may not be eliminated for cost-saving purposes.",
      "dependencies": [
        "sanctuary_core"
      ],
      "unlocks": [],
      "generalFundMin": null,
      "repeatableReqs": [],
      "perk": "Program naming: \"Animal Sponsorship Program made possible by [Donor Name]\", acknowledgment on all sponsorship materials and the program page, and a reserved sponsorship of the first animal enrolled in each species category.",
      "incomeMin": 13380,
      "incomeMax": 69500,
      "costMonthly": 400,
      "costYearly": null,
      "emphasis": false,
      "minProjectedIncome": null,
      "potentialGrantRevenue": null,
      "phaseEssential": false
    },
    {
      "id": "master_waller_dwelling",
      "label": "Master Waller Dwelling",
      "category": "infrastructure",
      "phase": 2,
      "cost": 175000,
      "status": "locked",
      "description": "The master waller's permanent residence, built by the waller themselves in their first season on the estate using the same drystone craft they will practice for the remainder of their career at New Doggerland. The waller designs and leads the build, hiring a seasonal laborer for stone lifting and supply, a timber framer for the roof structure, and licensed trades for plumbing and electrical. New Doggerland provides materials, groundwork preparation, and equipment. The waller provides the skill, the design, and the hands.\nThe dwelling is integrated into or directly adjacent to the perimeter wall  -  the waller's own first major work on the estate, and a permanent demonstration of what the wall program will become. It is built to last as long as the wall itself.\nThe dwelling is the waller's home for life. Lifetime residence rights are protected in the governance documents  -  the waller cannot be displaced except by their own choice. It is not a staff house. It is their house, built by them, in stone, on this land. The position is a lifetime appointment with full creative and technical autonomy over wall design, technique, and material selection. The waller is expected to train apprentices over time  -  potentially including foster youth alumni  -  ensuring the craft and the wall continue beyond any single person's working life.\nThe right person for this role values craft over income, thinks in decades rather than years, and wants a life's work rather than a contract. Finding them is one of the most important early tasks of the organization.",
      "dependencies": [
        "perimeter_fence"
      ],
      "unlocks": [],
      "generalFundMin": null,
      "repeatableReqs": [],
      "perk": "Dwelling naming: \"Waller's Cottage made possible by [Donor Name]\", permanent donor plaque on the exterior stone, and an invitation to be present when the first course of stone is laid.",
      "costMonthly": null,
      "costYearly": null,
      "emphasis": false,
      "incomeMin": null,
      "incomeMax": null,
      "minProjectedIncome": null,
      "potentialGrantRevenue": null,
      "phaseEssential": false
    },
    {
      "id": "perimeter_wall",
      "label": "Perimeter Wall (Begin)",
      "category": "legacy",
      "phase": 1,
      "cost": 120000,
      "status": "locked",
      "description": "The beginning of New Doggerland's most ambitious long-horizon infrastructure project: a dry-stone perimeter wall enclosing the estate boundary, built by a resident master waller over an estimated 25-year construction period. The $120,000 Phase 1 node funds the first season of active wall construction  -  stone sourced on-site from field clearing and trail work, supplemented by purchased dressed stone where needed, plus the master waller's first-year compensation ($55,000-$85,000 depending on experience and arrangement) and groundwork preparation for the first wall sections. A dry-stone wall of this scale  -  3+ miles of perimeter  -  is not built in one phase or one decade. It is a generational project, funded in stages through the Hero Stones Program, estate operations, and designated capital gifts. The $8,000 monthly covers ongoing waller compensation and materials once construction is active. The wall serves simultaneously as boundary infrastructure, ecological habitat (dry-stone walls are among the most biodiverse built structures in temperate landscapes), aesthetic identity, and institutional statement. A 25-year construction project signals, more convincingly than any document, that New Doggerland intends to be here in 200 years.",
      "dependencies": [
        "perimeter_fence"
      ],
      "unlocks": [
        "hero_stones",
        "memorial_urn_stones"
      ],
      "generalFundMin": 27000,
      "repeatableReqs": [],
      "perk": "Wall naming: \"Perimeter Wall made possible by [Donor Name]\"; named wall segments and individual stones (including Hero Stones); plaque at the wall's primary public-facing entry point.",
      "costMonthly": 8000,
      "minProjectedIncome": 32000,
      "costYearly": null,
      "emphasis": false,
      "incomeMin": null,
      "incomeMax": null,
      "potentialGrantRevenue": null,
      "phaseEssential": false
    },
    {
      "id": "hero_stones",
      "label": "Hero Stones Programme",
      "category": "revenue",
      "phase": 1,
      "cost": 5000,
      "status": "locked",
      "description": "A permanent, multi-tier donor recognition program integrated into the fabric of the perimeter wall itself. Donors purchase the right to have a stone carved and set into the wall at a position corresponding to their tier  -  from standard community stones through to ultra-premium auctioned keystones at the main gate arch. All inscriptions are donor-chosen within approved guidelines, carved by the master waller or a commissioned stone carver, and permanent. The program runs for the full 25-year construction life of the wall, creating a perpetual fundraising mechanism that funds 40-60% of wall construction costs as it proceeds. The wall is never \"finished\" as a fundraising vehicle  -  new sections mean new stones, new placement ceremonies, and new donor engagement year after year. Stone tiers:Legendary (auction only)  -  Main gate arch keystone (one only), entry gate pillars (pair), corner foundation stones (×4). Auctioned at the annual Stone Ceremony Gala. Opening bids from $50,000; expected $75,000-$150,000 for the keystone. Placement is a private ceremony for the donor and up to 20 guests, with the master waller setting the stone by hand. Premium  -  Section markers, archway keystones, gateway thresholds, coping stones. $1,500-$7,500. Donors receive a site visit during carving, a placement ceremony invitation, professional photography, a framed rubbing of their inscription, and GPS coordinates for their stone. Community  -  Standard wall stones and memorial benches. $250-$3,500. Donors receive online inscription preview, stone number and section assignment, email updates as their stone approaches placement, and an open invitation to quarterly Wall Progress Days. Foster youth stones  -  Earned, not purchased, by program graduates. Placed alongside donor stones with no visible distinction. A placement ceremony is held quarterly; graduates learn basic walling technique from the master waller before setting their own stone. The wall makes no hierarchy between a $100,000 keystone donor and a youth who found their footing here. Both names are carved in the same stone. Inscription guidelines: Personal dedications, memorial messages, family markers, and mission-aligned statements are welcome. Commercial messaging, political statements, and hateful content are prohibited. All inscriptions are reviewed and approved before carving. Donors may revise or withdraw rather than be declined.",
      "dependencies": [
        "perimeter_wall"
      ],
      "unlocks": [],
      "generalFundMin": null,
      "repeatableReqs": [],
      "perk": "Program naming: \"Hero Stones Program made possible by [Donor Name]\", acknowledgment on all program materials and the wall's permanent interpretive signage, and a reserved Legendary tier stone in the first auction.",
      "incomeMin": 50000,
      "incomeMax": 200000,
      "costMonthly": null,
      "costYearly": null,
      "emphasis": false,
      "minProjectedIncome": null,
      "potentialGrantRevenue": null,
      "phaseEssential": false
    },
    {
      "id": "memorial_urn_stones",
      "label": "Memorial Urn Stones",
      "category": "revenue",
      "phase": 2,
      "cost": 5000,
      "status": "locked",
      "description": "A tiered memorial program integrated into the perimeter wall, allowing guests, members, workers, volunteers, adopters, and alumni to permanently commemorate a beloved animal within the fabric of the estate.\nTier 1  -  Memorial Stone: An inscribed dressed stone set into a prominent section of the perimeter wall, bearing the animal's name, species, and dates. Carved by the master waller or a commissioned stone carver in a style consistent with the wall's aesthetic. No ashes interred. Available for any species.\nTier 2  -  Urn Stone: A purpose-prepared wall section with a sealed hollow chamber behind a carved face stone, allowing cremated remains to be permanently interred within the wall itself. The face stone bears the animal's name, species, dates, and an optional short inscription. Chamber is sealed with lime mortar consistent with the wall construction. Subject to applicable Maine law governing interment of animal remains  -  legal review completed before program launch. Available for any species, subject to chamber sizing constraints.\nBoth tiers are permanent. The wall is built to last centuries. An annual memorial gathering is held at the wall each autumn for families of interred and commemorated animals.",
      "dependencies": [
        "perimeter_wall",
        "chapel"
      ],
      "unlocks": [],
      "generalFundMin": null,
      "repeatableReqs": [],
      "perk": "Program naming: \"Memorial Program made possible by [Donor Name]\", acknowledgment on all program materials, and a complimentary Tier 1 memorial stone for the program's founding sponsor's own animal.",
      "incomeMin": 80000,
      "incomeMax": 100000,
      "costMonthly": null,
      "costYearly": null,
      "emphasis": false,
      "minProjectedIncome": null,
      "potentialGrantRevenue": null,
      "phaseEssential": false
    },
    {
      "id": "dutch_snackbar",
      "label": "Dutch Snackbar",
      "category": "revenue",
      "phase": 1,
      "cost": 35000,
      "status": "locked",
      "description": "A permanent food service unit - static food truck or purpose-built kiosk - operating in or adjacent to the central village, serving wood-fired pizza and a curated menu of Dutch street food on Friday through Sunday afternoons and evenings. The Dutch menu reflects the Founder's cultural heritage and is treated as a genuine culinary offering: kapsalon (fries topped with döner meat, melted Gouda, and garlic sauce), patat speciaal (fries with mayo, curry ketchup, and raw onion), patat oorlog (fries with peanut sauce and mayo). Wood-fired pizza uses estate-grown toppings where seasonal availability allows. The $35,000 covers the vehicle or kiosk structure, pizza oven installation, and initial fitout. Operating three days per week at 50-80 covers per service, the snackbar generates $40,000-$220,000 annually depending on season and villa occupancy. It is also the Dutch cultural thread made edible - one of several ways the estate's founding identity is woven into daily operations without being announced.",
      "dependencies": [
        "access_road",
        "node_b60pxf9",
        "node_k2vimcu"
      ],
      "unlocks": [],
      "generalFundMin": null,
      "repeatableReqs": [],
      "perk": "",
      "incomeMin": 40000,
      "incomeMax": 220000,
      "costMonthly": null,
      "costYearly": null,
      "emphasis": false,
      "minProjectedIncome": null,
      "potentialGrantRevenue": null,
      "phaseEssential": false
    },
    {
      "id": "forest_dining",
      "label": "Forest Dining",
      "category": "revenue",
      "phase": 2,
      "cost": 108000,
      "status": "locked",
      "description": "Distributed forest dining across 20 grill sites dispersed through the estate - each consisting of a well-drained concrete pad, a simple wooden roof, a gas patio heater, a permanent gas grill, and a laminated menu with a two-way radio post. Guests book a site in advance and order a grill pack from the menu. A staff member arrives by golf cart, unfurls a white tablecloth on the picnic table, sets out proper plates, silverware, and grill tools, lights the grill, and disappears back into the trees. When the guests radio that they're done, staff returns to clear everything. No commercial kitchen. No restaurant building. No waiting staff hovering. Just private forest, a proper grill, and someone who has thought of everything.\nSummer packs range from a Classic (burgers, corn, potato salad) to a Premium (ribeye, lobster tail, compound butter). A Dutch pack features bratwurst. Winter operation switches to fondue - cheese, broth, or chocolate - delivered and set up at the same sites with patio heaters running. Pizza and fried snacks from the Dutch Snackbar are deliverable to grill sites via the same golf cart infrastructure. When villas are operational, the identical service extends to villa decks.\nNo income in the construction period. Sites become operational as soon as the concrete pads and roof structures are complete - potentially within months of land acquisition, ahead of most other revenue nodes.",
      "dependencies": [
        "node_min2uja",
        "node_k2vimcu",
        "estate_vehicles"
      ],
      "unlocks": [
        "slow_table"
      ],
      "generalFundMin": null,
      "repeatableReqs": [
        {
          "repeatableId": "picnic_bench",
          "minCount": 6
        }
      ],
      "perk": "Program naming: \"Forest Dining Program made possible by [Donor Name]\", acknowledgment on all menus and the booking system, a named grill site with a discreet carved post marker, and an invitation to the inaugural white-tablecloth dinner in the forest.",
      "incomeMin": 35000,
      "incomeMax": 120000,
      "costMonthly": 8200,
      "costYearly": null,
      "emphasis": false,
      "minProjectedIncome": null,
      "potentialGrantRevenue": null,
      "phaseEssential": false
    },
    {
      "id": "slow_table",
      "label": "The Long Table",
      "category": "community",
      "phase": 3,
      "cost": 8000,
      "status": "locked",
      "description": "A purpose-built long table  -  permanent, beautiful, weather-protected  -  hosted by the Founder Steward on a monthly basis in the early phases, moving to weekly as the estate matures. Seating is fixed at twelve to sixteen. The guest list is deliberately mixed across every stratum of the estate's life: major donors and first-year volunteers, artisan partners and board members, visiting legislators and sanctuary staff, a foster youth alumnus and a construction foreman. The only criterion is that everyone at the table has some genuine stake in what New Doggerland is becoming.\nThe meal is family-style  -  dishes passed, not plated. The menu is whatever the estate's own kitchen, baker, forager, and garden have produced that week. Nothing is imported for the occasion. The table eats what the land and its people made.\nNo phones. A small wooden box sits beside each place. The ask is simple and non-negotiable.\nOne ritual: each person at the table serves the person to their right  -  passes dishes, pours drinks, clears plates. Not staff. Not a gesture. The actual service of the meal, performed by everyone simultaneously, for the duration. A major donor fills a kennel worker's glass. The Founder Steward clears someone else's plate. Nobody is the host. Nobody is the guest. Twelve people take care of each other for three hours.\nDogs are welcome under the table.\nThe Long Table is not a networking event. It is not a cultivation dinner. It is not a thank-you. It is the Founder Steward's weekly practice of the belief that the institution is built by people who know each other as people  -  and that knowing each other as people requires sitting together and sharing food, not exchanging business cards.",
      "dependencies": [
        "forest_dining",
        "central_village",
        "node_wuyygx4"
      ],
      "unlocks": [],
      "generalFundMin": 150000,
      "repeatableReqs": [],
      "perk": "Table naming: \"The Long Table made possible by [Donor Name]\", permanent donor plaque on the table itself  -  inlaid, flush with the surface, carved by the estate's woodworker  -  and a standing invitation to one seat at every Long Table dinner for the duration of the donor's relationship with the estate.",
      "costMonthly": 1200,
      "costYearly": null,
      "emphasis": false,
      "incomeMin": null,
      "incomeMax": null,
      "minProjectedIncome": null,
      "potentialGrantRevenue": null,
      "phaseEssential": false
    },
    {
      "id": "gingerworks",
      "label": "Gingerworks",
      "category": "community",
      "phase": 4,
      "cost": 350000,
      "status": "locked",
      "description": "New Doggerland's on-site micro-brewery and taproom  -  the Founder's retirement project, operational once the resort has reached sufficient scale to sustain it. Gingerworks specialises in alcoholic ginger beers brewed on-site using ginger and chaga cultivated on the estate, producing a genuinely estate-grown product from soil to glass. The $350,000 covers brewery fitout including fermentation vessels, conditioning tanks, a small bottling and canning line, taproom furniture and bar infrastructure, and cold storage. The taproom is a resort amenity  -  open to villa guests and estate staff, not the general public  -  but Gingerworks product is available for retail purchase through the estate gift shop and any other public-facing retail channel, allowing visitors and day guests who never enter the taproom to take a bottle home. The flagship product is a chaga ginger beer: warming, complex, and genuinely rooted in this specific piece of Maine forest. Seasonal and experimental variants rotate through the taproom on draft. The brewery's small scale  -  nano to micro range  -  is deliberate: quality and story over volume. Gingerworks is not a commercial brewery that happens to be on the estate. It is the Founder's long-horizon personal project, built into the institution's fabric from the beginning, and its products are the most literal expression of the estate's crop-to-glass ambitions.",
      "dependencies": [
        "central_village",
        "node_v9vmmm3",
        "chaga_program",
        "cold_storage"
      ],
      "unlocks": [
        "gift_shop"
      ],
      "generalFundMin": null,
      "repeatableReqs": [],
      "perk": "",
      "costMonthly": null,
      "costYearly": null,
      "emphasis": false,
      "incomeMin": null,
      "incomeMax": null,
      "minProjectedIncome": null,
      "potentialGrantRevenue": null,
      "phaseEssential": false
    },
    {
      "id": "repair_workshop",
      "label": "Repair Culture",
      "category": "legacy",
      "phase": 3,
      "cost": 950000,
      "status": "locked",
      "description": "A large open-sided maker space in the central village  -  permanently staffed, permanently visible, permanently active. Stations for textiles, leather, woodwork, metalwork, electronics, ceramics, and whatever else arrives that someone wants to extend the life of. Staffed primarily by retired craftspeople, local teachers, and skilled hobbyists on flexible arrangements  -  volunteers, modest stipends, or in-kind arrangements with the estate. Foster youth apprentices rotate through. Agricultural college students complete placements here. The artisan partners contribute where their craft overlaps.\nThe guiding principle is the kintsugi ethic applied without limit: repair is not concealment, it is transformation. Every repair is made deliberately visible. Contrast thread on fabric. A different wood species filling a crack. Decorative metal staples through a ceramic break. An embroidered patch that draws the eye. The object leaves more interesting than it arrived  -  carrying the record of its damage as part of its identity rather than hiding it. Guests watch repairs happen. Many participate. Some bring items specifically to have them repaired this way.\nThe workshop serves four functions simultaneously. It is a paid guest service  -  modest fees for repairs completed while guests stay. It is an ND overhead reduction tool  -  all estate equipment, furniture, uniforms, and tools are repaired here before replacement, potentially saving $20,000-$50,000 per year in asset replacement costs. It is an apprenticeship and skills pipeline, particularly for foster youth aging out of care who leave with a marketable, transferable craft skill. And it is a cultural statement  -  a working demonstration that repair is worth celebrating, that objects have lives worth extending, and that the skills to extend them are worth preserving.\nThe space is open-sided by design. It is meant to be seen, heard, and smelled from the central village. The sound of a hammer, the smell of leather and wood, the sight of an elderly craftsperson teaching a teenager to stitch  -  these are not background details. They are the point.",
      "dependencies": [
        "central_village"
      ],
      "unlocks": [
        "youth_program"
      ],
      "generalFundMin": 250000,
      "repeatableReqs": [],
      "perk": "Workshop naming: \"Repair Workshop made possible by [Donor Name]\", permanent donor plaque at the workshop entrance, and a commissioned piece  -  an object of the donor's choosing, repaired or transformed by the workshop's craftspeople in the visible-mend tradition, presented as a gift.",
      "costMonthly": 8500,
      "incomeMin": 41000,
      "incomeMax": 320000,
      "costYearly": null,
      "emphasis": false,
      "minProjectedIncome": null,
      "potentialGrantRevenue": null,
      "phaseEssential": false
    },
    {
      "id": "chapel",
      "label": "Unitarian Chapel",
      "category": "community",
      "phase": 4,
      "cost": 225000,
      "status": "locked",
      "description": "A small timber-frame chapel and Garden of Remembrance serving the full estate community and the general public  -  open to everyone regardless of background, belief, or affiliation. The $225,000 covers the chapel structure (30-50 person capacity), adjacent Garden of Remembrance with perennial planting, quiet paths, and a columbarium, and the fitout of both spaces to a simple, beautiful standard consistent with the estate aesthetic. The chapel is Unitarian Universalist in tradition  -  meaning it carries no creed, imposes no doctrine, and welcomes all. A resident UU minister is attached to the estate, available for weddings, animal and human funerals, memorial services, and private reflection. There are no sermons. The minister's role is to hold space, officiate ceremonies, and be present  -  not to instruct. The chapel is available for hire by outside parties for weddings and funerals, making it one of the estate's few genuinely public-facing buildings. Animals are welcome. Ceremonies for the death of a beloved dog are conducted here with the same care and seriousness as any other service. The Garden of Remembrance connects directly to the Memorial Urn Stones program in the perimeter wall  -  families who choose to inter ashes in the wall may begin and end that process in the garden. The Founder may be interred in the garden, marked with a simple stone of no greater prominence than any other.",
      "dependencies": [
        "central_village"
      ],
      "unlocks": [
        "memorial_urn_stones"
      ],
      "generalFundMin": null,
      "repeatableReqs": [],
      "perk": "",
      "costMonthly": null,
      "costYearly": null,
      "emphasis": false,
      "incomeMin": null,
      "incomeMax": null,
      "minProjectedIncome": null,
      "potentialGrantRevenue": null,
      "phaseEssential": false
    },
    {
      "id": "extreme_fetch",
      "label": "Extreme Fetch Field",
      "category": "resort",
      "phase": 2,
      "cost": 22000,
      "status": "locked",
      "description": "A fan-shaped outfield designed specifically for high-intensity dog fetch, equipped with three tiered mechanical launch systems firing at short (30m), medium (60m), and long (90m+) distances. The field is fenced to contain dogs and retrieve objects, with a handler's platform at the apex of the fan where guests operate the launchers. The layout allows multiple dogs to fetch simultaneously on diverging lines without collision. The field is sited on marginal land  -  the fan shape works naturally on a cleared hillside or open edge zone that would otherwise serve no purpose  -  turning terrain that can't support sanctuary or villa use into an active guest amenity.\nThe three-tier launch system is the feature. A guest who has never thrown a ball 90 metres in their life can watch their dog cover that distance at full speed inside ten seconds. There is nothing else quite like it.",
      "dependencies": [
        "basic_trails"
      ],
      "unlocks": [
        "aqua_fetch"
      ],
      "generalFundMin": null,
      "repeatableReqs": [],
      "perk": "Field naming: \"Extreme Fetch Field made possible by [Donor Name]\", sponsor plaque at the handler's platform, and named individual launch tiers for secondary donors.",
      "costMonthly": null,
      "costYearly": null,
      "emphasis": false,
      "incomeMin": null,
      "incomeMax": null,
      "minProjectedIncome": null,
      "potentialGrantRevenue": null,
      "phaseEssential": false
    },
    {
      "id": "aqua_fetch",
      "label": "Aqua Fetch Bay",
      "category": "resort",
      "phase": 3,
      "cost": 42000,
      "status": "locked",
      "description": "A fan-shaped outdoor water area sited at a natural pond edge or constructed bay, designed as the aquatic counterpart to the Extreme Fetch Field. Three tiered launch systems fire retrieve objects into the water at short, medium, and long range  -  the dog enters at the apex of the fan and swims out along the diverging lanes. Non-slip docks and graduated ramps line the handler's platform and the retrieve area. One-dog-at-a-time release controls on the long-range lane prevent collision in the water. Drift capture geometry at the far end of the fan slows and corrals floating retrieve objects so they don't disperse across the full water body.\nThe experience for the dog is fundamentally different from the dry-land version  -  sustained swimming at full athletic effort, combined with the retrieve drive, produces a quality of physical exhaustion that even very high-energy dogs rarely reach on land. For handlers watching from the platform, a dog covering 60 meters of open water at full speed to reach a floating object and swimming back with it is one of the more purely satisfying things the estate offers.\nThe outdoor Aqua Fetch Bay operates seasonally in Maine conditions  -  May through October reliably, with weather-dependent extension at both ends. The indoor version within The Jewel provides year-round access once that facility is built.",
      "dependencies": [
        "extreme_fetch",
        "node_5mltlag"
      ],
      "unlocks": [],
      "generalFundMin": 150000,
      "repeatableReqs": [],
      "perk": "Bay naming: \"Aqua Fetch Bay made possible by [Donor Name]\", sponsor plaque at the handler's platform, and named individual launch tiers for secondary donors.",
      "costMonthly": 2800,
      "costYearly": null,
      "emphasis": false,
      "incomeMin": null,
      "incomeMax": null,
      "minProjectedIncome": null,
      "potentialGrantRevenue": null,
      "phaseEssential": false
    },
    {
      "id": "ice_rink",
      "label": "Natural Ice Rink",
      "category": "community",
      "phase": 2,
      "cost": 16000,
      "status": "locked",
      "description": "A naturally flooded outdoor skating rink occupying a level clearing in the forest, maintained through repeated thin-layer flooding during freezing temperatures. The rink is bordered by packed snow berms, lit for evening skating, and served by a simple skate-change shelter with benches and boot storage. Skate rentals are available on-site. The rink connects directly to the forest skating trail network once that node is active, making it the hub of winter ice activity on the estate. Operational only when temperatures reliably sustain natural ice  -  typically December through February in Southern Maine, weather permitting.",
      "dependencies": [
        "basic_trails"
      ],
      "unlocks": [
        "skating_trails"
      ],
      "generalFundMin": null,
      "repeatableReqs": [],
      "perk": "Rink naming: \"Ice Rink made possible by [Donor Name]\", sponsor plaque at the skate shelter, and an invitation to the inaugural first-ice ceremony.",
      "costYearly": 6500,
      "incomeMin": 10000,
      "incomeMax": 18000,
      "costMonthly": null,
      "emphasis": false,
      "minProjectedIncome": null,
      "potentialGrantRevenue": null,
      "phaseEssential": false
    },
    {
      "id": "skating_trails",
      "label": "Forest Skating Trails",
      "category": "community",
      "phase": 2,
      "cost": 32000,
      "status": "locked",
      "description": "A network of flooded, frozen skating trails routed through the forest in the Montreal style  -  trails 6-8 feet wide, wide enough for two skaters to pass, carved through the trees and maintained by a small used zamboni that runs the circuit weekly. The surface is prepared on the existing compacted trail base, flooded in thin layers during sustained freezing temperatures. Season runs December through February in Southern Maine, weather permitting.\nThe trails connect to and extend from the natural ice rink, which serves as the hub  -  the rink for skills, hockey, and open skating; the forest trails for the experience. The two function as a single winter ice program.\nThe signature offering is the evening session. When the RFID system is active, skaters move through their own personal sphere of light and sound  -  uplighting rising in the trees ahead, music shifting as they glide between them, breath visible in the cold air. This experience does not exist elsewhere in the United States. Montrealers know it. Americans have not seen it. The first time a guest skates through an uplighted Maine forest at night, they will tell everyone they know.\nPricing reflects this: day skating $20/person, evening RFID session $35/person, skate rental $12. Chaga tea included in evening sessions. Family day pass $65. Local community season pass $150.",
      "dependencies": [
        "ice_rink",
        "basic_trails",
        "rfid_system"
      ],
      "unlocks": [],
      "generalFundMin": null,
      "repeatableReqs": [],
      "perk": "Trail network naming: \"Forest Skating Trails made possible by [Donor Name]\", sponsor acknowledgment at the trailhead and on the skating map, and an invitation to the inaugural first-night session.",
      "costYearly": 4800,
      "incomeMin": 45000,
      "incomeMax": 75000,
      "costMonthly": null,
      "emphasis": false,
      "minProjectedIncome": null,
      "potentialGrantRevenue": null,
      "phaseEssential": false
    },
    {
      "id": "tunnel_network",
      "label": "Tunnel Network",
      "category": "resort",
      "phase": 2,
      "cost": 79000,
      "status": "locked",
      "description": "A network of buried passage tunnels connecting the primary dog zones across the estate, designed specifically for dogs but sized to allow an adult human to enter on hands and knees for maintenance, retrieval, or the occasional shared adventure. Tunnels are constructed from durable HDPE or fiberglass culvert with proper drainage, ventilation, and smooth interior surfaces. The network includes ground-level observation domes at regular intervals  -  clear acrylic hemispheres flush with the ground surface  -  allowing visitors above to watch dogs moving through the system below, and dogs to look up at the world from underground. Periodic underground chambers provide rest, turning, and social interaction space between tunnel runs.\nThe system connects the sanctuary exercise areas, the resort dog zones, and the trail-adjacent off-leash areas, allowing dogs to move freely between zones without gate handling. For dogs, it is infrastructure. For guests watching a dog disappear into the ground, reappear at a dome thirty metres away, and vanish again, it is theatre.",
      "dependencies": [
        "sanctuary_core",
        "node_p7dxajh"
      ],
      "unlocks": [],
      "generalFundMin": null,
      "repeatableReqs": [],
      "perk": "Network naming: \"Tunnel Network made possible by [Donor Name]\", sponsor acknowledgment at the main tunnel entry portal, and named individual observation domes available for secondary donors  -  a discreet circular plaque flush with the ground surface around the dome rim.",
      "costMonthly": 333,
      "costYearly": null,
      "emphasis": false,
      "incomeMin": null,
      "incomeMax": null,
      "minProjectedIncome": null,
      "potentialGrantRevenue": null,
      "phaseEssential": false
    },
    {
      "id": "mood_meadow",
      "label": "Mood Meadow",
      "category": "resort",
      "phase": 2,
      "cost": 2000,
      "status": "locked",
      "description": "A planted meadow area divided into loosely defined zones, each seeded and maintained with plants selected for their effect on canine neurology and behavior  -  attractive, interesting, or mildly psychoactive to dogs through scent, taste, or contact. Dogs move through the meadow freely and self-select: which zone to roll in, graze, rest in, or return to. No intervention from handlers. The choice is the dog's.\nPlanting palette includes valerian (calming, mildly sedating), chamomile (soothing), lavender (relaxing), mint (stimulating, alerting), catnip (psychoactive in dogs at low doses  -  excitement and play behavior), wild strawberry (scent interest, mild excitement), lemon balm (calming), and meadowsweet. All species are selected for safety at normal self-regulated doses  -  the meadow is not a pharmaceutical intervention but an enriched environment that formalizes what dogs already do instinctively when given access to varied plant life.\nInterpretive signage explains the zones and their intended effects to visiting humans, who frequently find the meadow as interesting to observe as the dogs find it to inhabit. A dog that gravitates consistently to the valerian section tells its owner something useful. One that bypasses the calm zones entirely and returns repeatedly to catnip tells them something else. The meadow generates observational data on canine botanical self-medication  -  a largely unstudied area with genuine research value.\nThe meadow requires minimal ongoing maintenance: seasonal replanting of annual species, occasional mowing of paths between zones, and monitoring for invasive encroachment.",
      "dependencies": [
        "basic_trails"
      ],
      "unlocks": [],
      "generalFundMin": null,
      "repeatableReqs": [],
      "perk": "Meadow naming: \"Mood Meadow made possible by [Donor Name]\", sponsor plaque at the meadow entry, and named individual planting zones for secondary donors.",
      "costMonthly": 100,
      "costYearly": null,
      "emphasis": false,
      "incomeMin": null,
      "incomeMax": null,
      "minProjectedIncome": null,
      "potentialGrantRevenue": null,
      "phaseEssential": false
    },
    {
      "id": "sound_pads",
      "label": "Mechanical Sound Pads",
      "category": "resort",
      "phase": 2,
      "cost": 6000,
      "status": "locked",
      "description": "A series of pressure-actuated mechanical pads set flush with the ground along a dedicated trail or play area, scattered at irregular intervals and unpredictable positions. Each pad is constructed from a different material combination  -  tuned hardwood blocks, metal resonators, stone on stone, stretched hide over a wooden frame  -  so that stepping or pouncing on each produces a distinct resonant sound: a deep BONK, a bright DING, a hollow CLONK, a soft THUMP. No electronics. No power. No moving parts beyond the mechanism itself. Pure physics. The pads are made on-site by the estate's resident craftspeople  -  blacksmith and woodworker in collaboration  -  tuned by hand and set into the ground as permanent trail features. Each is weatherproof by nature of its construction, maintenance-free, and effectively indestructible under normal use. Dogs discover the pads by accident. A paw lands on one and something happens. The dog stops. Looks. Steps again. The sound repeats. This is not a toy that a human controls  -  it is an environment that responds to the dog's own movement. The cause-and-effect discovery, the repeatability, the unpredictability of which pad makes which sound  -  these are the enrichment. Some dogs work methodically through the trail. Some return to a favorite pad repeatedly. Some ignore them entirely. All of it is useful to observe. For visiting guests, watching a dog discover the trail for the first time is an experience in itself.",
      "dependencies": [
        "basic_trails"
      ],
      "unlocks": [],
      "generalFundMin": null,
      "repeatableReqs": [],
      "perk": "Trail naming: \"Sound Trail made possible by [Donor Name]\", sponsor plaque at the trail entry, and the option to commission a named pad  -  a specific tone, a specific material, made by the estate's craftspeople, with a small flush marker.",
      "costMonthly": null,
      "costYearly": null,
      "emphasis": false,
      "incomeMin": null,
      "incomeMax": null,
      "minProjectedIncome": null,
      "potentialGrantRevenue": null,
      "phaseEssential": false
    },
    {
      "id": "central_village",
      "label": "Central Village",
      "category": "infrastructure",
      "phase": 3,
      "cost": 800000,
      "status": "locked",
      "description": "The permanent civic and commercial heart of the estate  -  a compact, walkable cluster of interconnected buildings forming the arrival point, operational hub, and social center of New Doggerland. The $800,000 node funds the core village structure: reception and guest services, the primary restaurant, the Kustom Kibble storefront, staff offices and welfare areas, public toilet facilities, the Long Table dining shelter, and covered circulation connecting all components. The village is designed to the winning specification from the Central Village Design Contest  -  dog-forward throughout, natural materials, year-round operability in Maine's climate, and a spatial logic that makes arrival feel discovered rather than managed. Guests move from the parking lot through a brief forest corridor before the village opens ahead of them. The central village does not open until Phase 3, when villa occupancy justifies full-time food and beverage operations  -  but its construction is the prerequisite for the restaurant, Kustom Kibble, the Long Table, artisan retail, and the guest services infrastructure that a 150-villa resort requires.",
      "dependencies": [
        "villas_phase1",
        "node_5mltlag",
        "node_938mdhr",
        "node_dlhwug3",
        "node_g1fqbj4",
        "wastewater"
      ],
      "unlocks": [
        "gingerworks",
        "repair_workshop",
        "kustom_kibble",
        "villas_phase1",
        "water_channels",
        "rfid_system",
        "node_wuyygx4",
        "node_86v0oi5",
        "slow_table"
      ],
      "generalFundMin": 50000,
      "repeatableReqs": [],
      "perk": "",
      "phaseEssential": true,
      "emphasis": true,
      "costMonthly": null,
      "costYearly": null,
      "incomeMin": null,
      "incomeMax": null,
      "minProjectedIncome": null,
      "potentialGrantRevenue": null
    },
    {
      "id": "villas_phase1",
      "label": "First 10 Villas",
      "category": "revenue",
      "phase": 3,
      "cost": 2500000,
      "status": "locked",
      "description": "The first ten villas on the estate, establishing the BOGO model in its most visible form. Every paying guest at the standard rate of $1,300 per night funds a free stay for someone who needs it  -  a DV survivor, a foster family, a veteran, a low-income family who has never had access to a forest resort. The two stays are indistinguishable. Same villa, same service, same forest dining, same matchmaking walks, same everything. The mission guest does not know which stay was paid and which was funded. Neither does anyone else.\nThe villas are built to the winning specification from the Villa Design Contest  -  dog-forward spatial design throughout, natural materials, full Maine thermal performance, integrated with the forest rather than cleared from it. Each includes an exclusive-use outdoor yard of at least 5,445 sq ft (1/8 acre), fully fenced, child and dog safe, with the target of 10,890 sq ft (1/4 acre) where site conditions allow. All villas are structurally identical regardless of location. Location determines quality ranking, not construction standard.\nThe first villa built is the founder's  -  the worst-location unit on the estate, furthest from amenities, least favorable views, built first while site conditions are roughest. Emergency staff housing occupies the next-worst locations. Paying guests and mission guests occupy the best. This hierarchy is encoded in the governance documents and cannot be reversed.\nAt ten villas, the resort is not yet financially self-sustaining  -  this is a proof-of-concept phase, generating early revenue, testing operations, and demonstrating the model to the major donors who will fund the next twenty.",
      "dependencies": [
        "node_mzsbyr5",
        "node_7cjvxjl",
        "node_p7dxajh"
      ],
      "unlocks": [
        "villas_phase2",
        "rfid_system",
        "central_village",
        "node_w27q8fu"
      ],
      "generalFundMin": 600000,
      "repeatableReqs": [],
      "perk": "Cohort naming: \"First Ten Villas made possible by [Donor Name]\", permanent acknowledgment on the estate's founding donor wall in the central village, and the option to name one individual villa for a secondary donor.",
      "phaseEssential": true,
      "costMonthly": 13000,
      "incomeMin": 1100000,
      "incomeMax": 1550000,
      "costYearly": null,
      "emphasis": false,
      "minProjectedIncome": null,
      "potentialGrantRevenue": null
    },
    {
      "id": "villas_phase2",
      "label": "Next 20 Villas",
      "category": "revenue",
      "phase": 4,
      "cost": 5000000,
      "status": "locked",
      "description": "Expansion from the first ten villas to thirty, scaling the resort to the threshold of financial sustainability and proving the BOGO model at meaningful volume. The $5,000,000 covers construction of twenty additional villas to the same specification as the first cohort  -  same build standard, same minimum yard sizes, same materials  -  with location quality distributed according to the governance hierarchy: best-located units allocated to paying and mission guests, not to staff or operational use. At thirty villas, the resort begins generating the operating surplus that funds sanctuary operations at scale, reduces dependence on donor capital for running costs, and provides the financial track record that unlocks the major institutional funding required for Phase 4. The next twenty villas are also the first cohort built with the full operational infrastructure  -  central village, permanent water, paved road, full trail network  -  in place from day one, meaning the guest experience is materially better than the first ten. Each villa in this cohort is a named donor opportunity in its own right.",
      "dependencies": [
        "central_village"
      ],
      "unlocks": [
        "artisan_housing",
        "villas_phase3"
      ],
      "generalFundMin": null,
      "repeatableReqs": [],
      "perk": "",
      "costMonthly": null,
      "costYearly": null,
      "emphasis": false,
      "incomeMin": null,
      "incomeMax": null,
      "minProjectedIncome": null,
      "potentialGrantRevenue": null,
      "phaseEssential": false
    },
    {
      "id": "villas_phase3",
      "label": "50+ Villas",
      "category": "revenue",
      "phase": 4,
      "cost": 10000000,
      "status": "locked",
      "description": "Expansion from thirty villas to fifty-plus, completing the resort's primary accommodation inventory and establishing the full BOGO model at operational scale. The $10,000,000 covers construction of twenty or more additional villas, artisan housing (built to the same villa specification, grouped in a dedicated cluster away from guest areas), and any remaining estate infrastructure required to support full-capacity operations. At fifty-plus villas, the resort is generating the revenue that makes The Jewel fundable, the transport fleet viable, and the sanctuary's 1,000-dogs-per-year ambition achievable. Artisan partners housed on-site at this phase have the residential stability that makes long-term craft commitments possible  -  the bootmaker, the waller's apprentice, the blacksmith are no longer commuting. This phase also marks the point at which New Doggerland transitions from a project being built into an institution that exists. The governance framework, the physical estate, the operational model, and the community are all present simultaneously for the first time.",
      "dependencies": [
        "villas_phase2"
      ],
      "unlocks": [
        "the_jewel",
        "transport_fleet"
      ],
      "generalFundMin": null,
      "repeatableReqs": [],
      "perk": "",
      "costMonthly": null,
      "costYearly": null,
      "emphasis": false,
      "incomeMin": null,
      "incomeMax": null,
      "minProjectedIncome": null,
      "potentialGrantRevenue": null,
      "phaseEssential": false
    },
    {
      "id": "kustom_kibble",
      "label": "Kustom Kibble",
      "category": "revenue",
      "phase": 3,
      "cost": 85000,
      "status": "locked",
      "description": "A flagship retail experience occupying a dedicated storefront in the central village  -  the Jelly Belly factory store model applied to premium dog nutrition. Twenty to forty vertical dispensers line the walls in clear tubes, displaying bulk ingredients by category: proteins (chicken, beef, lamb, salmon, duck, venison), grains (rice, oats, quinoa, barley), vegetables (sweet potato, peas, carrots, pumpkin), supplements (glucosamine, fish oil, probiotics, joint support), and treat additions (freeze-dried liver, salmon bits). The store is visually compelling, educational, and interactive. Guests arrive with a dog and leave with a custom blend formulated for that specific animal.\nThe Kibble Koncierge  -  trained in canine nutrition, not just retail  -  guides each consultation. Age, weight, activity level, health conditions, allergies, current diet, and the dog's own demonstrated preferences via the scent menu all inform the recommendation. The Koncierge specifies a blend by percentage across components, the dispenser measures precisely, and the dog samples a bowl on-site before the guest commits to a purchase. The sample is free. The sample is also the most effective sales tool in the store  -  a dog that visibly loves what it's eating converts its owner immediately.\nEvery pound purchased funds a pound donated to a New Doggerland adopter who cannot afford quality nutrition for the dog they just took home. The effective cost to the guest is $8 per pound. The effective cost per dog fed  -  across the paying guest's dog and the donated pound  -  is $4. This undercuts premium commercial kibble while delivering a formulation specifically suited to the individual animal. The BOGO model cannot be eliminated for cost-saving purposes.\nAlumni adopters receive an ongoing subsidy  -  part of ND's lifelong dog support commitment  -  ensuring that the quality of nutrition a dog received in the sanctuary does not drop the moment it leaves. Online reordering is available to all guests and alumni, extending the revenue stream well beyond the on-site visit.",
      "dependencies": [
        "central_village",
        "cold_storage"
      ],
      "unlocks": [],
      "generalFundMin": 200000,
      "repeatableReqs": [],
      "perk": "Store naming: \"Kustom Kibble made possible by [Donor Name]\", permanent donor plaque at the store entrance, and the option to name the Kibble Koncierge program  -  the trained staff role that makes the experience possible.",
      "incomeMin": 120000,
      "incomeMax": 350000,
      "costMonthly": 22000,
      "costYearly": null,
      "emphasis": false,
      "minProjectedIncome": null,
      "potentialGrantRevenue": null,
      "phaseEssential": false
    },
    {
      "id": "artisan_housing",
      "label": "Artisan Housing",
      "category": "infrastructure",
      "phase": 4,
      "cost": 1500000,
      "status": "locked",
      "description": "A dedicated residential cluster for artisan partners  -  built to the same specification as guest villas, with the same construction standard, the same minimum outdoor yard area, and the same material quality, but grouped together in a distinct area of the estate away from guest accommodation zones. The $1,500,000 covers 6-10 dwellings sized for individuals or couples, with yards appropriately fenced for dogs. Artisan partners who occupy these dwellings have made long-term commitments to the estate  -  the master waller, the bootmaker, the blacksmith, the woodworker, the herbalist  -  and their housing reflects the seriousness of that commitment. This is not staff housing. It is not transient accommodation. It is a small, permanent residential community within the estate, occupied by people whose craft is embedded in New Doggerland's identity. Tenure arrangements are formalised in individual artisan partnership agreements, with governance protections ensuring that partners cannot be displaced without cause. The cluster is designed for neighborliness: close enough that artisans know each other, far enough from guest villas that both communities have genuine privacy.",
      "dependencies": [
        "villas_phase2",
        "artisan_partnership_program"
      ],
      "unlocks": [],
      "generalFundMin": null,
      "repeatableReqs": [],
      "perk": "",
      "costMonthly": null,
      "costYearly": null,
      "emphasis": false,
      "incomeMin": null,
      "incomeMax": null,
      "minProjectedIncome": null,
      "potentialGrantRevenue": null,
      "phaseEssential": false
    },
    {
      "id": "memory_lane_trail",
      "label": "Memory Lane Trail",
      "category": "resort",
      "phase": 3,
      "cost": 28000,
      "status": "locked",
      "description": "A 2-3 mile contemplative trail through the quietest section of the estate's forest, equipped with a weatherproof synchronised speaker system delivering a curated listening experience at low volume throughout the walk. The $28,000 covers weatherproof ground-level speaker units spaced every 40-60 metres along the trail, a central playback system, and the initial audio curation. The playlist spans 1955-2016  -  six decades of popular music sequenced to move through time as the walker moves through the forest. A guest who enters the trail in 1955 and walks for ninety minutes exits near 2016. The experience is solo by design  -  bookable for single walkers and small groups, not open to general foot traffic during active sessions. Dogs are welcome throughout. There is no signage explaining what the trail is. A guest learns about it from staff, from their villa information pack, or from another guest who walked it and cannot quite articulate what it did to them. It is one of the hardest things on the estate to describe and one of the most frequently mentioned in guest feedback.",
      "dependencies": [
        "basic_trails",
        "power_solar"
      ],
      "unlocks": [],
      "generalFundMin": null,
      "repeatableReqs": [],
      "perk": "",
      "costMonthly": null,
      "costYearly": null,
      "emphasis": false,
      "incomeMin": null,
      "incomeMax": null,
      "minProjectedIncome": null,
      "potentialGrantRevenue": null,
      "phaseEssential": false
    },
    {
      "id": "rfid_system",
      "label": "RFID Light & Sound",
      "category": "resort",
      "phase": 3,
      "cost": 120000,
      "status": "locked",
      "description": "A personalised light and sound system that creates a moving environmental response around each guest as they move through specific trail and outdoor zones at night. The $120,000 covers RFID reader infrastructure along the forest skating trails and key nocturnal trail sections, passive RFID tags embedded in guest wristbands issued at check-in, and a control system that triggers uplighting in the trees ahead of an approaching guest  -  warm amber uplights rising in sequence 30-50 metres forward of their position  -  while shifting the ambient soundscape through low-volume forest speakers. Each guest moves through their own private envelope of light and sound. Two guests passing on the trail experience briefly overlapping spheres before each resolves back to its own. The system was conceived for the forest skating trails  -  a guest skating through an uplighted Maine forest at night is one of the estate's signature experiences, not currently available anywhere else in the United States  -  but extends to evening trail walking, the Memory Lane Trail, and any night-time outdoor programming where the effect enhances rather than intrudes. The RFID wristband doubles as the estate's access and payment system for all bookable activities.",
      "dependencies": [
        "central_village",
        "broadband"
      ],
      "unlocks": [
        "skating_trails"
      ],
      "generalFundMin": null,
      "repeatableReqs": [],
      "perk": "",
      "costMonthly": null,
      "costYearly": null,
      "emphasis": false,
      "incomeMin": null,
      "incomeMax": null,
      "minProjectedIncome": null,
      "potentialGrantRevenue": null,
      "phaseEssential": false
    },
    {
      "id": "water_channels",
      "label": "Water Channels",
      "category": "resort",
      "phase": 3,
      "cost": 45000,
      "status": "locked",
      "description": "A network of stone-lined water channels and rills distributed through the central village and along key trail sections, fed by gravity from a header tank supplied by the estate well. Channels are constructed in the Dutch tradition  -  narrow, stone-dressed, precisely levelled  -  running along path edges and through the village courtyard, with integrated misting points at intervals along the hottest summer trail sections. Water sounds throughout the estate: moving water at low volume is one of the most effective anxiety-reduction tools for both dogs and humans in high-stimulation environments.\n\nThe $45,000 cost covers approximately 400-600 linear metres of channel construction, the header tank and gravity-feed infrastructure, misting nozzle installation at 20-30 points along summer trail sections, and stone sourcing consistent with the perimeter wall aesthetic. The channels serve dogs directly  -  shallow, accessible, clean moving water at frequent intervals means dogs on trail walks are never more than a few minutes from a drink. The misting system extends the comfortable operating range for dogs in summer heat, reducing the weather-dependency of outdoor operations in July and August.",
      "dependencies": [
        "central_village"
      ],
      "unlocks": [],
      "generalFundMin": null,
      "repeatableReqs": [],
      "perk": "",
      "costMonthly": null,
      "costYearly": null,
      "emphasis": false,
      "incomeMin": null,
      "incomeMax": null,
      "minProjectedIncome": null,
      "potentialGrantRevenue": null,
      "phaseEssential": false
    },
    {
      "id": "tree_art",
      "label": "Arborsculpture / Living Tree Forms",
      "category": "legacy",
      "phase": 1,
      "cost": 12000,
      "status": "locked",
      "description": "A permanent, multi-decade living art program in which selected trees across the estate are trained into deliberate sculptural forms through repeated seasonal interventions  -  pleaching, espalier, grafting, weaving, and crown-shaping techniques that guide living wood over years and decades into arches, tunnels, woven groves, and council circles. The $12,000 node covers species selection and planting (whips and young trees positioned for training), basic tooling and training infrastructure, and engagement of an arborist or arborsculptor to establish the first cohort of forms and train the estate's land team in ongoing maintenance technique. Individual projects include: a pleached lime tunnel linking two trail sections (15-20 years to maturity), a woven hornbeam council circle for outdoor gatherings (8-12 years), espalier fruit walls on south-facing structures (productive within 3-5 years), and Loki's Arch  -  a dedicated living arch over the path to the estate's sacred ground, planted from day one and shaped across generations. Foster youth participate annually in training and maintenance, learning a craft that operates on timescales longer than any individual career. The $400 monthly covers the arborist's seasonal visits and materials.",
      "dependencies": [
        "basic_trails"
      ],
      "unlocks": [],
      "generalFundMin": null,
      "repeatableReqs": [],
      "perk": "Program naming: \"Tree Art Walk made possible by [Donor Name]\"; sponsored individual \"trained trees\" with discreet tags; and optional \"Founding Tree\" dedication for the first completed form.",
      "costMonthly": 400,
      "costYearly": null,
      "emphasis": false,
      "incomeMin": null,
      "incomeMax": null,
      "minProjectedIncome": null,
      "potentialGrantRevenue": null,
      "phaseEssential": false
    },
    {
      "id": "firewood",
      "label": "Firewood Sales",
      "category": "revenue",
      "phase": 1,
      "cost": 8000,
      "status": "locked",
      "description": "Production and sale of Maine-legal seasoned firewood from the estate's own forest management operations  -  primarily timber from trail clearing, wind damage, disease removal, and sustainable selective harvest. Output is measured and sold in Maine legal cords (128 cubic feet stacked, or the state-defined loose-thrown cord volumes for 12-16 inch lengths). The $8,000 covers chainsaw equipment, a log splitter, a seasoning rack system, and the initial firewood bay construction at the staging area. Annual production ceiling is estimated at approximately 130 cords per year, applying Maine's published woodland growth benchmark of one-third cord per acre per year to 400 acres  -  though actual yield depends heavily on stand conditions, harvest plan, and the volume of incidental timber from trail and infrastructure work. At 2026 Maine retail prices of $350-$500 per cord, maximum annual revenue is $45,500-$65,000. In practice, firewood production is a byproduct of land stewardship rather than a primary activity  -  the estate is clearing and managing forest for ecological and operational reasons, and firewood sales convert that necessary work into revenue rather than disposal cost.",
      "dependencies": [
        "node_b60pxf9",
        "node_k2vimcu"
      ],
      "unlocks": [],
      "generalFundMin": 5000,
      "repeatableReqs": [
        {
          "repeatableId": "log_splitter",
          "minCount": 1
        },
        {
          "repeatableId": "utv_trailer",
          "minCount": 1
        }
      ],
      "perk": "\"Founding Woodheat Program made possible by [Donor Name]\"; donor plaque at the firewood bay; sponsor-tagged \"Season Firewood made possible by [Donor Name]\" on the public tree.",
      "incomeMin": 65000,
      "incomeMax": 185000,
      "costMonthly": null,
      "costYearly": null,
      "emphasis": false,
      "minProjectedIncome": null,
      "potentialGrantRevenue": null,
      "phaseEssential": false
    },
    {
      "id": "chaga_program",
      "label": "Chaga Programme",
      "category": "revenue",
      "phase": 1,
      "cost": 15000,
      "status": "locked",
      "description": "Chaga (Inonotus obliquus) is a slow-growing parasitic fungus found on birch trees across the Northern Hemisphere, harvested and brewed as a medicinal and culinary tea for centuries across Scandinavia and Russia. New Doggerland's Maine forest contains mature birch stands  -  a natural substrate for both wild harvest and cultivated inoculation. The $15,000 node covers inoculation of selected birch trees with chaga spawn, establishment of a sustainable wild-harvest rotation protocol for naturally occurring chaga on the property, and basic drying and processing infrastructure for an on-site product. Chaga grows slowly  -  harvestable concentrations on inoculated trees take 7-15 years to establish, though wild harvest of existing chaga can begin from day one on appropriate stands. Once productive, the program yields a genuinely premium, estate-grown ingredient feeding directly into Gingerworks (chaga ginger beer is the brewery's signature product), the restaurant, and a retail product line. Annual income at full production: $200,000-$300,000. No income is expected in years 1-6; this is a long-horizon investment consistent with the institution's time horizon.",
      "dependencies": [
        "basic_trails"
      ],
      "unlocks": [
        "gingerworks"
      ],
      "generalFundMin": null,
      "repeatableReqs": [],
      "perk": "Program naming: \"Chaga Program made possible by [Donor Name]\", acknowledgment on the program page.",
      "incomeMin": 200000,
      "incomeMax": 300000,
      "costMonthly": null,
      "costYearly": null,
      "emphasis": false,
      "minProjectedIncome": null,
      "potentialGrantRevenue": null,
      "phaseEssential": false
    },
    {
      "id": "transport_fleet",
      "label": "Transport Fleet",
      "category": "sanctuary",
      "phase": 4,
      "cost": 1200000,
      "status": "locked",
      "description": "A fleet of purpose-built large-scale rescue transport vehicles  -  the first of which costs $1,200,000, with subsequent units at approximately $900,000 each, targeting a full fleet of 12. Each vehicle is a self-contained mobile rescue operation: dog compartments sized for comfort over transport efficiency (crates above minimum standard, climate controlled, acoustically dampened), a dedicated veterinary care area with examination surface, medication storage, and emergency treatment capability, a structured exercise corridor allowing dogs to move and decompress during long transits, staff sleeping bunks for multi-day operations, and a small kitchen and mess area. The fleet's primary function is large-scale rescue operations  -  interstate shelter transfers, natural disaster response, hoarding case extractions, and any situation requiring the safe movement of dozens of dogs simultaneously over long distances. At full fleet strength, New Doggerland can mobilise a coordinated transport operation capable of moving 120-200 dogs in a single deployment. Each vehicle is also a named donor opportunity at the highest tier  -  $900,000-$1,200,000 gifts that are among the most tangible single-donor contributions the organization can offer. Total fleet cost at 12 vehicles: approximately $11,100,000.",
      "dependencies": [
        "vet_facility",
        "villas_phase3",
        "node_e0ynnbc"
      ],
      "unlocks": [],
      "generalFundMin": null,
      "repeatableReqs": [],
      "perk": "",
      "costMonthly": null,
      "costYearly": null,
      "emphasis": false,
      "incomeMin": null,
      "incomeMax": null,
      "minProjectedIncome": null,
      "potentialGrantRevenue": null,
      "phaseEssential": false
    },
    {
      "id": "the_jewel",
      "label": "The Jewel",
      "category": "resort",
      "phase": 4,
      "cost": 42000000,
      "status": "locked",
      "description": "A single integrated aquatic district where humans and dogs share water in parallel  -  the only facility of its kind anywhere. The design language is forest lagoon, not theme park concrete. The Jewel feels found rather than built: warm light on water, timber and stone, moss at the edges, trees visible through the envelope. It is the crown of New Doggerland and the primary reason guests book in February.\nSpatial core. A central lagoon spine runs the length of the facility, visually unifying the district and anchoring three concentric rings of intensity. The zero-stress ring  -  shallow, warm, acoustically quiet  -  serves seniors, toddlers, and anxious dogs simultaneously. The play ring offers moderate energy and structured features. The high-energy ring contains slides, currents, distance fetch lanes, and athletic elements. Each ring is accessible from the central spine and clearly distinguished by surface treatment, sound level, and staffing density.\nSignature experiences. The Aqua Fetch Bay is the anchor attraction  -  a fan-shaped splash zone with fixed forward-facing launch systems, drift capture geometry, non-slip docks, and one-dog-at-a-time release controls for long-range lanes. It is the indoor realization of the Extreme Fetch Field, scaled for a controlled aquatic environment. Two parallel lazy rivers run side by side  -  a human river with tubes and a dog current loop with gentle flow, stepped entry, and frequent exits  -  separated by transparent barriers so families remain visually together without uncontrolled mixing. Calm Cove decompression pools sit off the main spine: acoustically damped, minimal splashing, trauma-informed design for nervous dogs and guests who need a quieter water experience. A shallow forest beach provides gradual entry for both species, with clear zoning and staff-managed gates.\nSafety and control. Hard zoning with soft visibility  -  physical separation where safety demands it, sightlines preserved throughout so families never lose visual contact across zones. Non-slip surfaces and paw-safe traction everywhere, no algae-prone materials in high-contact zones. One-way dog circulation in busy areas eliminates face-to-face bottlenecks. Frequent ramps, steps, and side egress points ensure no human or dog is ever trapped in a water flow. Eligibility gates at zone entries enforce height, swim ability, and dog temperament categories, with live staff authority to route guests at any point.\nSensory and aesthetic qualities. Timber, stone, mossy edges, and low-profile structures throughout. Night identity built on warm, low-glare lighting that reflects on water without stadium effect. Sound discipline in the calm ring: water features tuned to suppress constant high-frequency splash noise, creating a genuinely restful acoustic environment within a large wet facility.\nOperational backbone. Overlapping lifeguard and dog-guard station coverage with no blind spots. Dog life jacket library and fit-check points at all water entries. Warm rinse and drying corridor for dogs before re-entering guest areas. Water quality regime designed explicitly for mixed-use realities  -  real-time monitoring per zone with rapid independent closure capability. No zone's closure requires shutting the facility.",
      "dependencies": [
        "villas_phase3",
        "node_7aai9m0"
      ],
      "unlocks": [],
      "generalFundMin": 8000000,
      "repeatableReqs": [],
      "perk": "Facility naming: \"The Jewel made possible by [Donor Name]\", permanent donor plaque at the main entrance, and a named element within the facility  -  the Aqua Fetch Bay, the central lagoon spine, or the shallow forest beach  -  for the lead sponsor.",
      "costMonthly": 110000,
      "incomeMin": 1200000,
      "incomeMax": 2200000,
      "costYearly": null,
      "emphasis": false,
      "minProjectedIncome": null,
      "potentialGrantRevenue": null,
      "phaseEssential": false
    },
    {
      "id": "node_mzsbyr5",
      "label": "Disc Golf Course",
      "category": "community",
      "phase": 1,
      "cost": 4000,
      "status": "locked",
      "description": "An 18-hole public disc golf course routed through the estate's forest, built primarily with community volunteer labor. New Doggerland supplies the purchased inputs: professional-grade steel basket targets at $300-$500 each (18 required = $5,400-$9,000), tee pad materials ($100-$200 per hole), signage, and scorecards  -  with the $4,000 allocation covering ND's direct cost contribution. The volunteer labor component (typically 200-400 hours for an 18-hole layout) is contributed by local disc golf clubs and community members who benefit from free ongoing access. Course design routes through the most scenic sections of the forest, using natural terrain  -  elevation changes, water crossings, dense tree corridors  -  as design elements. Day passes are $5-$8; play is free for estate guests. A course that would cost $40,000-$80,000 commercially is delivered for $4,000 through community partnership  -  the model New Doggerland applies across all community amenity nodes where local engagement can substitute for capital outlay.",
      "dependencies": [
        "access_road",
        "node_k2vimcu"
      ],
      "unlocks": [],
      "generalFundMin": null,
      "repeatableReqs": [],
      "perk": "Course naming: \"Disc Golf Course made possible by [Donor Name]\", acknowledgment on the course map and tee markers.",
      "phaseEssential": false,
      "incomeMin": null,
      "incomeMax": null,
      "costMonthly": null,
      "costYearly": null,
      "emphasis": false,
      "minProjectedIncome": null,
      "potentialGrantRevenue": null
    },
    {
      "id": "node_coro4fa",
      "label": "Forest Golf Course",
      "category": "community",
      "phase": 1,
      "cost": 18000,
      "status": "locked",
      "description": "An 18-hole forest golf course routed through the estate using minimal clearance  -  designed to work with the existing tree canopy rather than clear it. Each hole consists of a large metal bell suspended from a low timber frame; a hole is completed by striking the bell rather than sinking a ball in a cup, eliminating the need for maintained greens and making the course genuinely all-weather and low-maintenance. Players navigate the forest with a club and ball, completing the course by sound  -  the ring of a struck bell carrying through the trees. The course can be reconfigured seasonally by relocating the bell frames, providing variety for returning guests without additional construction. A basic roofed staging pavilion at the start holds rental clubs and balls and provides weather shelter for group tee-off. Play price is $12 per round with optional club and ball rental; free for estate guests. At 20-40 rounds per day during peak season, the course generates $25,000-$60,000 annually. Minimal ongoing maintenance cost  -  no greens, no fairway mowing, no irrigation.",
      "dependencies": [
        "access_road",
        "node_k2vimcu"
      ],
      "unlocks": [],
      "generalFundMin": null,
      "repeatableReqs": [],
      "perk": "Course naming: \"Forest Golf Course made possible by [Donor Name]\", sponsor plaque at the staging pavilion.",
      "phaseEssential": false,
      "incomeMin": 8000,
      "incomeMax": 21000,
      "costMonthly": null,
      "costYearly": null,
      "emphasis": false,
      "minProjectedIncome": null,
      "potentialGrantRevenue": null
    },
    {
      "id": "node_ivc46ur",
      "label": "Public Dog Park",
      "category": "community",
      "phase": 1,
      "cost": 185000,
      "status": "locked",
      "description": "A purpose-built public off-leash dog park occupying 0.5 acres, designed to the highest standard of dog park infrastructure and open to the public at no charge. Two separated activity zones  -  one for large and high-energy dogs, one for small and senior dogs  -  are enclosed within a double-airlock entry fencing system preventing escape during entry and exit. Surface is shredded wood mulch over compacted base for drainage and cushioning. The park includes a covered shelter pavilion with handler seating, four water stations with dog-height bowls and human-height taps, picnic tables and benches, waste bag dispensers and lidded bins at all entry points, tick-check stations, and a full commercial agility equipment set  -  A-frame, tunnel, weave poles, jump bars, and pause table  -  integrated into the large-dog zone. The $185,000 covers land clearing, grading and drainage, double-airlock perimeter fencing, internal zone divider, pavilion construction, mulch surfacing, equipment, and all fixtures. The public dog park is New Doggerland's primary community-facing asset in Phase 1  -  free, welcoming, and visible before the resort opens. It is the first reason a local family with a dog has to visit, and the first experience that builds the local reputation the organization depends on.",
      "dependencies": [
        "access_road"
      ],
      "unlocks": [],
      "generalFundMin": 6500,
      "repeatableReqs": [],
      "perk": "Park naming: \"Public Dog Park made possible by [Donor Name]\", donor plaque on the pavilion, and named agility elements (e.g., \"Weave Poles made possible by [Donor Name]\") for secondary donors. \"Founding Day\" first-use ceremony for the primary sponsor.",
      "phaseEssential": false,
      "emphasis": true,
      "costMonthly": null,
      "costYearly": null,
      "incomeMin": null,
      "incomeMax": null,
      "minProjectedIncome": null,
      "potentialGrantRevenue": null
    },
    {
      "id": "node_6j8nnxz",
      "label": "Adventure Playground",
      "category": "community",
      "phase": 1,
      "cost": 135000,
      "status": "locked",
      "description": "A timber-built adventure playground in the tradition of the 1990s European adventure playground  -  large, physical, genuinely challenging, and integrated into real forest terrain rather than safety-surfaced flat ground. Built across 0.25 acres with the estate's resident woodworker as lead builder, the playground uses the forest's own trees, roots, slopes, and natural features as structural elements alongside built timber structures. The $135,000 covers timber materials, hardware, safety surfacing in fall zones, perimeter fencing, a parent shelter pavilion with seating and weather cover, water stations, tick-check points, and the woodworker's construction time. Structures include a multi-level timber fort with rope traverses and cargo net climbs, a lookout deck sited in an existing tree, a balance and agility trail using logs and stumps, a supervised fire pit area for older children, and a mud kitchen. The playground is for children, but dogs on lead are welcome in the parent area throughout. Age guidance rather than age restrictions  -  parents assess their own child's capability. The 1990s design ethic is deliberate: real risk, real reward, real forest.",
      "dependencies": [
        "access_road"
      ],
      "unlocks": [],
      "generalFundMin": 9200,
      "repeatableReqs": [],
      "perk": "Park naming: \"Adventure Playground made possible by [Donor Name]\", sponsor plaque on the parent shelter, and named major elements (e.g., \"Timber Fort made possible by [Donor Name]\", \"Rope Traverse made possible by [Donor Name]\") for secondary donors.",
      "phaseEssential": false,
      "costMonthly": null,
      "costYearly": null,
      "emphasis": false,
      "incomeMin": null,
      "incomeMax": null,
      "minProjectedIncome": null,
      "potentialGrantRevenue": null
    },
    {
      "id": "node_nxnzzqr",
      "label": "SAR Training Area",
      "category": "community",
      "phase": 1,
      "cost": 36000,
      "status": "locked",
      "description": "A designated search and rescue (SAR) training area positioned on the least mission-critical land on the estate  -  marginal terrain unsuitable for sanctuary, villa, or primary amenity use that becomes highly valuable when given a specific purpose. The $36,000 covers a 6-car gravel parking lot (accessible directly from the access road without entering the main estate), a simple covered staging area with a picnic table and power hookup, basic fencing enclosing approximately one acre of varied terrain, and entry signage. The area is made available to local SAR teams, fire department search units, and K9 units at no charge in exchange for relationship, goodwill, and the political capital that comes from being the organization that gave the county's SAR teams a permanent training ground. First responders who train on-site know the layout, the terrain, and the staff  -  when New Doggerland eventually needs emergency access at 300+ acres with dogs, children, and vulnerable guests, the response will be faster and better than for any other rural property of comparable size. The community relationship is the primary return. The SAR area is also New Doggerland's most credible political investment at the local government level.",
      "dependencies": [
        "access_road",
        "basic_trails"
      ],
      "unlocks": [],
      "generalFundMin": 2500,
      "repeatableReqs": [],
      "perk": "Area naming: \"SAR Training Area made possible by [Donor Name]\" on the entry sign, plus a donor plaque at the staging area.",
      "phaseEssential": false,
      "emphasis": true,
      "costMonthly": null,
      "costYearly": null,
      "incomeMin": null,
      "incomeMax": null,
      "minProjectedIncome": null,
      "potentialGrantRevenue": null
    },
    {
      "id": "node_xy757nh",
      "label": "Archery field",
      "category": "community",
      "phase": 1,
      "cost": 23000,
      "status": "locked",
      "description": "A timber-framed, roofed shooting structure with seating for up to 10 archers, opening onto two isolated firing lanes separated by heavy timber baffles. Lane lengths are set at 10m and 20m to accommodate beginners through intermediate shooters. A mix of 3D animal targets and traditional bag targets are rotated seasonally. Equipment rental is available on-site  -  recurve bows in multiple draw weights, arrows, and armguards  -  making the range accessible to first-time visitors. A $10 day pass covers unlimited shooting; rental gear is additional. Dog-friendly  -  dogs must be leashed and far behind the shooting line.",
      "dependencies": [
        "basic_trails",
        "access_road",
        "node_k2vimcu"
      ],
      "unlocks": [],
      "generalFundMin": null,
      "repeatableReqs": [],
      "perk": "Range naming: \"Archery Range made possible by [Donor Name]\", sponsor plaque at the roofed structure entrance, and named lane markers for secondary donors.",
      "phaseEssential": false,
      "incomeMin": 12000,
      "incomeMax": 22000,
      "costMonthly": null,
      "costYearly": null,
      "emphasis": false,
      "minProjectedIncome": null,
      "potentialGrantRevenue": null
    },
    {
      "id": "node_5rnby5e",
      "label": "Food forest",
      "category": "legacy",
      "phase": 1,
      "cost": 6000,
      "status": "locked",
      "description": "A long-horizon program establishing dozens of perennial food plant species throughout the estate  -  integrated into the forest, trail edges, clearings, and open zones rather than concentrated in a single growing area. The $6,000 covers initial seed stock, rhizomes, and bare-root plants across a curated species list selected for Maine hardiness, perennial habit, and nutritional or ecological value: salsify, Jerusalem artichoke, yarrow, wild strawberry, lamb's lettuce, dead nettle, sea kale, fat hen, lovage, French corn salad, good King Henry, Alexanders, Welsh onion, comfrey, tepary beans, scorzonera, and quince among others. Planting begins in Phase 1 and continues every season indefinitely. The design principle is discovery rather than garden: plants are sited along trails, beside water features, and in clearings so visitors encounter abundance without it appearing managed. In thirty years, a guest walking the trail network will move through a genuinely food-productive forest that appears entirely natural. The $500 monthly covers seasonal planting, propagation, and management by the land stewardship team and foster youth participants.",
      "dependencies": [
        "basic_trails",
        "water_well"
      ],
      "unlocks": [],
      "generalFundMin": null,
      "repeatableReqs": [
        {
          "repeatableId": "utv_trailer",
          "minCount": 1
        }
      ],
      "perk": "Area naming: \"Food Forest made possible by [Donor Name]\", acknowledgment on trail interpretive signage.",
      "phaseEssential": false,
      "costMonthly": 500,
      "costYearly": null,
      "emphasis": false,
      "incomeMin": null,
      "incomeMax": null,
      "minProjectedIncome": null,
      "potentialGrantRevenue": null
    },
    {
      "id": "node_aaji5ku",
      "label": "Cross-country ski trails",
      "category": "community",
      "phase": 1,
      "cost": 16000,
      "status": "locked",
      "description": "Weather-permitting seasonal activation of 8+ miles of the existing trail network as groomed cross-country ski loops, operating December through February in Southern Maine when snowfall and temperatures allow. The $16,000 covers trail widening and low-branch clearing where existing paths require it, winter-specific directional signage and trail markers, a track-setter attachment for the estate's UTV to groom classic ski tracks after snowfall, and equipment rental infrastructure at the trailhead  -  classic and skate skis in multiple sizes, poles, and boot adapters. Two circuits are offered: a 3 km beginner loop and a 6 km intermediate loop. The beginner loop doubles as the dog skijoring program's dedicated circuit during designated time windows. Classic and skate-ski variants are offered where trail width allows. Monthly operational costs during the ski season include grooming after each significant snowfall, equipment maintenance, and trailhead staffing. Day pass $15; equipment rental additional. Free for estate guests. The program is weather-dependent by nature  -  Southern Maine winters are variable, and some seasons will offer more operating days than others  -  but the infrastructure investment is modest enough that a partial season still justifies the cost.",
      "dependencies": [
        "basic_trails",
        "node_k2vimcu",
        "node_p7dxajh",
        "estate_vehicles"
      ],
      "unlocks": [
        "node_pgm840u"
      ],
      "generalFundMin": null,
      "repeatableReqs": [
        {
          "repeatableId": "snow_blower",
          "minCount": 1
        }
      ],
      "perk": "Season naming: \"Cross-Country Ski Season made possible by [Donor Name]\", sponsor acknowledgment on the trail map and trailhead signage, and a named rest shelter or warming bench on the course.",
      "phaseEssential": false,
      "costMonthly": null,
      "costYearly": null,
      "emphasis": false,
      "incomeMin": null,
      "incomeMax": null,
      "minProjectedIncome": null,
      "potentialGrantRevenue": null
    },
    {
      "id": "node_pgm840u",
      "label": "Dog Skijoring",
      "category": "resort",
      "phase": 2,
      "cost": 4800,
      "status": "locked",
      "description": "A dedicated dog skijoring program running on the beginner cross-country ski loop, where a skier is harnessed to one or two dogs via a bungee towline and pulled through the forest trail. New Doggerland provides harness and towline rental, a short orientation session, and a designated skijoring-only time window on the beginner loop to prevent conflicts with unattached skiers. The program is open to all guests  -  those bringing their own dogs rent equipment and go, while first-timers can book an orientation session.\nSkijoring has a discovery problem, not a product problem. Most visitors will not know what it is when they arrive. A single visible session on the trail  -  a dog surging ahead, a skier flying through the pines  -  is the only marketing required. Once seen, it is immediately wanted. Expect slow uptake in year one and a meaningfully different picture by year three as it becomes one of the estate's signature winter activities.\nThe program also runs with sanctuary dogs assessed as suitable for the activity. For high-energy rescue dogs, structured skijoring sessions provide outlet, improve temperament assessment accuracy, and increase adoptability. For potential adopters, a skijoring session with a sanctuary dog they are considering is among the most powerful pre-adoption bonding experiences the estate can offer  -  a guest who has run a mile through a Maine forest behind that dog is not a hesitant adopter. Staff supervision is required for all sanctuary dog pairings.",
      "dependencies": [
        "node_aaji5ku"
      ],
      "unlocks": [],
      "generalFundMin": null,
      "repeatableReqs": [],
      "perk": "Program naming: \"Skijoring Program made possible by [Donor Name]\", sponsor acknowledgment on the rental equipment and trail signage, and an invitation to the inaugural skijoring session.",
      "phaseEssential": false,
      "incomeMin": 2500,
      "incomeMax": 14000,
      "costYearly": 1500,
      "costMonthly": null,
      "emphasis": false,
      "minProjectedIncome": null,
      "potentialGrantRevenue": null
    },
    {
      "id": "node_0p03fw9",
      "label": "Orienteering courses",
      "category": "community",
      "phase": 1,
      "cost": 4500,
      "status": "locked",
      "description": "Two permanent orienteering courses laid out across the trail network using weatherproof marker posts and laminated control cards  -  a beginner loop of approximately 2 km and an intermediate course of approximately 5 km. Course maps are printed in-house and available at the trailhead kiosk at no charge. The $4,500 covers marker posts, laminated control cards, map design and printing, and a digital course-setting system allowing seasonal course variation without replacing hardware. A dog-friendly variant  -  \"dog-O\"  -  runs controls at nose height along dog-accessible routes, designed for off-leash running with a handler following a map. Seasonal score-O events are open to the public at no charge, building local community engagement with the trail network. Orienteering has a discovery problem  -  most visitors don't know what it is until they try it  -  but a single completed beginner course typically converts a first-timer into a returning participant. The estate's varied terrain, forest density, and 15+ miles of trail network make it an unusually good orienteering venue.",
      "dependencies": [
        "basic_trails",
        "node_k2vimcu"
      ],
      "unlocks": [],
      "generalFundMin": null,
      "repeatableReqs": [],
      "perk": "Course naming: \"Orienteering Courses made possible by [Donor Name]\", sponsor acknowledgment on all printed course maps, and a named control post at the start/finish point.",
      "phaseEssential": false,
      "costMonthly": null,
      "costYearly": null,
      "emphasis": false,
      "incomeMin": null,
      "incomeMax": null,
      "minProjectedIncome": null,
      "potentialGrantRevenue": null
    },
    {
      "id": "node_ijjcwty",
      "label": "Community BMX track",
      "category": "community",
      "phase": 1,
      "cost": 16000,
      "status": "locked",
      "description": "A dirt BMX track built primarily with community volunteer labor on marginal estate land, with New Doggerland supplying the purchased inputs: imported fill or soil amendments where terrain requires it, erosion control fabric and matting on key berms and jumps, any rented equipment time for compaction and shaping, basic entry signage, and safety delineation at the track perimeter. The $16,000 covers ND's direct cost contribution; the design, shaping, and construction labor is contributed by local BMX riders and clubs who benefit from a permanent free-to-use facility. A well-designed beginner-to-intermediate BMX track typically includes a starting hill, 4-6 rhythm sections, 2-3 bermed corners, and a finishing straight  -  achievable on 0.25-0.5 acres of suitable terrain. The track is maintained by the community that built it, with ND providing materials for seasonal repairs. Free to use, no booking required. Dogs on lead permitted in the spectator area.",
      "dependencies": [
        "access_road",
        "node_k2vimcu"
      ],
      "unlocks": [],
      "generalFundMin": 2000,
      "repeatableReqs": [],
      "perk": "Track naming: \"BMX Track made possible by [Donor Name]\"; named start hill or named feature zones for secondary donors; sponsor plaque at the entry sign.",
      "phaseEssential": false,
      "costMonthly": null,
      "costYearly": null,
      "emphasis": false,
      "incomeMin": null,
      "incomeMax": null,
      "minProjectedIncome": null,
      "potentialGrantRevenue": null
    },
    {
      "id": "node_37li943",
      "label": "Off-leash trail",
      "category": "revenue",
      "phase": 1,
      "cost": 74000,
      "status": "locked",
      "description": "A dedicated fenced off-leash trail loop providing fully enclosed, gate-secured off-leash running for dogs whose owners want the freedom of off-leash movement without the open terrain of the broader estate. The 0.5-mile loop is 50 feet wide  -  two parallel fence lines creating a generous corridor rather than a narrow run  -  with double-gate airlock entries at each end preventing escape during entry and exit. The $74,000 covers fencing and gate hardware for the full perimeter (approximately 5,800 linear feet of fencing at two fence lines), airlock gate construction, trail surface preparation within the corridor, rules and safety signage at both entry points, and basic tick-control stations. The loop is bookable for a fee, giving a single party exclusive use for a defined time window  -  preventing the uncontrolled dog-to-dog encounters that make standard off-leash areas stressful for reactive dogs or anxious owners. For guests with dogs that cannot safely be off-leash in open environments, this is the most important amenity on the estate.",
      "dependencies": [
        "basic_trails"
      ],
      "unlocks": [],
      "generalFundMin": 4800,
      "repeatableReqs": [],
      "perk": "Loop naming: \"Off-Leash Trail made possible by [Donor Name]\", named airlock gates, and sponsor plaques at each entry sign.",
      "phaseEssential": false,
      "incomeMin": 15000,
      "incomeMax": 32000,
      "costMonthly": null,
      "costYearly": null,
      "emphasis": false,
      "minProjectedIncome": null,
      "potentialGrantRevenue": null
    },
    {
      "id": "node_55rktrk",
      "label": "On-site Camping",
      "category": "revenue",
      "phase": 2,
      "cost": 11500,
      "status": "locked",
      "description": "Private, fenced, dog-safe camping plots distributed through the estate, each a quarter acre with a level pad, fire ring, picnic table, power hookup, and direct trail access. Sites are fully enclosed with dog-safe fencing and a latching gate  -  guests can set up camp and let their dogs roam freely within the site without supervision. The shared sanitation block provides toilets, showers, and dog wash stations. Plots are bookable by the night or week. A minimum of 6 sites are required to open the campground; the repeatable pad system allows the campground to scale to 25 sites as demand grows.",
      "dependencies": [
        "node_min2uja",
        "node_k2vimcu"
      ],
      "unlocks": [],
      "generalFundMin": null,
      "repeatableReqs": [
        {
          "repeatableId": "camping_pad",
          "minCount": 6
        }
      ],
      "perk": "Campground naming: \"Campground made possible by [Donor Name]\", permanent plaque at the campground entrance, and optional named individual sites for secondary donors.",
      "phaseEssential": true,
      "incomeMin": 55000,
      "incomeMax": 230000,
      "costMonthly": null,
      "costYearly": null,
      "emphasis": false,
      "minProjectedIncome": null,
      "potentialGrantRevenue": null
    },
    {
      "id": "node_min2uja",
      "label": "Basic Sanitation Block",
      "category": "infrastructure",
      "phase": 2,
      "cost": 208000,
      "status": "locked",
      "description": "A permanent, year-round sanitation block serving campers, day visitors, and staff. The facility contains 12 unisex self-contained toilet stalls, 4 shower stalls, 2 kitchen sink areas for food prep and washing up, and 2 raised dog wash stations with warm water, restraint bars, and drainage. All stalls are ADA-width to accommodate mobility aids and families with dogs. Construction is timber-frame with durable tile throughout, forced ventilation, and a heating system sized for Maine winters. The dog wash stations are open to all visitors  -  not gated behind a paid tier  -  and positioned at the facility entrance for easy trail access. Hot water is supplied by an on-demand system to handle peak morning demand from the campground.",
      "dependencies": [
        "access_road",
        "power_solar",
        "node_5mltlag"
      ],
      "unlocks": [
        "node_55rktrk",
        "forest_dining",
        "node_22draly"
      ],
      "generalFundMin": null,
      "repeatableReqs": [],
      "perk": "Facility naming: \"Bathhouse made possible by [Donor Name]\", permanent donor plaque at the entrance, and named dog wash stations for secondary donors.",
      "phaseEssential": true,
      "costMonthly": 4400,
      "costYearly": null,
      "emphasis": false,
      "incomeMin": null,
      "incomeMax": null,
      "minProjectedIncome": null,
      "potentialGrantRevenue": null
    },
    {
      "id": "node_b60pxf9",
      "label": "Founder Family Home",
      "category": "infrastructure",
      "phase": 1,
      "cost": 172000,
      "status": "locked",
      "description": "A temporary but fully functional founder residence suitable for a family of three, with a dedicated volunteer meeting area, mud room, internal capacity to foster 4 dogs while keeping 3 personal dogs, a securely fenced yard sized for extended unsupervised dog time, and an on-site sewage solution via a conventional septic system.\n",
      "dependencies": [
        "water_well"
      ],
      "unlocks": [
        "dutch_snackbar",
        "dog_daycare",
        "firewood",
        "sanctuary_core",
        "basic_trails",
        "node_3m4u27z",
        "node_28axmgy",
        "node_cayx77v"
      ],
      "generalFundMin": 20000,
      "repeatableReqs": [],
      "perk": "Dwelling naming: \"Founder Base Cabin made possible by [Donor Name]\", plaque in the meeting area, and a named dog yard gate sign (\"Canine Yard made possible by [Donor Name]\").",
      "phaseEssential": false,
      "emphasis": true,
      "costMonthly": null,
      "costYearly": null,
      "incomeMin": null,
      "incomeMax": null,
      "minProjectedIncome": null,
      "potentialGrantRevenue": null
    },
    {
      "id": "node_8s8q8at",
      "label": "Mushroom Grove",
      "category": "revenue",
      "phase": 1,
      "cost": 5600,
      "status": "locked",
      "description": "Hardwood logs sourced from trail clearing operations are inoculated with culinary mushroom spawn  -  primarily lion's mane, oyster, and shiitake  -  and laid in shaded forest rows to fruit over a 12-24 month establishment period. A designated Mushroom Grove of 200-400 logs is integrated into the trail network as both a productive harvest site and a visitor-facing educational feature. Harvest is sold through the on-site snackbar, to local restaurants, and at farmers markets. Trail-clearing waste that would otherwise be chipped or removed is converted directly into a revenue stream, with near-zero material cost. No income is expected in year 1, modest yield in year 2, and full production from year 3.",
      "dependencies": [
        "basic_trails"
      ],
      "unlocks": [],
      "generalFundMin": null,
      "repeatableReqs": [],
      "perk": "\"Mushroom Grove made possible by [Donor Name]\"; sponsor-tagged log clusters with small carved markers; plaque at the grove entry point; and \"Founding Harvest\" acknowledgment  -  the first commercial harvest batch is labeled with the sponsor's name.",
      "phaseEssential": false,
      "incomeMin": 6750,
      "incomeMax": 32600,
      "costMonthly": null,
      "costYearly": null,
      "emphasis": false,
      "minProjectedIncome": null,
      "potentialGrantRevenue": null
    },
    {
      "id": "node_22draly",
      "label": "Forest Daycare",
      "category": "revenue",
      "phase": 2,
      "cost": 22000,
      "status": "locked",
      "description": "A licensed outdoor forest childcare program operating year-round on the estate in the Scandinavian friluftsliv tradition  -  there is no bad weather, only bad clothing. Children spend the majority of each session outdoors in the forest regardless of conditions, engaged in unstructured and semi-structured nature play under the supervision of qualified outdoor educators. Activities center on what the forest offers: building, foraging, fire-making under supervision, mud, water, weather, animals, and time. No screens. No structured curriculum. Children learn to assess risk, tolerate discomfort, and find their own entertainment in a landscape that rewards attention. The program operates at the intersection of the estate's mission and its community function  -  available to resort guests with young children, to local families on a sessional basis, and to foster youth and DV survivor families at no cost under the BOGO model. Dogs are present throughout, integrated naturally into the outdoor environment. Maine's climate makes this a genuine year-round commitment. Winter sessions are the point, not the exception  -  children in appropriate kit in a Maine winter forest, building snow shelters and tracking animals, is the experience. Parents who have never seen a child genuinely absorbed for four hours in a forest with no devices will not forget it. Licensing requirements in Maine for outdoor childcare programs will require legal review before launch  -  staff ratios, qualifications, and site requirements vary from standard center-based care.",
      "dependencies": [
        "node_min2uja",
        "node_k2vimcu"
      ],
      "unlocks": [],
      "generalFundMin": null,
      "repeatableReqs": [],
      "perk": "Program naming: \"Forest School made possible by [Donor Name]\", permanent plaque at the program's base area, and an invitation to the inaugural first session.",
      "phaseEssential": false,
      "incomeMin": 50000,
      "incomeMax": 80000,
      "costMonthly": 5500,
      "costYearly": null,
      "emphasis": false,
      "minProjectedIncome": null,
      "potentialGrantRevenue": null
    },
    {
      "id": "node_rfaxsc3",
      "label": "Sledding Hill with Rope Tow",
      "category": "community",
      "phase": 2,
      "cost": 18000,
      "status": "locked",
      "description": "A natural sledding hill selected for gradient, run length, and safe run-out, maintained through seasonal preparation and served by a rope tow for the uphill return. The $18,000 covers hill clearing and grading, rope tow installation (electric motor, continuous loop, handle grips), safety fencing on the lateral flanks, a small warming shelter at the base with bench seating and boot storage, and sled rental inventory (20-30 toboggans and foam sleds). The hill is operational when natural snow depth and consistency allow  -  typically December through February in Southern Maine, with significant year-to-year variation. Dogs are permitted in the run-out and spectator areas but not on the active hill during operational hours. Free for estate guests; $8 day pass for public visitors. The sledding hill is one of the estate's least expensive winter amenities and consistently one of the most popular with families  -  the return on $18,000 in community goodwill and guest satisfaction is disproportionate to the investment.",
      "dependencies": [
        "basic_trails"
      ],
      "unlocks": [],
      "generalFundMin": null,
      "repeatableReqs": [],
      "perk": "Hill naming: \"Sledding Hill made possible by [Donor Name]\", sponsor plaque at the base structure, and an invitation to the inaugural first run of the season.",
      "phaseEssential": false,
      "incomeMin": 12000,
      "incomeMax": 22000,
      "costMonthly": null,
      "costYearly": 9000,
      "emphasis": false,
      "minProjectedIncome": null,
      "potentialGrantRevenue": null
    },
    {
      "id": "node_8k7m7qj",
      "label": "Treehouse Network",
      "category": "resort",
      "phase": 3,
      "cost": 25000,
      "status": "locked",
      "description": "A network of connected treehouses distributed through the forest canopy at 4-6 metre height, linked by rope bridges, cargo net traverses, and platform walkways to form a continuous elevated trail approximately 200 metres in total length. The $25,000 cost covers structural engineering assessment of suitable host trees, platform construction in pressure-treated timber, safety railing and netting throughout, the rope bridge and traverse connections between platforms, and lighting for evening use.\n\nThe treehouse network serves multiple populations simultaneously. For children it is straightforward adventure infrastructure  -  the elevated perspective, the movement between platforms, and the mild exposure to height delivering the kind of risk-calibrated play that developmental research consistently identifies as beneficial and that most modern playgrounds no longer provide. For adults it is an unusual trail experience with a genuine view into the forest canopy. For dogs on the ground below, the movement and sounds of people overhead is a novel enrichment stimulus. The network is sited above a section of the dog trail network so that guests can walk at two levels simultaneously  -  one party in the trees, their dog on the path below, watching each other through the canopy.",
      "dependencies": [
        "basic_trails"
      ],
      "unlocks": [],
      "generalFundMin": null,
      "repeatableReqs": [],
      "perk": "",
      "phaseEssential": false,
      "costMonthly": null,
      "costYearly": null,
      "emphasis": false,
      "incomeMin": null,
      "incomeMax": null,
      "minProjectedIncome": null,
      "potentialGrantRevenue": null
    },
    {
      "id": "node_wuyygx4",
      "label": "Restaurant #1",
      "category": "revenue",
      "phase": 3,
      "cost": 250000,
      "status": "locked",
      "description": "New Doggerland's primary on-site restaurant  -  a full-service, dog-friendly dining room seating 60-80 covers, operating year-round as the culinary heart of the central village. The $250,000 covers commercial kitchen fitout to Maine health code standard, dining room with dog-friendly flooring and under-table anchoring points at every table, bar area, and outdoor terrace. The menu is built around ingredients foraged, grown, or produced on the estate: mushrooms from the Mushroom Grove, wild herbs and greens from the food forest, firewood-grilled meats over estate-cut hardwood, chaga and ginger from the estate gardens, and Dutch-influenced specials reflecting the founder's heritage. The kitchen team works directly with the land stewardship team on seasonal availability  -  the menu changes genuinely with what the forest and gardens produce. Dogs sit under the table on the same booking as their owners with no special arrangement required. Lunch and dinner daily; breakfast when villa occupancy justifies staffing. The restaurant is also the primary venue for the Long Table dinner and private events.",
      "dependencies": [
        "central_village",
        "cold_storage"
      ],
      "unlocks": [
        "scent_menu",
        "slow_table"
      ],
      "generalFundMin": null,
      "repeatableReqs": [],
      "perk": "Restaurant naming: \"Restaurant made possible by [Donor Name]\", permanent donor plaque at the entrance.",
      "phaseEssential": false,
      "costMonthly": null,
      "costYearly": null,
      "emphasis": false,
      "incomeMin": null,
      "incomeMax": null,
      "minProjectedIncome": null,
      "potentialGrantRevenue": null
    },
    {
      "id": "node_40jlnzf",
      "label": "ADA Accessible Trails",
      "category": "infrastructure",
      "phase": 2,
      "cost": 480000,
      "status": "locked",
      "description": "Two miles of fully ADA-compliant accessible forest trail, surfaced with compacted crushed limestone or packed gravel to a width of 8-10 feet, with grades not exceeding 5% (1:20) on primary routes and cross-slopes under 2%. Designed for wheelchairs, mobility aids, strollers, and visitors with limited mobility. Includes rest areas with level pull-offs every quarter mile, interpretive signage at accessible heights, two accessible picnic areas, and dog waste stations throughout. Routes are selected to pass through the most scenic sections of the estate. The trail connects the main parking lot directly to the sanctuary viewing area and the forest edge, ensuring the core New Doggerland experience is available to all visitors regardless of mobility.",
      "dependencies": [
        "basic_trails",
        "node_k2vimcu"
      ],
      "unlocks": [],
      "generalFundMin": null,
      "repeatableReqs": [],
      "perk": "Trail naming: \"Accessible Trail made possible by [Donor Name]\", permanent donor plaque at the accessible trailhead, acknowledgment on all trail maps and the estate website, and a named rest area along the route.",
      "phaseEssential": false,
      "incomeMin": null,
      "costMonthly": 200,
      "costYearly": null,
      "emphasis": false,
      "incomeMax": null,
      "minProjectedIncome": null,
      "potentialGrantRevenue": null
    },
    {
      "id": "node_3m4u27z",
      "label": "Rescue Goat Enclosure (Up to 12 Goats)",
      "category": "sanctuary",
      "phase": 1,
      "cost": 20300,
      "status": "locked",
      "description": "A purpose-built rescue goat enclosure providing permanent sanctuary for up to 12 goats, sized to welfare standards well above the industry minimum. Indoor shelter provides 20-25 sq ft per goat (approximately 300 sq ft total) with bedded floor, natural ventilation, and access to a contained activity yard. The yard provides species-appropriate foraging, climbing, and social space with goat-proof perimeter fencing, double-gate entry, automatic or gravity-fed water system, hay racks and mineral feeders, and an electric deterrent perimeter where predator pressure warrants it. The $20,300 covers all construction, fencing, water infrastructure, and initial equipment. The goat herd serves multiple simultaneous functions: permanent sanctuary for animals with nowhere else to go, land management through browsing of invasive species on rotated sections of the estate, therapeutic trail companionship for guests, and an educational resource for foster youth and agricultural college students learning animal husbandry. Monthly costs of $1,500 cover feed, farrier, veterinary care, and bedding.",
      "dependencies": [
        "node_b60pxf9"
      ],
      "unlocks": [
        "node_6npt26r"
      ],
      "generalFundMin": 5000,
      "repeatableReqs": [],
      "perk": "\"Goat Sanctuary made possible by [Donor Name]\" on the entry sign, plus a permanent plaque at the main gate; optional named elements (shelter, water station) for secondary donors.",
      "phaseEssential": false,
      "costMonthly": 1800,
      "costYearly": null,
      "emphasis": false,
      "incomeMin": null,
      "incomeMax": null,
      "minProjectedIncome": null,
      "potentialGrantRevenue": null
    },
    {
      "id": "node_28axmgy",
      "label": "Rescue Donkey facility",
      "category": "sanctuary",
      "phase": 1,
      "cost": 55000,
      "status": "locked",
      "description": "Initial donkey sanctuary infrastructure sized for 8 animals  -  the founding herd of what becomes a permanent, governance-protected multi-decade commitment. The facility provides at least 4 acres of grazing, at least 400 sq ft of covered bedded shelter, perimeter fencing, secure gates, and an all-season water system. The $55,000 covers all construction and infrastructure; monthly costs of $1,500 cover feed, farrier services every 8-12 weeks, routine veterinary care, and bedding. Donkeys at New Doggerland serve as permanent sanctuary residents, trail companions for guests, therapeutic presences for anxious dogs in the adjacent sanctuary, and working partners for foster youth and agricultural college students. Their 25-40 year lifespans make every animal that arrives a decades-long commitment  -  a fact encoded in the governance documents, which protect the donkey facility from decommissioning or reduction for cost-saving purposes. The Rescue Donkey Facility Upgrade node later doubles this capacity to 16 animals, at which point the herd also becomes a meaningful predator deterrent for the goat and duck enclosures.",
      "dependencies": [
        "node_b60pxf9"
      ],
      "unlocks": [
        "node_uju2o5z"
      ],
      "generalFundMin": 12000,
      "repeatableReqs": [],
      "perk": "Facility naming: \"Donkey Sanctuary made possible by [Donor Name]\", donor plaque at the main gate, and optional named elements (shelter nameplate, water station plaque) for secondary donors.",
      "phaseEssential": false,
      "costMonthly": 3500,
      "costYearly": null,
      "emphasis": false,
      "incomeMin": null,
      "incomeMax": null,
      "minProjectedIncome": null,
      "potentialGrantRevenue": null
    },
    {
      "id": "node_5mltlag",
      "label": "Well and permanent water",
      "category": "infrastructure",
      "phase": 1,
      "cost": 45000,
      "status": "locked",
      "description": "Surveying, permitting, drilling, and full installation of a permanent on-site drilled well, sized to serve the founder home, volunteer staging area, animal care facilities, and early public operations. Includes pressure tank, pump, filtration system, and distribution manifold. Retires the temporary water delivery system and IBC storage tanks from the Temporary Water node, establishing the estate's permanent potable water supply. Well depth and yield vary by site geology  -  Southern Maine typically returns 50-200 ft depth with 3-10 GPM yield, sufficient for early operational demands.",
      "dependencies": [
        "power_solar",
        "access_road"
      ],
      "unlocks": [
        "sanctuary_core",
        "central_village",
        "aqua_fetch"
      ],
      "generalFundMin": null,
      "repeatableReqs": [],
      "perk": "\"Founding Water Infrastructure made possible by [Donor Name]\", permanent donor plaque at the wellhead housing, and acknowledgment on the estate's infrastructure transparency page.",
      "phaseEssential": false,
      "costMonthly": 300,
      "costYearly": null,
      "emphasis": false,
      "incomeMin": null,
      "incomeMax": null,
      "minProjectedIncome": null,
      "potentialGrantRevenue": null
    },
    {
      "id": "node_7cjvxjl",
      "label": "Villa Design Contest",
      "category": "cultural",
      "phase": 2,
      "cost": 125000,
      "status": "locked",
      "description": "An open international design competition inviting architects, designers, and design students to submit proposals for the New Doggerland villa typology. The brief specifies: single-storey or split-level, dog-forward spatial design, forest integration, thermal performance for Maine winters, natural materials consistent with the estate aesthetic, and a minimum private outdoor enclosure. A jury of architects, welfare experts, and the Founder Steward evaluates submissions on welfare integration, aesthetic coherence, buildability, and long-horizon durability. The winning design becomes the template for the first 10 villas. Runner-up designs may be adapted for later phases. The contest itself generates significant press coverage and positions New Doggerland as a serious design-forward institution before a single villa is built.\nPrize structure:\n\nFirst place: $50,000 + build commission\nSecond place: $15,000\nThird place: $7,500\nStudent prize: $5,000",
      "dependencies": [
        "land"
      ],
      "unlocks": [
        "villas_phase1"
      ],
      "generalFundMin": null,
      "repeatableReqs": [],
      "perk": "Competition naming: \"Villa Design Prize made possible by [Donor Name]\", acknowledgment on all competition materials and press releases, jury seat offer (non-binding on outcome), and permanent acknowledgment on the winning villa type plaque.",
      "phaseEssential": false,
      "costMonthly": null,
      "costYearly": null,
      "emphasis": false,
      "incomeMin": null,
      "incomeMax": null,
      "minProjectedIncome": null,
      "potentialGrantRevenue": null
    },
    {
      "id": "node_938mdhr",
      "label": "Central Village Design Contest",
      "category": "cultural",
      "phase": 2,
      "cost": 175000,
      "status": "locked",
      "description": "An open international design competition inviting architects, urban designers, and landscape architects to propose the layout, architecture, and material language of New Doggerland's central village  -  the estate's permanent civic and commercial hub. The brief specifies: dog-forward spatial design throughout all public areas, natural materials consistent with the estate aesthetic, year-round operability in Maine's climate, integration with the surrounding forest rather than clearance of it, and a compact walkable layout that serves guests, staff, artisan partners, and mission visitors without hierarchy or visible distinction between them. The village must feel discovered rather than built  -  arrived at through the forest, not approached across a car park.\nA jury of architects, landscape designers, welfare experts, and the Founder Steward evaluates submissions on spatial coherence, aesthetic integration, buildability, long-horizon durability, and dog-forward design innovation. The winning scheme becomes the design framework for the Central Village build. Runner-up schemes may inform individual building or landscape elements.\nPrize structure:\n\nFirst place: $65,000 + design development commission\nSecond place: $20,000\nThird place: $10,000\nStudent prize: $7,500",
      "dependencies": [
        "land"
      ],
      "unlocks": [
        "central_village"
      ],
      "generalFundMin": null,
      "repeatableReqs": [],
      "perk": "Competition naming: \"Central Village Design Prize made possible by [Donor Name]\", acknowledgment on all competition materials and press releases, jury seat offer (non-binding on outcome), and permanent acknowledgment on the Central Village entry marker.",
      "phaseEssential": false,
      "costMonthly": null,
      "costYearly": null,
      "emphasis": false,
      "incomeMin": null,
      "incomeMax": null,
      "minProjectedIncome": null,
      "potentialGrantRevenue": null
    },
    {
      "id": "node_7aai9m0",
      "label": "The Jewel Design Contest",
      "category": "cultural",
      "phase": 3,
      "cost": 200000,
      "status": "locked",
      "description": "An international design competition for The Jewel  -  New Doggerland's flagship integrated human and dog aquatic district, and the only facility of its kind anywhere in the world. The competition brief is specific and demanding: a forest lagoon, not a theme park; a building that feels found rather than built; a single aquatic district where humans and dogs share water in parallel with controlled togetherness and hard separation only where safety genuinely requires it.\nThe brief specifies the full spatial program  -  central lagoon spine, three rings of intensity from zero-stress to high-energy, Aqua Fetch Bay as anchor attraction, parallel lazy rivers with transparent separation, Calm Cove decompression pools, and a shallow forest beach with staff-managed zoning. It specifies the safety architecture  -  hard zoning with soft visibility, one-way dog circulation, paw-safe non-slip surfaces throughout, frequent multi-species egress, eligibility gates at zone transitions, and overlapping lifeguard and dog-guard coverage with no blind spots. It specifies the sensory and aesthetic standards  -  timber, stone, mossy edges, low-profile structures, warm low-glare night lighting, and sound discipline in the calm ring sufficient to create a genuinely restful acoustic environment within a large wet facility. It specifies the operational backbone  -  dog life jacket library, warm rinse and drying corridor, real-time per-zone water quality monitoring with independent closure capability.\nSubmissions are evaluated on how convincingly a team resolves the central design problem: making humans and dogs feel genuinely together in water, at scale, safely. Teams that default to full separation or to uncontrolled mixing will not be shortlisted. The solution space is narrow and genuinely difficult. The jury expects to be surprised.\nThe jury comprises architects, aquatic facility engineers, the Founder Steward, a dog behavior specialist, and one external accessibility consultant. The winning scheme becomes the design development brief for The Jewel build. Runner-up schemes may inform individual zone or feature design.\n\nPrize structure:\n* First place: $200,000 + design development commission\n* Second place: $60,000\n* Third place: $25,000\n* Honorable mentions ×2: $10,000 each\n* Student prize: $15,000\n* Total prize pool: $320,000",
      "dependencies": [
        "land"
      ],
      "unlocks": [
        "the_jewel"
      ],
      "generalFundMin": null,
      "repeatableReqs": [],
      "perk": "Competition naming: \"Jewel Design Prize made possible by [Donor Name]\", acknowledgment on all competition materials and international press releases, jury seat offer (non-binding on outcome), and permanent acknowledgment on The Jewel's entrance wall alongside the winning architect's credit.",
      "phaseEssential": false,
      "costMonthly": null,
      "costYearly": null,
      "emphasis": false,
      "incomeMin": null,
      "incomeMax": null,
      "minProjectedIncome": null,
      "potentialGrantRevenue": null
    },
    {
      "id": "node_dlhwug3",
      "label": "Power upgrade",
      "category": "infrastructure",
      "phase": 2,
      "cost": 85000,
      "status": "locked",
      "description": "A capacity expansion of the estate's power infrastructure to support Phase 2 operational loads  -  primarily the sanctuary core's climate control, ventilation, lighting, and veterinary equipment, and the early central village build-out. The upgrade extends the Phase 1 solar array with additional panels and inverter capacity, expands battery storage to handle overnight and cloudy-day demand at full sanctuary load, and upgrades the site's internal distribution network with new circuits and increased panel capacity. A grid connection application is filed at this stage as a backup supply and emergency fallback  -  not as a primary source, but as a prudent contingency for Maine winters when solar yield drops significantly and sanctuary animal welfare cannot tolerate outages. The Phase 1 installation was sized for the founder home and volunteer staging area. This node sizes the system for an institution.",
      "dependencies": [
        "power_solar"
      ],
      "unlocks": [
        "sanctuary_core",
        "central_village"
      ],
      "generalFundMin": null,
      "repeatableReqs": [],
      "perk": "\"Power Infrastructure made possible by [Donor Name]\" (expanded to cover the full system), updated donor plaque at the electrical room, and acknowledgment on the estate's infrastructure transparency page alongside the Phase 1 power sponsor if different.",
      "phaseEssential": false,
      "costMonthly": 300,
      "costYearly": null,
      "emphasis": false,
      "incomeMin": null,
      "incomeMax": null,
      "minProjectedIncome": null,
      "potentialGrantRevenue": null
    },
    {
      "id": "node_k2vimcu",
      "label": "Parking Lot",
      "category": "infrastructure",
      "phase": 1,
      "cost": 55000,
      "status": "locked",
      "description": "The estate's first formal parking facility  -  30-40 bays of compacted gravel providing organised vehicle access for day guests, volunteers, contractors, and staff during early operations. Bays are defined with timber edge restraints and gravel surfacing, sized for standard vehicles with two oversized accessible bays. Every bay includes a dedicated dog leashing post: a ground-set timber post with two leash rings at appropriate heights, positioned at the front corner of each bay so a guest can secure their dog the moment the car door opens. The $55,000 covers clearing and grading, compacted gravel surfacing, bay definition, drainage, and leashing post installation across all 35-40 bays. This is not a courtesy feature  -  it is the first physical statement that New Doggerland is designed around dogs as full participants in every arrival and departure. The Phase 3 Parking Lot Upgrade expands this facility to 400-450 paved bays with EV charging to serve 150 villas at full capacity.",
      "dependencies": [
        "access_road"
      ],
      "unlocks": [
        "dutch_snackbar",
        "dog_daycare",
        "firewood",
        "node_40jlnzf",
        "node_coro4fa",
        "node_ijjcwty",
        "node_mzsbyr5",
        "node_xy757nh",
        "node_aaji5ku",
        "node_0p03fw9",
        "basic_trails",
        "forest_dining",
        "node_22draly",
        "node_55rktrk",
        "vet_facility",
        "sanctuary_core",
        "node_w27q8fu"
      ],
      "generalFundMin": null,
      "repeatableReqs": [],
      "perk": "Lot naming: \"Parking Lot made possible by [Donor Name]\", plaque at the entry, and optional \"Sponsor a Bay\" recognition plaques (bay-numbered, tied to leashing posts) for secondary donors.",
      "phaseEssential": false,
      "emphasis": true,
      "costMonthly": null,
      "costYearly": null,
      "incomeMin": null,
      "incomeMax": null,
      "minProjectedIncome": null,
      "potentialGrantRevenue": null
    },
    {
      "id": "node_nlp6pnm",
      "label": "Sanctuary Rescue Core upgrade",
      "category": "sanctuary",
      "phase": 3,
      "cost": 250000,
      "status": "locked",
      "description": "Expansion of the Phase 1 sanctuary from 12-dog initial capacity to a professional high-volume rescue and adoption facility capable of processing 250 dogs per year at the highest operational standards. This is the inflection point  -  the node that transforms New Doggerland from a credible small rescue into a serious regional institution.\nThe upgrade encompasses four major additions. First, a main kennel expansion to 80-100 individual housing units with indoor/outdoor runs, climate control, acoustic dampening, and natural light design  -  each unit above industry minimum in every dimension. Second, a dedicated intake and quarantine building with isolation kennels, exam rooms, and disease-control protocols sufficient for high-volume intake from multiple sources including transport fleet deliveries, local surrender, and disaster response. Third, a behavioral rehabilitation wing with separate play yards grouped by temperament and energy level, training rooms, decompression access, and long-term resident housing for dogs requiring extended behavioral work before adoption readiness. Fourth, a professional adoption center with multiple private meet-and-greet rooms, a public-facing lobby, and a staffed adoption counseling operation that treats every placement as a considered match rather than a transaction.\nAt 250 dogs per year, the on-site population at any given time runs 30-40 dogs simultaneously. The facility is designed for 1,000 per year at full build  -  this upgrade establishes the physical bones of that institution at a scale that can open, operate, and demonstrate excellence before the next expansion is funded.\nSupport infrastructure includes industrial-scale food prep and cold storage, laundry facilities rated for high daily volume, staff welfare areas, and supply storage sufficient for 90-day operational continuity.",
      "dependencies": [
        "sanctuary_core"
      ],
      "unlocks": [
        "node_e0ynnbc"
      ],
      "generalFundMin": 540000,
      "repeatableReqs": [],
      "perk": "Facility naming: \"Rescue Center made possible by [Donor Name]\", permanent donor plaque at the main entrance, naming rights to individual wings available for secondary donors  -  intake building, behavioral wing, adoption center  -  each a named donor opportunity in their own right.",
      "phaseEssential": true,
      "incomeMin": 140000,
      "incomeMax": 180000,
      "costMonthly": 46000,
      "emphasis": true,
      "costYearly": null,
      "minProjectedIncome": null,
      "potentialGrantRevenue": null
    },
    {
      "id": "node_e0ynnbc",
      "label": "Sanctuary Rescue Core upgrade 2",
      "category": "sanctuary",
      "phase": 4,
      "cost": 250000,
      "status": "locked",
      "description": "The third and final phase of sanctuary expansion, bringing the facility to its full design capacity of 1,000 dogs processed per year  -  the number at which New Doggerland becomes a serious national rescue institution rather than a regional one. The $250,000 cost covers the final infrastructure additions required to activate the capacity established in the bones of the Phase 2 sanctuary upgrade: additional staffing areas, final kennel wing activation, behavioral program scaling, and the operational systems  -  intake software, adoption platform, transport fleet integration  -  required to manage 1,000-dog annual throughput with the same per-dog standard of care as the first 12. At 1,000 dogs per year and an average length of stay of 14-25 days, the on-site population at any given time is 40-70 dogs simultaneously. The adoption program at this scale places approximately 3 dogs per day, every day of the year. The sanctuary at this phase is no longer a facility with an adoption operation attached. It is a rescue institution with national reach, disaster response capability, and a transport fleet that can mobilise anywhere in the country.",
      "dependencies": [
        "node_nlp6pnm"
      ],
      "unlocks": [
        "transport_fleet"
      ],
      "generalFundMin": null,
      "repeatableReqs": [],
      "perk": "",
      "phaseEssential": true,
      "incomeMax": null,
      "incomeMin": null,
      "costMonthly": null,
      "costYearly": null,
      "emphasis": false,
      "minProjectedIncome": null,
      "potentialGrantRevenue": null
    },
    {
      "id": "node_6npt26r",
      "label": "Rescue Goat Enclosure upgrade (Up to 24 Goats) ",
      "category": "sanctuary",
      "phase": 2,
      "cost": 20300,
      "status": "locked",
      "description": "Expansion of the goat sanctuary from 12 to 24 animals, doubling shelter capacity, yard space, water provision, and fencing to accommodate a full herd. The expanded enclosure is sized to support the goat program's core functions at scale: invasive species clearance across the estate's marginal land, therapeutic trail companionship, educational land stewardship for foster youth and agricultural college students, and the permanent sanctuary model for goats who have nowhere else to go. At 24 goats, the herd becomes a meaningful land management tool  -  a rotating clearance team capable of working through bittersweet, multiflora rose, and other invasives that would otherwise require machinery or herbicide. Sections of the estate are fenced off in rotation and the herd moved through them, converting marginal scrub into browse-cleared ground suitable for food forest planting or trail extension. The goats do not know they are working. They are simply eating, which is the point. The upgrade includes expanded indoor shelter space (~500 sq ft), additional yard fencing, a second water system, hay and mineral feeder expansion, and an electric deterrent perimeter where needed for predator pressure.",
      "dependencies": [
        "node_3m4u27z"
      ],
      "unlocks": [],
      "generalFundMin": 5000,
      "repeatableReqs": [],
      "perk": "Enclosure naming: \"Goat Sanctuary made possible by [Donor Name]\", permanent plaque at the main gate, and optional named elements  -  shelter nameplate, water station plaque  -  for secondary donors.",
      "phaseEssential": false,
      "costMonthly": 1750,
      "costYearly": null,
      "emphasis": false,
      "incomeMin": null,
      "incomeMax": null,
      "minProjectedIncome": null,
      "potentialGrantRevenue": null
    },
    {
      "id": "node_uju2o5z",
      "label": "Rescue Donkey facility upgrade",
      "category": "sanctuary",
      "phase": 2,
      "cost": 55000,
      "status": "locked",
      "description": "Expansion of the donkey sanctuary from 8 to 16 animals, doubling grazing acreage to at least 8 acres, expanding covered bedded shelter to at least 800 sq ft, and upgrading fencing, gates, and all-season water infrastructure accordingly. At 16 donkeys, the facility operates at meaningful scale across all its functions simultaneously  -  permanent sanctuary for animals who have nowhere else to go, trail companionship program for guests, therapeutic presence for anxious dogs in the adjacent sanctuary, and a working partnership with foster youth and agricultural college students learning animal husbandry. Donkeys at this scale also become a genuine guard animal resource. A herd of 16 distributed across the estate's grazing areas provides meaningful predator deterrence for the goat and duck enclosures  -  donkeys are naturally territorial toward canids and will actively confront foxes and coyotes. This is not incidental; it is part of the integrated multi-species land stewardship model. At 25-40 year lifespans, every donkey that arrives at New Doggerland is a decades-long commitment. The governance documents reflect this  -  the donkey facility may not be decommissioned or reduced below its operating capacity for cost-saving purposes. These animals are here for life. Farrier services run every 8-12 weeks per animal. At 16 donkeys this becomes a scheduled, regular relationship with a contracted farrier  -  worth formalizing as a named artisan partnership rather than an ad-hoc booking.",
      "dependencies": [
        "node_28axmgy"
      ],
      "unlocks": [],
      "generalFundMin": 12000,
      "repeatableReqs": [],
      "perk": "Facility naming: \"Donkey Sanctuary made possible by [Donor Name]\", donor plaque at the main gate, and optional named elements (shelter nameplate, water station plaque) for secondary donors.",
      "phaseEssential": false,
      "costMonthly": null,
      "costYearly": null,
      "emphasis": false,
      "incomeMin": null,
      "incomeMax": null,
      "minProjectedIncome": null,
      "potentialGrantRevenue": null
    },
    {
      "id": "node_p7dxajh",
      "label": "Upgraded Trail Network",
      "category": "infrastructure",
      "phase": 2,
      "cost": 250000,
      "status": "locked",
      "description": "A comprehensive upgrade of the Phase 1 trail network from hand-cut working paths to a mature, surfaced, multi-use trail system capable of supporting full resort operations. The Phase 1 network established the routes and cleared the corridors. This node finishes them  -  gravel surfacing on primary and access trails, proper drainage infrastructure throughout, timber bridges and boardwalks over wet crossings, wayfinding signage at all junctions, interpretive panels at key points, and benches at scenic intervals.\nThe upgrade also extends total trail mileage as villa development and estate operations reveal additional connectivity needs  -  linking villa clusters to the central village, connecting the goat and donkey grazing areas to the public trail loops, and establishing the groomed winter corridors that the cross-country ski and skating trail programs depend on. The underlying tread of the ski and skating trail network is prepared at this stage, even if grooming equipment and activation costs are captured in their own nodes.\nDog decompression trails  -  the quiet, low-stimulus natural surface routes used exclusively for sanctuary dogs  -  are extended and formally mapped, with scent-coded entry markers integrated with the scent coding system. Staff circulation routes are hardened for UTV access year-round. Emergency vehicle access is confirmed to all major structures.\nThe result is a trail network that functions as the circulatory system of a mature forest resort rather than the skeleton of one under construction.",
      "dependencies": [
        "basic_trails"
      ],
      "unlocks": [
        "tunnel_network",
        "scent_system",
        "villas_phase1",
        "node_aaji5ku"
      ],
      "generalFundMin": null,
      "repeatableReqs": [],
      "perk": "Trail network naming: \"Trail Network made possible by [Donor Name]\", acknowledgment on all trail maps and the main trailhead kiosk, and a named primary trailhead for the lead sponsor.",
      "phaseEssential": true,
      "costMonthly": null,
      "costYearly": null,
      "emphasis": false,
      "incomeMin": null,
      "incomeMax": null,
      "minProjectedIncome": null,
      "potentialGrantRevenue": null
    },
    {
      "id": "node_cayx77v",
      "label": "4 Dog Foster Care",
      "category": "sanctuary",
      "phase": 1,
      "cost": 2000,
      "status": "locked",
      "description": "Pre-adoption foster care for up to four dogs simultaneously, hosted in the founder home  -  the earliest expression of New Doggerland's rescue mission before the sanctuary facility is built. The $2,000 setup covers initial supplies: crates, beds, enrichment toys, leads, and a basic veterinary intake kit. The $1,200 monthly covers food, veterinary care, worming, flea treatment, and behavioral support materials for the active foster cohort. Foster dogs are assessed, socialised, and matched with adopters through the founder's personal network and early adoption outreach. Average length of stay is 14-30 days. At four dogs continuously, the program processes 50-100 adoptions per year in this phase  -  modest in number but significant as proof of concept, generating the earliest adoption data, behavioral assessment experience, and community relationships that the full sanctuary will later scale. The founder home's dedicated dog yard, internal capacity for four foster dogs alongside three personal dogs, and mud room infrastructure are specified precisely to support this program from day one.",
      "dependencies": [
        "node_b60pxf9"
      ],
      "unlocks": [],
      "generalFundMin": 5000,
      "repeatableReqs": [],
      "perk": "Program naming: \"Foster Care Program made possible by [Donor Name]\", acknowledgment on the program page.",
      "phaseEssential": false,
      "costMonthly": 1200,
      "emphasis": true,
      "costYearly": null,
      "incomeMin": null,
      "incomeMax": null,
      "minProjectedIncome": null,
      "potentialGrantRevenue": null
    },
    {
      "id": "node_86v0oi5",
      "label": "ADA trail upgrade",
      "category": "infrastructure",
      "phase": 3,
      "cost": 2800000,
      "status": "locked",
      "description": "Four miles of fully paved ADA-compliant shared-use forest path  -  asphalt surface, 10-12 feet wide, with grades not exceeding 5% and cross-slopes under 2%. The $2,800,000 node upgrades the existing Phase 1 compacted gravel accessible trail to a permanent paved surface, dramatically expanding all-weather accessibility for guests with mobility limitations, families with strollers, and older visitors. At 10-12 feet wide, the path accommodates two wheelchair users passing simultaneously alongside a dog on lead  -  the minimum width for a genuinely functional shared-use accessible route. The route connects the main parking area to the central village, sanctuary viewing area, forest dining sites, and key scenic points of the trail network. The $600 monthly covers surface maintenance, seasonal crack repair, and drainage management. This node is the estate's most significant accessibility investment, and signals that New Doggerland's commitment to universal access extends well beyond minimum compliance.",
      "dependencies": [
        "central_village"
      ],
      "unlocks": [],
      "generalFundMin": null,
      "repeatableReqs": [],
      "perk": "Trail naming: \"ADA Trail made possible by [Donor Name]\", permanent donor plaque at the accessible trailhead.",
      "phaseEssential": false,
      "costMonthly": 600,
      "emphasis": true,
      "costYearly": null,
      "incomeMin": null,
      "incomeMax": null,
      "minProjectedIncome": null,
      "potentialGrantRevenue": null
    },
    {
      "id": "node_v9vmmm3",
      "label": "Ginger Garden",
      "category": "revenue",
      "phase": 1,
      "cost": 10000,
      "status": "locked",
      "description": "A dedicated growing area establishing culinary and brewing ginger as a long-term perennial crop, integrated into the forest edge where partial shade and moisture retention suit the plant. Initial beds are sized to supply the future Gingerworks brewery and on-site food operations, with surplus sold fresh or as dried root through the snackbar and farmers markets. Ginger in Maine requires either cold-frame or polytunnel season extension  -  the beds are established with low-cost row cover and cold frames in year one, with a small heated propagation area to start rhizomes indoors before last frost. The garden doubles as a visitor-facing feature on the trail network, with interpretive signage explaining the crop-to-glass pathway that leads eventually to Gingerworks.\nYield timeline: no harvestable crop in year 1 (establishment only). Modest first harvest in year 2. Full productive yield from year 3 onward. Gingerworks remains a long-horizon unlock  -  this node plants the seed, not the brewery.",
      "dependencies": [
        "basic_trails"
      ],
      "unlocks": [
        "gingerworks"
      ],
      "generalFundMin": null,
      "repeatableReqs": [],
      "perk": "\"Founding Ginger Garden made possible by [Donor Name]\", donor plaque at the garden entry, acknowledgment on the Gingerworks origin story (permanently, including if Gingerworks becomes a commercial brand), and a ceremonial \"first rhizome planting\" invitation for the primary sponsor.",
      "phaseEssential": false,
      "costMonthly": 200,
      "costYearly": null,
      "emphasis": false,
      "incomeMin": null,
      "incomeMax": null,
      "minProjectedIncome": null,
      "potentialGrantRevenue": null
    },
    {
      "id": "node_w27q8fu",
      "label": "Parking Lot Upgrade",
      "category": "infrastructure",
      "phase": 3,
      "cost": 1400000,
      "status": "locked",
      "description": "Expansion of the Phase 1 gravel lot from 30-40 bays to a full-scale paved parking facility sized for 150 villas at capacity plus day guest and staff demand  -  approximately 400-450 spaces total. The expansion retains the defining feature of the Phase 1 lot: a dedicated dog leashing post at every single bay, without exception. A guest arriving with a dog has somewhere to secure them safely the moment the car door opens, before bags are unloaded or children are gathered. This is not a courtesy feature  -  it is a design standard that reflects the estate's fundamental orientation toward dogs as full participants in every arrival and departure.\nSurface is paved asphalt with defined bays, permeable edge treatment for stormwater, adequate lighting for year-round Maine darkness, and clearly marked accessible bays at minimum ADA ratio. EV charging infrastructure is installed at 10% of bays in this phase with conduit roughed in for full coverage  -  Maine's EV adoption trajectory makes this a near-term operational necessity rather than a luxury. A landscaped buffer separates the lot from the central village entry, so arriving guests move through a brief tree corridor before reaching the estate proper. The car disappears. The forest begins.",
      "dependencies": [
        "node_k2vimcu",
        "villas_phase1"
      ],
      "unlocks": [
        "node_g1fqbj4"
      ],
      "generalFundMin": 400000,
      "repeatableReqs": [],
      "perk": "Lot naming: \"Arrival Court made possible by [Donor Name]\", plaque at the main entry, and \"Sponsor a Bay\" recognition plaques on individual leashing posts for secondary donors  -  bay-numbered, permanent, low-profile.",
      "phaseEssential": false,
      "costMonthly": 1800,
      "incomeMin": 15000,
      "incomeMax": 90000,
      "costYearly": null,
      "emphasis": false,
      "minProjectedIncome": null,
      "potentialGrantRevenue": null
    },
    {
      "id": "node_g1fqbj4",
      "label": "Grand Entry",
      "category": "infrastructure",
      "phase": 3,
      "cost": 1000,
      "status": "locked",
      "description": "The estate's primary arrival building  -  a single-storey reception and welcome structure at the transition point between the parking area and the forest path leading to the central village. Functionally the Grand Entry handles guest check-in, issues RFID wristbands, provides orientation and trail maps, manages day visitor access control, holds luggage for early arrivals and late departures, and staffs a permanent concierge point during operating hours. The $1,000 cost is a placeholder pending specification through the Central Village Design Contest brief. At 150-villa capacity, the building must handle approximately 8-12 simultaneous check-ins on a Sunday afternoon changeover  -  sized accordingly, with dog-forward spatial design throughout. The arrival experience sets the register for everything that follows; the Grand Entry is where that register is first established. Natural materials, low profile, and an immediate sense that this place was designed to welcome dogs as much as people.",
      "dependencies": [
        "node_w27q8fu"
      ],
      "unlocks": [
        "central_village"
      ],
      "generalFundMin": null,
      "repeatableReqs": [],
      "perk": "Building naming: \"Grand Entry made possible by [Donor Name]\", permanent donor plaque at the entrance.",
      "phaseEssential": false,
      "costMonthly": null,
      "costYearly": null,
      "emphasis": false,
      "incomeMin": null,
      "incomeMax": null,
      "minProjectedIncome": null,
      "potentialGrantRevenue": null
    },
    {
      "id": "dv_program",
      "label": "DV Survivor Program",
      "category": "community",
      "phase": 3,
      "cost": 35000,
      "costMonthly": 8000,
      "status": "locked",
      "description": "A structured safe-stay program for domestic violence survivors  -  providing temporary villa accommodation, trauma-informed care, and connection to support services, funded through the BOGO villa model. The program addresses one of the most documented barriers to leaving abusive situations: 48% of DV survivors delay leaving because of pets, and most emergency shelters do not accept animals. At New Doggerland, survivors arrive with their pets. The villa is theirs for the duration of the stay  -  the same quality, same amenities, same forest access as every other guest. No visible distinction. No charity wing. No institutional feel.\n\nReferrals come through established partnerships with DV shelter networks  -  primarily the Maine Coalition to End Domestic Violence and affiliated regional organizations  -  and through trauma therapists and social workers. Participants are not publicly identified; confidentiality is structural, not just policy. The estate's 300-acre boundary, controlled access, and non-public location provide physical safety that urban shelters cannot replicate.\n\nAll guest-facing staff complete trauma-informed care training before the program launches. A dedicated program coordinator manages referral relationships, coordinates with support services, and provides a single point of contact for participants navigating next steps  -  housing, legal support, financial planning  -  during their stay. The estate's veterinary facility provides care for any pets arriving in need. If a survivor had to leave a pet behind, sanctuary dogs are available for companionship and, where appropriate, adoption.\n\nThe $35,000 setup covers trauma-informed staff training across all guest-facing roles, confidentiality protocol development, legal review of guest data handling, and referral partnership formalisation. The $8,000 monthly covers the program coordinator role and ongoing connection to support services. The program cannot be eliminated for cost-saving purposes.",
      "dependencies": [
        "villas_phase1",
        "vet_facility",
        "sanctuary_core"
      ],
      "unlocks": [],
      "generalFundMin": 500000,
      "repeatableReqs": [],
      "perk": "Program naming: \"DV Survivor Program made possible by [Donor Name]\", permanent acknowledgment on program materials (internal only  -  no public signage that would identify participants), and a private briefing on program outcomes for the lead sponsor annually.",
      "phaseEssential": false,
      "potentialGrantRevenue": "Federal Violence Against Women Act (VAWA) grants, state DV prevention funding, and private foundation grants focused on DV survivor support and pet-friendly housing. Estimated $80,000–$250,000/year at program maturity.",
      "costYearly": null,
      "emphasis": false,
      "incomeMin": null,
      "incomeMax": null,
      "minProjectedIncome": null
    },
    {
      "id": "youth_program_space",
      "label": "Youth Program Space",
      "category": "infrastructure",
      "phase": 3,
      "cost": 420000,
      "costMonthly": 1200,
      "status": "locked",
      "description": "A purpose-built single-storey program building providing the dedicated operational infrastructure for the Youth Out of Care Program  -  sited near the villa clusters but with its own identity, separate from the central village and not guest-facing. The $420,000 covers design and construction of a building housing: a program director's office and case management suite with private meeting rooms (staff:participant conversations require genuine privacy), a group session and workshop room sized for 15-20 participants, a quiet study area with desk space and reliable connectivity for participants in education programs, a life skills kitchen for cooking instruction and daily use, a small dedicated therapy room, and staff welfare facilities.\n\nThe building is designed to feel like a place people want to be  -  natural materials, good light, connection to the forest  -  not an institutional annex. Participants will spend significant portions of their day here over a 3-12 month program; the quality of the space is part of the therapeutic model. The $1,200 monthly covers utilities and maintenance.",
      "dependencies": [
        "villas_phase1",
        "central_village",
        "broadband"
      ],
      "unlocks": [
        "youth_program"
      ],
      "generalFundMin": 300000,
      "repeatableReqs": [],
      "perk": "Building naming: \"Youth Program Space made possible by [Donor Name]\", permanent donor plaque at the building entrance, and a named room within the building  -  case management suite, group room, or study area  -  for secondary donors.",
      "phaseEssential": false,
      "costYearly": null,
      "emphasis": false,
      "incomeMin": null,
      "incomeMax": null,
      "minProjectedIncome": null,
      "potentialGrantRevenue": null
    },
    {
      "id": "youth_program",
      "label": "Youth Out of Care Program",
      "category": "community",
      "phase": 3,
      "cost": 65000,
      "costMonthly": 42000,
      "status": "locked",
      "description": "A residential transitional program for young people aged 18-25 who have aged out of the foster care system  -  providing temporary housing, employment training, educational pathways, trauma-informed support, and a permanent connection to New Doggerland as a community. This is not a vacation program. It is a life-launch infrastructure.\n\nParticipants live in standard estate villas for 3-12 months  -  the same quality as paying guests, in the same residential fabric, indistinguishable from other villa occupants. The message is deliberate: you deserve this. Not a dormitory, not a program facility, not a charity bed. A villa in a forest, for as long as you need it to find your footing.\n\nDuring their stay, participants work on-site in rotations across sanctuary operations, resort hospitality, kitchen, land stewardship, and trade apprenticeships  -  building a genuine employment record and marketable skills portfolio. An educational coordinator navigates GED completion, trade school enrolment, and college access. Case managers (ratio 1:6) provide intensive individual support. The program operates on a \"hire low, lose them high\" philosophy: a participant who leaves for a better opportunity elsewhere is a program success, celebrated not mourned.\n\nReferrals come through Maine DHHS, foster care agencies, and youth homelessness organizations. Participants are recruited before or immediately after their 18th birthday where possible  -  the goal is to intercept the cliff before the fall, not respond to it after.\n\nThe $65,000 setup covers program licensing and legal structure, initial staff recruitment, referral partnership development, and dog pairing protocol design. The $42,000 monthly covers a program director ($90,000/year), four case managers ($55,000 average), an educational coordinator ($52,000), and an employment coordinator ($52,000), with remaining budget for program materials and operations. Alumni receive lifelong connection to the estate through the Youth Program Dogs node.",
      "dependencies": [
        "youth_program_space",
        "villas_phase1",
        "vet_facility",
        "sanctuary_core",
        "repair_workshop",
        "dog_training_program"
      ],
      "unlocks": [
        "youth_program_dogs",
        "grooming_training_program"
      ],
      "generalFundMin": 800000,
      "repeatableReqs": [],
      "perk": "Program naming: \"Youth Out of Care Program made possible by [Donor Name]\", permanent acknowledgment on program materials, and an annual private outcome briefing for the lead sponsor.",
      "phaseEssential": false,
      "potentialGrantRevenue": "Federal transitional housing grants (HUD), workforce development funding (WIOA), state foster care support grants through Maine DHHS, and private foundation grants focused on youth homelessness and foster care transition. Estimated $150,000–$400,000/year at program maturity.",
      "costYearly": null,
      "emphasis": false,
      "incomeMin": null,
      "incomeMax": null,
      "minProjectedIncome": null
    },
    {
      "id": "youth_program_dogs",
      "label": "Youth Program Dogs",
      "category": "community",
      "phase": 3,
      "cost": 12000,
      "costMonthly": 6000,
      "status": "locked",
      "description": "The permanent animal bonding and lifelong support component of the Youth Out of Care Program  -  each participant who completes the program is paired with a rescue dog that is theirs to keep, with a commitment from New Doggerland to support that animal for the rest of its life.\n\nThe pairing is deliberate, not arbitrary. The sanctuary's behavioral assessment data, the participant's lifestyle, energy level, and housing trajectory, and the dog's temperament and needs are all considered. A participant moving into a small apartment with a shift-work schedule gets a different match than one heading into a rural placement. The match is made to last.\n\nThe lifelong support commitment covers everything: veterinary care at no cost at the estate's hospital, food through the Kustom Kibble program, supplies as needed, and crisis boarding if the participant faces a period of instability  -  job loss, temporary housing crisis, medical emergency  -  where the dog cannot be with them. The dog is never a financial burden. It is never surrendered because of poverty. New Doggerland commits to this animal for the duration of its natural life, regardless of what happens to the participant's circumstances.\n\nAt 25-30 program graduates per year, with an average dog lifespan of 12 years and annual support cost of approximately $2,000 per dog, the program's ongoing liability grows to approximately $600,000-$720,000 per year at full maturity  -  a figure that is accounted for in the generalFundMin and offset by grant funding and the Kustom Kibble program's donated-pound model. The $12,000 setup covers pairing protocol development, initial supply kits for graduating participants, and an alumni tracking system for ongoing support coordination. The $6,000 monthly covers active cohort and early alumni support, scaling as the alumni base grows.",
      "dependencies": [
        "youth_program",
        "kustom_kibble",
        "vet_facility"
      ],
      "unlocks": [],
      "generalFundMin": 400000,
      "repeatableReqs": [],
      "perk": "Program naming: \"Youth Program Dogs made possible by [Donor Name]\", permanent acknowledgment on program materials, and the option to sponsor a specific graduating participant's dog  -  named, photographed, with annual updates for the life of the animal.",
      "phaseEssential": false,
      "potentialGrantRevenue": "Human-animal bond research grants, animal welfare foundation grants, and private giving from donors motivated by the intersection of youth welfare and rescue dog adoption. Estimated $20,000–$60,000/year.",
      "costYearly": null,
      "emphasis": false,
      "incomeMin": null,
      "incomeMax": null,
      "minProjectedIncome": null
    },
    {
      "id": "estate_vehicles",
      "label": "Estate Vehicle Fleet",
      "category": "infrastructure",
      "phase": 2,
      "cost": 55000,
      "costMonthly": 800,
      "incomeMin": null,
      "incomeMax": null,
      "status": "locked",
      "phaseEssential": false,
      "generalFundMin": null,
      "repeatableReqs": [],
      "dependencies": [
        "access_road"
      ],
      "unlocks": [
        "forest_dining",
        "node_aaji5ku"
      ],
      "perk": "Fleet naming: \"Estate Vehicle Fleet made possible by [Donor Name]\", donor plaque at the vehicle storage bay, and an invitation to the inaugural estate tour by golf cart.",
      "potentialGrantRevenue": null,
      "description": "A fleet of utility terrain vehicles (UTVs) and electric golf carts forming the operational backbone of estate logistics - used for forest dining delivery, trail maintenance and grooming, guest transport, emergency access, animal care supply runs, and staff circulation across 300-400 acres. The $55,000 covers an initial fleet of 4-6 vehicles: two heavy-duty UTVs for maintenance and trail work, two electric golf carts for guest-facing transport and light logistics, and one ATV for tighter trail sections. Monthly costs of $800 cover fuel, charging, maintenance, and servicing. Without this fleet, forest dining cannot operate (golf cart delivery is specified in its description), ski trail grooming is impossible, and the scale of the estate makes foot-only staff circulation impractical. The fleet expands in later phases as villa count and operational complexity grow.",
      "costYearly": null,
      "emphasis": false,
      "minProjectedIncome": null
    },
    {
      "id": "broadband",
      "label": "Broadband Infrastructure",
      "category": "infrastructure",
      "phase": 1,
      "cost": 38000,
      "costMonthly": 600,
      "incomeMin": null,
      "incomeMax": null,
      "status": "locked",
      "phaseEssential": false,
      "generalFundMin": null,
      "repeatableReqs": [],
      "dependencies": [
        "power_solar",
        "node_b60pxf9"
      ],
      "unlocks": [
        "rfid_system",
        "youth_program_space"
      ],
      "perk": "Infrastructure naming: \"Broadband Infrastructure made possible by [Donor Name]\", donor plaque at the network hub, and acknowledgment on the estate's infrastructure transparency page.",
      "potentialGrantRevenue": "USDA ReConnect rural broadband grants and Maine ConnectME Authority funding. Estimated $15,000-$38,000 one-time grant potential.",
      "description": "Reliable high-speed internet connectivity across the estate - a capital infrastructure project in rural Maine where connectivity cannot be assumed. The $38,000 covers site survey and ISP negotiation, installation of a fixed wireless or fiber connection at the estate boundary, a central distribution node at the founder home, and a mesh network extending to key operational areas: the sanctuary, veterinary facility, parking lot, and primary staff areas. Villa connectivity is handled as a separate fitout item within each villa build. Monthly costs of $600 cover the primary service contract and network maintenance. Reliable broadband is a prerequisite for the RFID system backend, the online Kustom Kibble reorder platform, the villa booking system, veterinary diagnostic equipment, the youth program's educational connectivity commitment, and basic staff operations. In rural Southern Maine, this requires deliberate infrastructure investment rather than a utility signup.",
      "costYearly": null,
      "emphasis": false,
      "minProjectedIncome": null
    },
    {
      "id": "wastewater",
      "label": "Wastewater & Septic Scaling",
      "category": "infrastructure",
      "phase": 2,
      "cost": 185000,
      "costMonthly": 400,
      "incomeMin": null,
      "incomeMax": null,
      "status": "locked",
      "phaseEssential": true,
      "generalFundMin": null,
      "repeatableReqs": [],
      "dependencies": [
        "node_5mltlag",
        "node_min2uja"
      ],
      "unlocks": [
        "central_village"
      ],
      "perk": "Infrastructure naming: \"Wastewater Infrastructure made possible by [Donor Name]\", acknowledgment on the estate's infrastructure transparency page.",
      "potentialGrantRevenue": null,
      "description": "Engineered wastewater management infrastructure scaled for Phase 2-3 operational loads - moving beyond the founder home's conventional septic to a system handling the central village, sanitation block, and first villa cluster simultaneously. The $185,000 covers a licensed site evaluation and engineered septic design, installation of a primary treatment system sized for 30-50 villa equivalents with expansion capacity, leach field engineering appropriate for Maine soil and frost conditions, and the distribution network connecting the sanitation block and central village to the system. Maine's strict subsurface wastewater regulations and seasonal frost depth make this a serious civil engineering project. The founder home septic handles Phase 1. This node is required before the central village or any villa cluster can be occupied. The $400 monthly covers inspection, pumping cycles, and maintenance. Failure to plan this correctly is one of the most expensive mistakes a rural estate of this scale can make.",
      "costYearly": null,
      "emphasis": false,
      "minProjectedIncome": null
    },
    {
      "id": "cold_storage",
      "label": "Cold Storage Facility",
      "category": "infrastructure",
      "phase": 2,
      "cost": 45000,
      "costMonthly": 300,
      "incomeMin": null,
      "incomeMax": null,
      "status": "locked",
      "phaseEssential": false,
      "generalFundMin": null,
      "repeatableReqs": [],
      "dependencies": [
        "power_solar",
        "node_min2uja"
      ],
      "unlocks": [
        "node_wuyygx4",
        "kustom_kibble",
        "gingerworks"
      ],
      "perk": "Facility naming: \"Cold Storage made possible by [Donor Name]\", acknowledgment on the estate's operational infrastructure page.",
      "potentialGrantRevenue": null,
      "description": "A purpose-built cold storage facility serving the estate's food and beverage ecosystem - the shared refrigerated and frozen storage infrastructure that the restaurant, Dutch Snackbar, Mushroom Grove harvest, Kustom Kibble ingredient inventory, and Gingerworks all depend on. The $45,000 covers a commercial walk-in refrigeration unit (400-600 sq ft), a separate freezer section, a dry goods storage area, and the electrical and drainage fitout required for food-safe commercial storage in a Maine climate. Sited adjacent to the central village kitchen for operational efficiency. Monthly costs of $300 cover electricity and maintenance. Without centralized cold storage, each food operation requires its own refrigeration - an expensive, redundant, and maintenance-heavy arrangement at the scale New Doggerland eventually operates.",
      "costYearly": null,
      "emphasis": false,
      "minProjectedIncome": null
    },
    {
      "id": "duck_facility",
      "label": "Rescue Duck Facility",
      "category": "sanctuary",
      "phase": 1,
      "cost": 8500,
      "costMonthly": 400,
      "incomeMin": null,
      "incomeMax": null,
      "status": "locked",
      "phaseEssential": false,
      "generalFundMin": null,
      "repeatableReqs": [],
      "dependencies": [
        "node_b60pxf9",
        "perimeter_fence"
      ],
      "unlocks": [],
      "perk": "Facility naming: \"Duck Sanctuary made possible by [Donor Name]\", permanent plaque at the enclosure gate, and optional named individual duck sponsorships for secondary donors.",
      "potentialGrantRevenue": null,
      "description": "A purpose-built waterfowl enclosure providing permanent sanctuary for rescued ducks - the fourth species in New Doggerland's animal sanctuary alongside dogs, goats, and donkeys. The $8,500 covers a predator-proof pen with hardware cloth on all sides including the roof (minimum 6x6 ft per duck, target 10x10 ft for a flock of 6-8), a weatherproof shelter with bedded floor, a small pond or stock tank with ramp access and drainage, an automatic feeder and waterer system, and perimeter fencing. Ducks are explicitly named as a species in the animal sponsorship program and Kustom Kibble protein ingredient list - the absence of a duck facility while offering duck sponsorships would be an inconsistency. The flock provides ground-level pest and insect control across adjacent areas, produces eggs for the restaurant and snackbar, and provides quiet, low-stress animal presence complementing the goat and donkey programs. Monthly costs of $400 cover feed, veterinary care, bedding, and pond maintenance.",
      "costYearly": null,
      "emphasis": false,
      "minProjectedIncome": null
    },
    {
      "id": "community_foster_network",
      "label": "Community Foster Network",
      "category": "sanctuary",
      "phase": 2,
      "cost": 12000,
      "costMonthly": 3500,
      "incomeMin": null,
      "incomeMax": null,
      "status": "locked",
      "phaseEssential": false,
      "generalFundMin": 150000,
      "repeatableReqs": [],
      "dependencies": [
        "sanctuary_core",
        "vet_facility",
        "volunteer_program"
      ],
      "unlocks": [],
      "perk": "Program naming: \"Community Foster Network made possible by [Donor Name]\", permanent acknowledgment on program materials, and the option to sponsor a dedicated foster supply kit for each new approved foster household.",
      "potentialGrantRevenue": "Animal welfare foundation grants and state companion animal program funding. Estimated $20,000-$60,000/year.",
      "description": "A formal external foster program recruiting, training, and supporting community members to temporarily house sanctuary dogs in their own homes - the primary mechanism for scaling dog throughput beyond what in-house kennel capacity allows. At 250+ dogs per year, on-site housing is never sufficient. Foster homes provide the behavioral data, real-world household testing, and human socialization that kennel environments cannot replicate, producing more accurate adoptability assessments and significantly higher adoption success rates. The $12,000 covers program development, foster family recruitment and screening protocols, a training curriculum, a foster resource library, and the initial cohort of 20-30 approved foster households. The $3,500 monthly covers a foster coordinator role (part-time initially, full-time at scale), veterinary costs for fostered dogs, emergency support, and supply provision for foster families. Foster families are never asked to fund the dog's care - food, vet, and supplies are all provided by ND. A target of 50+ active foster households within 24 months effectively doubles the sanctuary's operational capacity without a single additional kennel.",
      "costYearly": null,
      "emphasis": false,
      "minProjectedIncome": null
    },
    {
      "id": "dog_training_program",
      "label": "Dog Training Program",
      "category": "sanctuary",
      "phase": 2,
      "cost": 22000,
      "costMonthly": 7500,
      "incomeMin": 60000,
      "incomeMax": 120000,
      "status": "locked",
      "phaseEssential": false,
      "generalFundMin": null,
      "repeatableReqs": [],
      "dependencies": [
        "sanctuary_core",
        "basic_trails"
      ],
      "unlocks": [
        "youth_program"
      ],
      "perk": "Program naming: \"Dog Training Program made possible by [Donor Name]\", permanent acknowledgment on program materials, and a complimentary private training session with the head trainer for the lead sponsor.",
      "potentialGrantRevenue": null,
      "description": "A structured canine training and behavior program serving both sanctuary dogs and estate guests - the operational backbone of behavioral rehabilitation for rescue dogs and a significant revenue line for the resort. The $22,000 covers training equipment and infrastructure (agility equipment, behavior assessment tools, training yards, observation areas), initial trainer recruitment and certification alignment, and program design for both sanctuary and guest-facing components. The $7,500 monthly covers a head trainer (certified behaviorist level, $65,000-$80,000/year) and one assistant trainer, plus ongoing supplies and equipment maintenance. Sanctuary component: every dog receives a structured behavior assessment within 72 hours of intake, a tailored rehabilitation plan, and documented training progress that informs matchmaking recommendations and adoption placement. Guest component: private sessions ($120-$180/hour), group classes ($35-$50/person), a Canine Good Citizen certification program, and specialized modules including recall, reactive dog management, and puppy foundations. Guest training sessions are available to both villa guests and local community members, generating $60,000-$120,000/year in additional revenue at full capacity.",
      "costYearly": null,
      "emphasis": false,
      "minProjectedIncome": null
    },
    {
      "id": "dog_wash_stations",
      "label": "Dedicated Dog Wash Stations",
      "category": "revenue",
      "phase": 2,
      "cost": 18000,
      "costMonthly": 400,
      "incomeMin": 12000,
      "incomeMax": 28000,
      "status": "locked",
      "phaseEssential": false,
      "generalFundMin": null,
      "repeatableReqs": [],
      "dependencies": [
        "node_min2uja",
        "node_5mltlag"
      ],
      "unlocks": [
        "grooming_studio"
      ],
      "perk": "Station naming: \"Dog Wash Stations made possible by [Donor Name]\", permanent plaque at the wash area, and named individual stations for secondary donors.",
      "potentialGrantRevenue": null,
      "description": "Dedicated purpose-built dog wash stations serving estate guests, day visitors, and trail users returning from the estate's outdoor activities - separate from and superior to the basic wash points in the sanitation block. The $18,000 covers installation of 3-4 elevated stainless steel wash tubs at the correct working height for handlers (eliminating the back strain of ground-level washing), warm water supply with adjustable pressure, non-slip surfaces throughout, restraint bars and adjustable neck loops, built-in shampoo and conditioner dispensers stocked with estate-selected products, and a forced-air drying station with temperature control. Sited at the transition point between the trail network and the central village - the natural moment guests want to clean their dog before entering dining or retail areas. Self-use fee of $8-$12 per wash. Monthly costs of $400 cover supplies, maintenance, and water. Revenue at moderate utilization (5-8 washes/day): $14,600-$35,000/year. The wash stations are also the physical prerequisite for the grooming studio - demonstrating guest demand and establishing the water and drainage infrastructure the studio depends on.",
      "costYearly": null,
      "emphasis": false,
      "minProjectedIncome": null
    },
    {
      "id": "grooming_studio",
      "label": "Dog Grooming Studio",
      "category": "revenue",
      "phase": 3,
      "cost": 95000,
      "costMonthly": 8500,
      "incomeMin": 85000,
      "incomeMax": 180000,
      "status": "locked",
      "phaseEssential": false,
      "generalFundMin": null,
      "repeatableReqs": [],
      "dependencies": [
        "dog_wash_stations",
        "central_village"
      ],
      "unlocks": [
        "grooming_training_program"
      ],
      "perk": "Studio naming: \"Dog Grooming Studio made possible by [Donor Name]\", permanent donor plaque at the studio entrance, and a complimentary full groom for the lead sponsor's dog.",
      "potentialGrantRevenue": null,
      "description": "A full-service professional dog grooming studio occupying dedicated space in or adjacent to the central village - the estate's primary grooming operation serving villa guests, day visitors, and community members. The $95,000 covers fitout of 600-800 sq ft of grooming space: 4 professional grooming tables with hydraulic lifts, 4 elevated bathing tubs with warm water and forced-air drying integrated, a high-velocity professional dryer bay, a separate drying room with kennels for post-groom drying, a retail display for grooming products and accessories, reception desk and booking system, and all plumbing, drainage, and electrical infrastructure. The studio is staffed by 2 full-time professional groomers ($42,000-$52,000/year each) plus the grooming apprentices from the training program. Service menu ranges from a basic bath and brush ($45-$65) through full breed-standard grooms ($95-$175) to spa treatments including blueberry facials, pawdicures, and conditioning treatments ($25-$55 add-ons). At 10-20 dogs per day across the team, annual revenue is $85,000-$180,000. The studio is also the practical training facility for the grooming training program and a natural placement site for youth program participants pursuing grooming as a trade.",
      "costYearly": null,
      "emphasis": false,
      "minProjectedIncome": null
    },
    {
      "id": "grooming_training_program",
      "label": "Grooming Training Program",
      "category": "community",
      "phase": 3,
      "cost": 28000,
      "costMonthly": 3000,
      "incomeMin": 20000,
      "incomeMax": 45000,
      "status": "locked",
      "phaseEssential": false,
      "generalFundMin": null,
      "repeatableReqs": [],
      "dependencies": [
        "grooming_studio",
        "youth_program"
      ],
      "unlocks": [],
      "perk": "Program naming: \"Grooming Training Program made possible by [Donor Name]\", permanent acknowledgment on program materials, and a named apprenticeship position sponsored annually by the lead donor.",
      "potentialGrantRevenue": "Workforce development grants (WIOA), Maine Department of Labor training funds, and vocational training foundation grants. Estimated $15,000-$40,000/year.",
      "description": "A formal grooming apprenticeship and certification program using the estate's grooming studio as its training facility - a structured pathway from no experience to industry-recognized professional certification in 12-18 months. The $28,000 covers program development and curriculum design aligned with National Dog Groomers Association of America (NDGAA) certification standards, recruitment and onboarding materials, training tools and practice equipment, and the first cohort of 3-4 apprentices. Monthly costs of $3,000 cover the head groomer's additional training responsibilities and program coordination. Apprentices work paid shifts in the studio from day one - generating revenue while learning - with compensation structured to increase as they progress through certification levels. The program is explicitly connected to the Youth Out of Care Program as one of the trade pathways available to participants: grooming is a portable, in-demand, and self-employment-eligible skill that a program graduate can take anywhere. Tuition revenue from external students ($2,000-$3,500 per 6-month course) supplements the revenue from apprentice-performed services. Annual net revenue after program costs: $20,000-$45,000.",
      "costYearly": null,
      "emphasis": false,
      "minProjectedIncome": null
    },
    {
      "id": "gift_shop",
      "label": "Estate Gift Shop & Retail",
      "category": "revenue",
      "phase": 4,
      "cost": 35000,
      "costMonthly": 4500,
      "incomeMin": 150000,
      "incomeMax": 400000,
      "status": "locked",
      "phaseEssential": false,
      "generalFundMin": null,
      "repeatableReqs": [],
      "dependencies": [
        "central_village",
        "farmers_market",
        "gingerworks"
      ],
      "unlocks": [],
      "perk": "Shop naming: \"Estate Gift Shop made possible by [Donor Name]\", permanent donor plaque at the shop entrance, and a curated gift box of estate products delivered annually to the lead sponsor.",
      "potentialGrantRevenue": null,
      "description": "A dedicated retail storefront in the central village carrying estate-produced and estate-branded goods - the physical and commercial home of everything New Doggerland makes, grows, or commissions. The $35,000 covers retail fitout: shelving, display cases, a point-of-sale system with integrated online store, lighting, and initial inventory. Product lines include Gingerworks bottled products (the flagship retail item), chaga tea and dried product, estate-grown mushrooms and preserves, artisan partner work (bootmaker, woodworker, blacksmith, herbalist), branded merchandise (apparel, leads, collars, estate-branded dog accessories), printed estate maps and art prints, and Kustom Kibble sample packs. The gift shop is also the public-facing retail channel for products purchasable without a villa stay - the mechanism by which day visitors, local community members, and online customers access estate products. Monthly costs of $4,500 cover a shop manager, part-time staff, inventory restocking, and platform fees. Annual revenue at full villa occupancy: $150,000-$400,000.",
      "costYearly": null,
      "emphasis": false,
      "minProjectedIncome": null
    },
    {
      "id": "events_program",
      "label": "Weddings & Events Program",
      "category": "revenue",
      "phase": 4,
      "cost": 48000,
      "costMonthly": 5500,
      "incomeMin": 240000,
      "incomeMax": 900000,
      "status": "locked",
      "phaseEssential": false,
      "generalFundMin": null,
      "repeatableReqs": [],
      "dependencies": [
        "chapel",
        "forest_dining",
        "node_wuyygx4",
        "membership_program",
        "estate_bakery"
      ],
      "unlocks": [],
      "perk": "Program naming: \"Weddings & Events Program made possible by [Donor Name]\", permanent acknowledgment on all program materials, and a complimentary estate event for the lead sponsor's use.",
      "potentialGrantRevenue": null,
      "description": "A commercial events program offering the estate as a venue for weddings, private celebrations, corporate retreats, and memorial services - one of the highest per-day revenue opportunities in New Doggerland's entire financial model. The $48,000 covers events infrastructure: a dedicated events coordinator office, a portable ceremony staging kit (arch, chairs, aisle markers in estate aesthetic), outdoor audio system, a weather contingency structure (sailcloth tent or timber-frame canopy erected for events and stored between them), and a dedicated booking and planning platform. Monthly costs of $5,500 cover the events coordinator and part-time support staff. The estate's existing assets form the venue: the chapel for ceremonies, forest dining infrastructure for receptions, the trail network for processions, the restaurant for catering, and villa clusters for guest accommodation. Dogs are welcome at all events. At 30-50 events per year averaging $8,000-$18,000 per event (intimate forest weddings command significant premiums), annual revenue is $240,000-$900,000. The UU minister provides officiant services for weddings and memorials.",
      "costYearly": null,
      "emphasis": false,
      "minProjectedIncome": null
    },
    {
      "id": "farmers_market",
      "label": "Farmers Market",
      "category": "revenue",
      "phase": 1,
      "cost": 4500,
      "costMonthly": 600,
      "incomeMin": 20000,
      "incomeMax": 45000,
      "status": "locked",
      "phaseEssential": false,
      "generalFundMin": null,
      "repeatableReqs": [],
      "dependencies": [
        "access_road",
        "node_k2vimcu"
      ],
      "unlocks": [
        "gift_shop"
      ],
      "perk": "Market naming: \"Farmers Market made possible by [Donor Name]\", permanent plaque at the market entry, and a reserved vendor stall in perpetuity for the lead sponsor or their designee.",
      "potentialGrantRevenue": null,
      "description": "A weekly or bi-weekly farmers market held on estate grounds from Phase 1, serving as a community-facing revenue and relationship-building channel for estate produce and the broader local food ecosystem. The $4,500 covers basic market infrastructure: 8-12 timber vendor stalls with weather covers built by the estate woodworker, a simple entry point with signage, and basic electrical hookups for vendors. The market is open to external local vendors alongside ND's own produce operations - mushrooms from the Mushroom Grove, firewood, chaga products, ginger, food forest harvest, eggs from the duck flock, and surplus from the restaurant kitchen. External vendors pay a modest pitch fee ($15-$25) that partially offsets operational costs. The market generates $20,000-$45,000/year in produce sales and pitch fees, creates a weekly reason for the local community to visit the property before the resort is operational, and builds the goodwill and political relationships that a new rural institution needs from Phase 1. Monthly costs of $600 cover a market coordinator stipend and vendor management.",
      "costYearly": null,
      "emphasis": false,
      "minProjectedIncome": null
    },
    {
      "id": "membership_program",
      "label": "Estate Membership Program",
      "category": "revenue",
      "phase": 3,
      "cost": 8000,
      "costMonthly": 1200,
      "incomeMin": 60000,
      "incomeMax": 150000,
      "status": "locked",
      "phaseEssential": false,
      "generalFundMin": null,
      "repeatableReqs": [],
      "dependencies": [
        "basic_trails",
        "node_ivc46ur"
      ],
      "unlocks": [
        "events_program"
      ],
      "perk": "Program naming: \"Estate Membership Program made possible by [Donor Name]\", permanent acknowledgment on program materials, and a Steward tier membership in perpetuity for the lead sponsor.",
      "potentialGrantRevenue": null,
      "description": "An annual membership program providing local and regional supporters with regular access to estate amenities, priority booking, and community belonging at an accessible price point. The $8,000 covers membership platform development (online portal, digital membership cards, booking integration), design and production of physical welcome packs, and initial marketing. Three tiers: Community ($150/year - trail access, farmers market discount, one day guest pass), Friend ($350/year - all Community benefits plus priority booking for bookable amenities, unlimited dog park access, one forest dining session), and Steward ($750/year - all Friend benefits plus one free villa night, Long Table invitation, annual estate update from the Founder Steward). Monthly costs of $1,200 cover platform maintenance and membership coordination. At 200 Community, 100 Friend, and 30 Steward members, annual recurring revenue is approximately $97,500 before any utilization of included benefits. The program is also the estate's primary donor pipeline: members who feel genuine belonging are significantly more likely to make major gifts than cold-approached prospects.",
      "costYearly": null,
      "emphasis": false,
      "minProjectedIncome": null
    },
    {
      "id": "estate_bakery",
      "label": "Estate Bakery",
      "category": "revenue",
      "phase": 3,
      "cost": 42000,
      "costMonthly": 6500,
      "incomeMin": 55000,
      "incomeMax": 120000,
      "status": "locked",
      "phaseEssential": false,
      "generalFundMin": null,
      "repeatableReqs": [],
      "dependencies": [
        "central_village",
        "cold_storage"
      ],
      "unlocks": [
        "events_program"
      ],
      "perk": "Bakery naming: \"Estate Bakery made possible by [Donor Name]\", permanent donor plaque at the bakery counter, and a weekly bread delivery to the lead sponsor for one year.",
      "potentialGrantRevenue": null,
      "description": "A small production bakery integrated into the central village kitchen, producing bread, pastries, and baked goods for the restaurant, Long Table dinners, forest dining delivery, and retail sale through the gift shop and farmers market. The $42,000 covers a professional deck oven, proofing cabinet, commercial mixer, marble work surfaces, bread storage and cooling infrastructure, and fitout of the bakery station within the central village kitchen. The head baker - referenced in the Long Table description as a core member of the estate's food production team - is a salaried position ($48,000-$58,000/year) covered in the monthly costs of $6,500 alongside ingredients and packaging. Products include estate-grain sourdough using locally milled flour, seasonal pastries using food forest fruits and herbs,, and dog-safe baked treats sold through Kustom Kibble and the gift shop. The bakery produces the one product that most reliably makes a physical space smell welcoming. Annual revenue from retail and wholesale supply to the restaurant: $55,000-$120,000.",
      "costYearly": null,
      "emphasis": false,
      "minProjectedIncome": null
    },
    {
      "id": "free_library",
      "label": "Free Library & Gear Share",
      "category": "community",
      "phase": 1,
      "cost": 3500,
      "costMonthly": 100,
      "incomeMin": null,
      "incomeMax": null,
      "status": "locked",
      "phaseEssential": false,
      "generalFundMin": null,
      "repeatableReqs": [],
      "dependencies": [
        "node_ivc46ur"
      ],
      "unlocks": [],
      "perk": "Cabinet naming: \"Free Library made possible by [Donor Name]\", small carved plaque on the cabinet exterior.",
      "potentialGrantRevenue": null,
      "description": "A small free library and used dog gear exchange housed in a purpose-built weatherproof cabinet at the public dog park or central village entry - take a book, leave a book; take a lead, leave a lead. The $3,500 covers construction of a double-sided cabinet by the estate woodworker (one side books, one side dog gear), installation, and initial stock. The dog gear side accepts and redistributes donated leads, harnesses, crates, travel bowls, coats, and training tools - gear that families outgrow, upgrade, or no longer need, redirected to adopters, foster families, and community members who need it. Monthly costs of $100 cover restocking and maintenance. Cost is negligible; value is disproportionate. For a new rural institution trying to earn genuine local affection rather than toleration, a free library at the dog park signals more clearly than any press release that this place is for the community, not just for wealthy visitors.",
      "costYearly": null,
      "emphasis": false,
      "minProjectedIncome": null
    },
    {
      "id": "artisan_partnership_program",
      "label": "Artisan Partnership Program",
      "category": "community",
      "phase": 4,
      "cost": 18000,
      "costMonthly": 2000,
      "incomeMin": null,
      "incomeMax": null,
      "status": "locked",
      "phaseEssential": false,
      "generalFundMin": null,
      "repeatableReqs": [],
      "dependencies": [
        "repair_workshop"
      ],
      "unlocks": [
        "artisan_housing"
      ],
      "perk": "Program naming: \"Artisan Partnership Program made possible by [Donor Name]\", permanent acknowledgment on program materials and the estate website's artisan pages, and an invitation to the inaugural artisan welcome gathering.",
      "potentialGrantRevenue": "Maine Arts Commission grants and craft preservation funding. Estimated $10,000-$30,000/year.",
      "description": "The formal program structure governing how New Doggerland recruits, contracts, and supports its resident artisan partners - the blacksmith, bootmaker, baker, woodworker, herbalist, and others whose craft is embedded in the estate's identity and operations. The $18,000 covers program development: legal drafting of the artisan partnership agreement template (separate from employment contracts - these are craft partnerships with specific autonomy, commission, and residency provisions), recruitment materials and outreach to craft communities, workshop space fitout for the first 2-3 artisans operating before artisan housing is complete, and the first year of program coordination. Monthly costs of $2,000 cover the program coordinator (part-time) and artisan support costs. The program establishes the terms under which artisans operate: creative autonomy within their craft, commission structure for goods sold through the gift shop and direct, access to estate materials and infrastructure, pathway to artisan housing, and the expectation of participation in the estate's educational and apprenticeship programs. Without this program node, the artisan housing node has no pipeline and no governance framework. The Repair Culture workshop is the artisans' shared workspace.",
      "costYearly": null,
      "emphasis": false,
      "minProjectedIncome": null
    },
    {
      "id": "agricultural_college_partnership",
      "label": "Agricultural College Partnership",
      "category": "community",
      "phase": 3,
      "cost": 5000,
      "costMonthly": 500,
      "incomeMin": null,
      "incomeMax": null,
      "status": "locked",
      "phaseEssential": false,
      "generalFundMin": null,
      "repeatableReqs": [],
      "dependencies": [
        "sanctuary_core",
        "node_3m4u27z",
        "node_28axmgy"
      ],
      "unlocks": [],
      "perk": "Partnership naming: \"Agricultural College Partnership made possible by [Donor Name]\", acknowledgment on partnership materials and the estate website.",
      "potentialGrantRevenue": "USDA agricultural education grants, Maine Department of Agriculture cooperative funding. Estimated $15,000-$40,000/year.",
      "description": "A formal memorandum of understanding with the University of Maine system or equivalent Maine agricultural college, establishing New Doggerland as an approved placement and research partner for students in animal science, sustainable agriculture, forestry, veterinary technology, and related programs. The $5,000 covers legal review of the MOU, initial partnership development costs, and the first year of placement coordination. Monthly costs of $500 cover ongoing placement administration and the liaison relationship with the institution. The partnership provides New Doggerland with a structured pipeline of skilled student placements across the goat and donkey programs, food forest, repair workshop, sanctuary, and veterinary facility - reducing staffing costs and building relationships with future employees. In exchange, the college gains an unusually well-resourced and mission-aligned placement site. The partnership also enhances grant eligibility across multiple funding categories and provides access to agricultural research expertise relevant to the estate's land management challenges.",
      "costYearly": null,
      "emphasis": false,
      "minProjectedIncome": null
    },
    {
      "id": "volunteer_program",
      "label": "Volunteer Program",
      "category": "community",
      "phase": 1,
      "cost": 9000,
      "costMonthly": 1500,
      "incomeMin": null,
      "incomeMax": null,
      "status": "locked",
      "phaseEssential": false,
      "generalFundMin": null,
      "repeatableReqs": [],
      "dependencies": [
        "node_b60pxf9",
        "basic_trails"
      ],
      "unlocks": [
        "community_foster_network"
      ],
      "perk": "Program naming: \"Volunteer Program made possible by [Donor Name]\", acknowledgment on program materials, and named recognition on the estate's founding volunteer wall in the central village.",
      "potentialGrantRevenue": null,
      "description": "A formal volunteer program managing the recruitment, training, scheduling, welfare, and recognition of the volunteers who contribute meaningfully to New Doggerland's operations from Phase 1 onward. Volunteers appear in nearly every operational domain: trail building, BMX and disc golf course construction, sanctuary dog socialization and walking, farmers market operation, foster network support, and community events. Without a formal program, volunteer involvement is ad-hoc, inconsistent, and potentially a liability. The $9,000 covers program design and legal review (volunteer waiver and liability framework for a site involving dogs, trails, and heavy machinery), a volunteer management platform, onboarding and orientation materials, and basic uniform and identification items. Monthly costs of $1,500 cover a volunteer coordinator role (part-time, growing to full-time in Phase 3) and recognition events. A well-run volunteer program at this scale - targeting 200+ active volunteers by Phase 2 - contributes the equivalent of 3-5 full-time positions in labor value while building a deeply invested local community who become donors, ambassadors, and long-term supporters.",
      "costYearly": null,
      "emphasis": false,
      "minProjectedIncome": null
    },
    {
      "id": "sauna_cold_plunge",
      "label": "Sauna & Cold Plunge",
      "category": "resort",
      "phase": 4,
      "cost": 85000,
      "costMonthly": 1800,
      "incomeMin": 40000,
      "incomeMax": 90000,
      "status": "locked",
      "phaseEssential": false,
      "generalFundMin": null,
      "repeatableReqs": [],
      "dependencies": [
        "villas_phase1",
        "node_5mltlag"
      ],
      "unlocks": [],
      "perk": "Facility naming: \"Sauna & Cold Plunge made possible by [Donor Name]\", permanent donor plaque at the entrance, and a standing complimentary session for the lead sponsor on each estate visit.",
      "potentialGrantRevenue": null,
      "description": "A Nordic-tradition sauna and cold plunge facility sited in the forest, designed as a year-round wellness destination with particular appeal in Maine's winter months. The $85,000 covers a wood-fired traditional Finnish sauna structure (8-10 person capacity, timber construction consistent with estate aesthetic), a cold plunge pool fed by the estate's water system and cooled naturally in winter, a changing area with bench seating and hooks, and a covered outdoor rest deck with Adirondack chairs overlooking the forest. Sited within easy walking distance of the villa cluster but set into the trees for privacy and atmosphere. Bookable in 90-minute sessions at $35-$55 per person, with private booking for groups at $150-$250 per session. At 4-6 sessions per day during peak season and 2-3 during quieter periods, annual revenue is $40,000-$90,000. Monthly costs of $1,800 cover firewood supply, water system maintenance, linen service, and cleaning. Dogs are permitted in the outdoor rest area and approach path. The sauna and cold plunge is the single most requested amenity type missing from the current estate program among the premium forest resort demographic.",
      "costYearly": null,
      "emphasis": false,
      "minProjectedIncome": null
    },
    {
      "id": "stargazing",
      "label": "Night Sky & Stargazing Program",
      "category": "resort",
      "phase": 3,
      "cost": 12000,
      "costMonthly": 400,
      "incomeMin": 15000,
      "incomeMax": 35000,
      "status": "locked",
      "phaseEssential": false,
      "generalFundMin": null,
      "repeatableReqs": [],
      "dependencies": [
        "basic_trails",
        "power_solar"
      ],
      "unlocks": [],
      "perk": "Program naming: \"Night Sky Program made possible by [Donor Name]\", permanent acknowledgment on program materials, and an invitation to the inaugural first-light viewing session.",
      "potentialGrantRevenue": null,
      "description": "A structured night sky and stargazing program exploiting one of New Doggerland's most underutilized natural assets: Southern Maine's genuinely dark skies, far enough from major light pollution to offer clear views on favorable nights. The $12,000 covers a cleared and leveled primary viewing area (a forest opening with an unobstructed sky arc), 8-10 reclining Adirondack chairs with blanket storage boxes, a warming station with chaga tea and hot drinks, two quality refracting telescopes on stable mounts, a red-light-only lighting system that preserves night vision on the approach path, and interpretive materials (printed star charts, seasonal sky guides). Guided sessions are offered at $35-$55 per person on clear nights, bookable in advance via the estate system, with a minimum of 4 guests per session. Self-guided access is included for villa guests. Dogs on lead are welcome at all sessions. Monthly costs of $400 cover equipment maintenance, consumables, and guide stipends. Revenue is weather-dependent but Southern Maine averages 160+ clear nights per year - sufficient for a reliable seasonal offering.",
      "costYearly": null,
      "emphasis": false,
      "minProjectedIncome": null
    },
    {
      "id": "inaugural_use",
      "label": "Named Inaugural Use",
      "category": "stewardship",
      "phase": 1,
      "cost": 8000,
      "costMonthly": 500,
      "incomeMin": null,
      "incomeMax": null,
      "status": "locked",
      "phaseEssential": false,
      "generalFundMin": null,
      "repeatableReqs": [],
      "dependencies": [
        "access_road",
        "land"
      ],
      "unlocks": [
        "donor_stay_program",
        "build_visits"
      ],
      "perk": "",
      "potentialGrantRevenue": null,
      "description": "A formal program ensuring that every significant node in the New Doggerland development plan has a defined Inaugural Use moment - the first time the thing that was funded is used by a human being, reserved by right for the donor who funded it. This is categorically different from naming rights. A plaque is passive. Inaugural use is a lived, unrepeatable experience: the first meal served at the Long Table, the first night in the first villa, the first dog groomed in the grooming studio, the first family on the off-leash trail, the first fire lit in the Unitarian Chapel. These moments exist once. They cannot be purchased after the fact. The $8,000 covers program design and documentation (defining the inaugural moment for each applicable node, the invitation protocol, the ceremony if any, and the record-keeping), coordination of scheduling and logistics with donors, and production of a commemorative item for each inaugural use (a hand-printed card, a photograph, a letter from the Founder Steward - something physical that the donor keeps). Monthly costs of $500 cover the program coordinator's time as nodes activate across phases. The inaugural use framing should be written into funding instruments at the time of gift, not offered retroactively. It is part of what the donor is buying when they fund a node - not a thank-you add-on, but a structural element of the giving experience."
    },
    {
      "id": "build_visits",
      "label": "Build Visit Program",
      "category": "stewardship",
      "phase": 1,
      "cost": 5000,
      "costMonthly": 800,
      "incomeMin": null,
      "incomeMax": null,
      "status": "locked",
      "phaseEssential": false,
      "generalFundMin": null,
      "repeatableReqs": [],
      "dependencies": [
        "access_road",
        "land"
      ],
      "unlocks": [
        "founders_gathering"
      ],
      "perk": "",
      "potentialGrantRevenue": null,
      "description": "A structured program offering major donors the opportunity to visit the estate during construction phases and witness or participate in the building of what they funded. Not a hard-hat tour with a PR handler. A real visit, on the site, with the people doing the work. The drystone waller explaining the coursing logic of the perimeter wall while a donor places a stone in the section their gift funded. The food forest planting weekend where donors join staff putting heritage apple trees in the ground. The day the first rescue dogs arrive at the completed sanctuary, with the founding donors present in the courtyard. The $5,000 covers program design, safety protocols for construction site visits, logistics documentation, and the first year of coordination. Monthly costs of $800 cover scheduling, communications, and on-site hospitality for visits (simple - food from the snackbar, the founder's kitchen, whatever is operational at the time). Build visits are available to donors above a defined threshold (suggested: $25,000+ cumulative commitment). They are never mandatory and never performative - donors are invited into the actual working environment, not a staged version of it. A donor who watches the master waller explain why the wall will still stand in 200 years has a fundamentally different relationship to the organization than one who receives an annual report. Build visits create that relationship at the moment when the physical thing being funded is most tangible and most alive."
    },
    {
      "id": "witnessing_program",
      "label": "Witnessing Moments Program",
      "category": "stewardship",
      "phase": 2,
      "cost": 6000,
      "costMonthly": 1200,
      "incomeMin": null,
      "incomeMax": null,
      "status": "locked",
      "phaseEssential": false,
      "generalFundMin": null,
      "repeatableReqs": [],
      "dependencies": [
        "sanctuary_core",
        "community_foster_network"
      ],
      "unlocks": [
        "founders_gathering",
        "youth_program"
      ],
      "perk": "",
      "potentialGrantRevenue": null,
      "description": "A carefully designed program that closes the loop between infrastructure donors and the living outcomes their gifts produced - in ways that protect privacy, avoid charity theater, and create genuine correspondence rather than marketing. Two tracks operate in parallel. The sanctuary track: donors who funded the veterinary facility, transport fleet, community foster network, or sanctuary infrastructure periodically receive a photograph, a name, and a brief note about a dog who passed through the system their gift built. Not a form letter. A real account of a specific animal - where it came from, what it needed, where it landed. Sent by the sanctuary coordinator, not the development office. Consent and privacy for adopting families is managed through an opt-in at adoption. The youth program track: donors who funded the Youth Out of Care Program, Youth Program Space, or Youth Program Dogs can receive (with explicit participant consent and full anonymization unless the participant chooses otherwise) occasional correspondence about how the program is functioning - a participant who found employment in their trained trade, a dog placement that worked, a family formed. This is not the participant on display for the donor. It is the donor receiving evidence that the system they funded is doing what it was built to do. The $6,000 covers program design, consent framework development, legal review of privacy protocols, and staff training. Monthly costs of $1,200 cover coordination time across sanctuary and youth program staff. The program deliberately produces no content for public use - these communications are private, between the organization and individual donors."
    },
    {
      "id": "donor_stay_program",
      "label": "Donor Stay Program",
      "category": "stewardship",
      "phase": 3,
      "cost": 12000,
      "costMonthly": 2000,
      "incomeMin": null,
      "incomeMax": null,
      "status": "locked",
      "phaseEssential": false,
      "generalFundMin": null,
      "repeatableReqs": [],
      "dependencies": [
        "inaugural_use",
        "villas_phase1"
      ],
      "unlocks": [
        "founders_gathering"
      ],
      "perk": "",
      "potentialGrantRevenue": null,
      "description": "A structured annual stay program for major donors, built into funding instruments at the time of gift rather than offered retroactively as a thank-you. Villa donors receive a standing annual invitation to stay in the villa they funded - or the nearest equivalent if their specific villa is occupied - for a defined period each year (typically 3-5 nights). Major donors above a threshold who funded infrastructure, sanctuary, or program nodes rather than specific villas receive an equivalent annual stay invitation at the estate's expense. The program is not a discount or a priority booking. It is a dedicated allocation - these nights are reserved in the estate calendar and held until 60 days before the visit window, at which point they return to general inventory if unused. The $12,000 covers program design, integration with the villa booking system, legal drafting of the stay entitlement language for inclusion in funding instruments, and the first year of coordination. Monthly costs of $2,000 cover the program coordinator role and the operational cost of donor stays (food, housekeeping, incidentals - the villa itself carries no marginal cost beyond operations). The strategic logic is straightforward: a donor who returns to the estate every year for a decade sees what has grown. They walk trails they helped build. They eat in a restaurant their gift made possible. They meet a dog that the sanctuary rescued. They are not funders of an abstraction - they are stakeholders in a place. That relationship produces renewal, increased gifts, peer recruitment, and estate gifts. The annual stay is not a cost. It is the highest-return investment the organization makes in donor relationships."
    },
    {
      "id": "founders_gathering",
      "label": "Founders' Gathering",
      "category": "stewardship",
      "phase": 3,
      "cost": 18000,
      "costMonthly": 3500,
      "incomeMin": null,
      "incomeMax": null,
      "status": "locked",
      "phaseEssential": false,
      "generalFundMin": null,
      "repeatableReqs": [],
      "dependencies": [
        "donor_stay_program",
        "build_visits",
        "witnessing_program",
        "villas_phase1",
        "slow_table"
      ],
      "unlocks": [],
      "perk": "",
      "potentialGrantRevenue": null,
      "description": "An annual invitation-only weekend at the estate for the donors and founding members who built Phase 1 and Phase 2 of New Doggerland - the people without whom the place would not exist. Not a gala. Not a cultivation dinner in a hotel ballroom. Not a thank-you event with speeches and slideshows. A weekend at the estate itself: in the villas, eating from the kitchen they funded, walking the trails they built, sitting around a fire, meeting the dogs that moved through the sanctuary their gifts made operational. The Long Table format - everyone present at the same table, no hierarchy, no assigned seating by gift size, no donor recognition segment, no ask. Just the place and the people who built it together. The $18,000 covers the first gathering: food and beverage production for 30-50 guests across the weekend, villa allocation (founding donors stay at no charge during the gathering), activity coordination, and the logistics of bringing people from across the country to rural Maine. Monthly costs of $3,500 represent the annualized planning and coordination budget across the year between gatherings. The gathering happens once per year, typically in late September when the Maine foliage is at its peak and the summer operational pressure has eased. Attendance is by invitation only and limited to donors who have been part of the build from Phase 1 or 2. As the estate grows, a separate gathering for Phase 3 and 4 donors may be established - but the founding gathering remains small, intentional, and exclusive to those who were present at the beginning. The gathering has no formal agenda. No one is asked for anything. Major gifts will be contemplated anyway - because belonging generates generosity, and because people who have spent a weekend watching the thing they built working in the forest understand exactly what another gift would do."
    }
  ],
  "repeatables": [
    {
      "id": "picnic_bench",
      "label": "Outdoor dining location",
      "cost": 2200,
      "category": "community",
      "icon": "",
      "description": "Handcrafted bench on a concrete foundation. Wooden roof.",
      "perk": "Small plaque",
      "requiredNode": "basic_trails",
      "fundedCount": 0,
      "targetCount": 20
    },
    {
      "id": "camping_pad",
      "label": "Camping Site",
      "cost": 12000,
      "category": "revenue",
      "icon": "",
      "description": " 1/4 acre dog-safe, fenced, private camping area.",
      "perk": "Complimentary first night",
      "requiredNode": "basic_trails",
      "fundedCount": 0,
      "targetCount": 25
    },
    {
      "id": "tick_station",
      "label": "Tick Station",
      "cost": 350,
      "category": "community",
      "icon": "",
      "description": "Cedar-post station with mirror, tick-spray, tick removal tools and topicals, and tick-tubes",
      "perk": "",
      "requiredNode": "basic_trails",
      "fundedCount": 0,
      "targetCount": 12
    },
    {
      "id": "dog_water_station",
      "label": "Dog Water Station",
      "cost": 8000,
      "category": "community",
      "icon": "",
      "description": "Combined dog/human water station",
      "perk": "",
      "requiredNode": "water_well",
      "fundedCount": 0,
      "targetCount": 10
    },
    {
      "id": "fire_ring",
      "label": "Fire Pit",
      "cost": 5000,
      "category": "community",
      "icon": "",
      "description": "Stone-set fire pit, with wooden or rock seating. Includes maintaining a cut-back for fire-safety.",
      "perk": "Host the inaugural fire",
      "requiredNode": "basic_trails",
      "fundedCount": 0,
      "targetCount": 8
    },
    {
      "id": "trail_bench",
      "label": "Trail Rest Bench",
      "cost": 450,
      "category": "community",
      "icon": "",
      "description": "Timber bench at scenic point.",
      "perk": "Location choice and attribution plaque",
      "requiredNode": "basic_trails",
      "fundedCount": 0,
      "targetCount": 20
    },
    {
      "id": "bird_feeder",
      "label": "Bird Feeder Station",
      "cost": 500,
      "category": "sanctuary",
      "icon": "",
      "description": "Cedar multi-feeder post.",
      "perk": "Attribution plaque",
      "requiredNode": "basic_trails",
      "fundedCount": 0,
      "targetCount": 15
    },
    {
      "id": "bat_house",
      "label": "Bat House",
      "cost": 580,
      "category": "sanctuary",
      "icon": "",
      "description": "Multi-chamber bat house.",
      "perk": "Base plate inscription",
      "requiredNode": "basic_trails",
      "fundedCount": 0,
      "targetCount": 10
    },
    {
      "id": "apple_tree",
      "label": "Fruit Tree Planting",
      "cost": 580,
      "category": "legacy",
      "icon": "",
      "description": "Heritage fruit varieties",
      "perk": "Name the tree + first pick",
      "requiredNode": "basic_trails",
      "fundedCount": 0,
      "targetCount": 12
    }
  ],
  "oneTimes": [
    {
      "id": "utv_trailer",
      "label": "UTV + Trailer",
      "cost": 18000,
      "category": "infrastructure",
      "icon": "🚜",
      "description": "Utility vehicle with flatbed trailer for daily land management and material transport."
    },
    {
      "id": "pickup_truck",
      "label": "Pickup Truck",
      "cost": 35000,
      "category": "infrastructure",
      "icon": "🚙",
      "description": "4x4 pickup for supply runs, staff transport, and emergency access."
    },
    {
      "id": "snow_blower",
      "label": "Snow Blower",
      "cost": 8000,
      "category": "infrastructure",
      "icon": "❄️",
      "description": "Commercial-grade snow blower for winter trail and access maintenance. Capable of cutting cross-country ski tracks."
    },
    {
      "id": "log_splitter",
      "label": "Log Splitter",
      "cost": 1200,
      "category": "infrastructure",
      "icon": "🪓",
      "description": "Hydraulic log splitter for firewood program and land clearing operations."
    },
    {
      "id": "chainsaw_kit",
      "label": "Professional Chainsaw Kit",
      "cost": 1800,
      "category": "infrastructure",
      "icon": "🪚",
      "description": "Professional-grade chainsaw with safety gear for trail maintenance and forestry work."
    },
    {
      "id": "trailer_utility",
      "label": "Utility Trailer",
      "cost": 3200,
      "category": "infrastructure",
      "icon": "🚛",
      "description": "Heavy-duty utility trailer for equipment and material transport."
    },
    {
      "id": "atv",
      "label": "ATV",
      "cost": 9500,
      "category": "infrastructure",
      "icon": "🏍️",
      "description": "All-terrain vehicle for rapid access to remote areas and emergency response."
    },
    {
      "id": "generator",
      "label": "Backup Generator",
      "cost": 4500,
      "category": "infrastructure",
      "icon": "⚡",
      "description": "Diesel backup generator for power outages and construction sites."
    }
  ],
  "categories": {
    "start": {
      "label": "Origin",
      "color": "#FFD700",
      "order": 0
    },
    "infrastructure": {
      "label": "Infrastructure",
      "color": "#8B7355",
      "order": 1
    },
    "sanctuary": {
      "label": "Sanctuary",
      "color": "#4A7C59",
      "order": 2
    },
    "cultural": {
      "label": "Cultural",
      "color": "#7B5EA7",
      "order": 3
    },
    "community": {
      "label": "Community",
      "color": "#C17B2F",
      "order": 4
    },
    "enrichment": {
      "label": "Enrichment",
      "color": "#2F7B8C",
      "order": 5
    },
    "resort": {
      "label": "Resort",
      "color": "#8C4A2F",
      "order": 6
    },
    "revenue": {
      "label": "Revenue",
      "color": "#2F6B8C",
      "order": 8
    },
    "legacy": {
      "label": "Legacy",
      "color": "#8C6B2F",
      "order": 9
    }
  },
  "state": {
    "nodeStatuses": {
      "land": "locked",
      "porta_potties": "locked",
      "perimeter_fence": "locked",
      "water_well": "locked",
      "power_solar": "locked",
      "basic_trails": "locked",
      "access_road": "locked",
      "sanctuary_core": "locked",
      "vet_facility": "locked",
      "communication_boards": "locked",
      "dog_daycare": "locked",
      "matchmaking_walks": "locked",
      "scent_system": "locked",
      "scent_menu": "locked",
      "animal_adoption": "locked",
      "master_waller_dwelling": "locked",
      "perimeter_wall": "locked",
      "hero_stones": "locked",
      "memorial_urn_stones": "locked",
      "dutch_snackbar": "locked",
      "forest_dining": "locked",
      "slow_table": "locked",
      "gingerworks": "locked",
      "repair_workshop": "locked",
      "chapel": "locked",
      "extreme_fetch": "locked",
      "aqua_fetch": "locked",
      "ice_rink": "locked",
      "skating_trails": "locked",
      "tunnel_network": "locked",
      "mood_meadow": "locked",
      "sound_pads": "locked",
      "central_village": "locked",
      "villas_phase1": "locked",
      "villas_phase2": "locked",
      "villas_phase3": "locked",
      "kustom_kibble": "locked",
      "artisan_housing": "locked",
      "memory_lane_trail": "locked",
      "rfid_system": "locked",
      "water_channels": "locked",
      "tree_art": "locked",
      "firewood": "locked",
      "chaga_program": "locked",
      "transport_fleet": "locked",
      "the_jewel": "locked",
      "node_mzsbyr5": "locked",
      "node_coro4fa": "locked",
      "node_ivc46ur": "locked",
      "node_6j8nnxz": "locked",
      "node_nxnzzqr": "locked",
      "node_xy757nh": "locked",
      "node_5rnby5e": "locked",
      "node_aaji5ku": "locked",
      "node_pgm840u": "locked",
      "node_0p03fw9": "locked",
      "node_ijjcwty": "locked",
      "node_37li943": "locked",
      "node_55rktrk": "locked",
      "node_min2uja": "locked",
      "node_b60pxf9": "locked",
      "node_8s8q8at": "locked",
      "node_22draly": "locked",
      "node_rfaxsc3": "locked",
      "node_8k7m7qj": "locked",
      "node_wuyygx4": "locked",
      "node_40jlnzf": "locked",
      "node_3m4u27z": "locked",
      "node_28axmgy": "locked",
      "node_5mltlag": "locked",
      "node_7cjvxjl": "locked",
      "node_938mdhr": "locked",
      "node_7aai9m0": "locked",
      "node_dlhwug3": "locked",
      "node_k2vimcu": "locked",
      "node_nlp6pnm": "locked",
      "node_e0ynnbc": "locked",
      "node_6npt26r": "locked",
      "node_uju2o5z": "locked",
      "node_p7dxajh": "locked",
      "node_cayx77v": "locked",
      "node_86v0oi5": "locked",
      "node_v9vmmm3": "locked",
      "node_w27q8fu": "locked",
      "node_g1fqbj4": "locked",
      "dv_program": "locked",
      "youth_program_space": "locked",
      "youth_program": "locked",
      "youth_program_dogs": "locked",
      "estate_vehicles": "locked",
      "broadband": "locked",
      "wastewater": "locked",
      "cold_storage": "locked",
      "duck_facility": "locked",
      "community_foster_network": "locked",
      "dog_training_program": "locked",
      "dog_wash_stations": "locked",
      "grooming_studio": "locked",
      "grooming_training_program": "locked",
      "gift_shop": "locked",
      "events_program": "locked",
      "farmers_market": "locked",
      "membership_program": "locked",
      "estate_bakery": "locked",
      "free_library": "locked",
      "artisan_partnership_program": "locked",
      "agricultural_college_partnership": "locked",
      "volunteer_program": "locked",
      "sauna_cold_plunge": "locked",
      "stargazing": "locked"
    },
    "repeatableCounts": {
      "picnic_bench": 0,
      "camping_pad": 0,
      "tick_station": 0,
      "dog_water_station": 0,
      "fire_ring": 0,
      "trail_bench": 0,
      "bird_feeder": 0,
      "blueberry_patch": 0,
      "bat_house": 0,
      "agility_jump": 0,
      "mushroom_log": 0,
      "apple_tree": 0,
      "stone_steps": 0
    },
    "oneTimeFunded": {
      "utv_trailer": false,
      "pickup_truck": false,
      "snow_blower": false,
      "log_splitter": false,
      "chainsaw_kit": false,
      "trailer_utility": false,
      "atv": false,
      "generator": false
    },
    "generalFund": {
      "balance": 100,
      "goal": 500000
    }
  },
  "positions": {
    "land": {
      "x": 750,
      "y": 140
    },
    "porta_potties": {
      "x": 750,
      "y": 280
    },
    "perimeter_fence": {
      "x": 750,
      "y": 770
    },
    "water_well": {
      "x": 750,
      "y": 420
    },
    "power_solar": {
      "x": 750,
      "y": 490
    },
    "access_road": {
      "x": 750,
      "y": 560
    },
    "basic_trails": {
      "x": 750,
      "y": 840
    },
    "master_waller_dwelling": {
      "x": 750,
      "y": 1610
    },
    "sanctuary_core": {
      "x": 450,
      "y": 1470
    },
    "vet_facility": {
      "x": 750,
      "y": 2030
    },
    "communication_boards": {
      "x": 450,
      "y": 1680
    },
    "dog_daycare": {
      "x": 300,
      "y": 700
    },
    "matchmaking_walks": {
      "x": 450,
      "y": 1610
    },
    "scent_system": {
      "x": 1050,
      "y": 1820
    },
    "scent_menu": {
      "x": 300,
      "y": 2380
    },
    "animal_adoption": {
      "x": 450,
      "y": 1540
    },
    "perimeter_wall": {
      "x": 600,
      "y": 700
    },
    "hero_stones": {
      "x": 300,
      "y": 840
    },
    "memorial_urn_stones": {
      "x": 300,
      "y": 1610
    },
    "dutch_snackbar": {
      "x": 300,
      "y": 770
    },
    "forest_dining": {
      "x": 300,
      "y": 1470
    },
    "slow_table": {
      "x": 900,
      "y": 2380
    },
    "gingerworks": {
      "x": 900,
      "y": 2870
    },
    "repair_workshop": {
      "x": 600,
      "y": 2170
    },
    "chapel": {
      "x": 900,
      "y": 2730
    },
    "extreme_fetch": {
      "x": 1050,
      "y": 1610
    },
    "aqua_fetch": {
      "x": 1050,
      "y": 2170
    },
    "ice_rink": {
      "x": 900,
      "y": 1540
    },
    "skating_trails": {
      "x": 900,
      "y": 1610
    },
    "tunnel_network": {
      "x": 1050,
      "y": 1540
    },
    "mood_meadow": {
      "x": 1050,
      "y": 1680
    },
    "sound_pads": {
      "x": 1050,
      "y": 1750
    },
    "central_village": {
      "x": 750,
      "y": 2310
    },
    "villas_phase1": {
      "x": 300,
      "y": 2170
    },
    "villas_phase2": {
      "x": 300,
      "y": 2730
    },
    "villas_phase3": {
      "x": 300,
      "y": 2800
    },
    "kustom_kibble": {
      "x": 300,
      "y": 2240
    },
    "artisan_housing": {
      "x": 750,
      "y": 2730
    },
    "memory_lane_trail": {
      "x": 1050,
      "y": 2380
    },
    "rfid_system": {
      "x": 1050,
      "y": 2310
    },
    "water_channels": {
      "x": 1050,
      "y": 2450
    },
    "tree_art": {
      "x": 600,
      "y": 630
    },
    "firewood": {
      "x": 300,
      "y": 630
    },
    "chaga_program": {
      "x": 300,
      "y": 980
    },
    "transport_fleet": {
      "x": 450,
      "y": 2800
    },
    "the_jewel": {
      "x": 1050,
      "y": 2800
    },
    "null": {
      "x": 900,
      "y": 1260
    },
    "node_mzsbyr5": {
      "x": 900,
      "y": 770
    },
    "node_coro4fa": {
      "x": 900,
      "y": 840
    },
    "node_ivc46ur": {
      "x": 900,
      "y": 630
    },
    "node_6j8nnxz": {
      "x": 900,
      "y": 700
    },
    "node_nxnzzqr": {
      "x": 900,
      "y": 560
    },
    "node_xy757nh": {
      "x": 900,
      "y": 980
    },
    "node_5rnby5e": {
      "x": 600,
      "y": 560
    },
    "node_aaji5ku": {
      "x": 900,
      "y": 1120
    },
    "node_pgm840u": {
      "x": 1050,
      "y": 1470
    },
    "node_0p03fw9": {
      "x": 900,
      "y": 1050
    },
    "node_ijjcwty": {
      "x": 900,
      "y": 910
    },
    "node_37li943": {
      "x": 300,
      "y": 910
    },
    "node_55rktrk": {
      "x": 300,
      "y": 1540
    },
    "node_min2uja": {
      "x": 750,
      "y": 1470
    },
    "node_b60pxf9": {
      "x": 750,
      "y": 630
    },
    "node_8s8q8at": {
      "x": 300,
      "y": 560
    },
    "node_22draly": {
      "x": 300,
      "y": 1680
    },
    "node_rfaxsc3": {
      "x": 900,
      "y": 1470
    },
    "node_8k7m7qj": {
      "x": 1050,
      "y": 2240
    },
    "node_wuyygx4": {
      "x": 300,
      "y": 2310
    },
    "node_40jlnzf": {
      "x": 750,
      "y": 1540
    },
    "node_3m4u27z": {
      "x": 450,
      "y": 630
    },
    "node_28axmgy": {
      "x": 450,
      "y": 700
    },
    "node_5mltlag": {
      "x": 750,
      "y": 910
    },
    "node_7cjvxjl": {
      "x": 1200,
      "y": 1470
    },
    "node_938mdhr": {
      "x": 1200,
      "y": 1540
    },
    "node_7aai9m0": {
      "x": 1200,
      "y": 2170
    },
    "node_dlhwug3": {
      "x": 750,
      "y": 1680
    },
    "node_k2vimcu": {
      "x": 750,
      "y": 700
    },
    "node_nlp6pnm": {
      "x": 450,
      "y": 2170
    },
    "node_e0ynnbc": {
      "x": 450,
      "y": 2730
    },
    "node_6npt26r": {
      "x": 450,
      "y": 1750
    },
    "node_uju2o5z": {
      "x": 450,
      "y": 1820
    },
    "node_p7dxajh": {
      "x": 750,
      "y": 1820
    },
    "node_cayx77v": {
      "x": 450,
      "y": 560
    },
    "node_86v0oi5": {
      "x": 750,
      "y": 2380
    },
    "node_v9vmmm3": {
      "x": 300,
      "y": 1050
    },
    "node_w27q8fu": {
      "x": 750,
      "y": 2170
    },
    "node_g1fqbj4": {
      "x": 750,
      "y": 2240
    },
    "dv_program": {
      "x": 900,
      "y": 2170
    },
    "youth_program_space": {
      "x": 750,
      "y": 2450
    },
    "youth_program": {
      "x": 900,
      "y": 2240
    },
    "youth_program_dogs": {
      "x": 900,
      "y": 2310
    },
    "estate_vehicles": {
      "x": 750,
      "y": 1960
    },
    "broadband": {
      "x": 750,
      "y": 980
    },
    "duck_facility": {
      "x": 450,
      "y": 770
    },
    "farmers_market": {
      "x": 300,
      "y": 1120
    },
    "free_library": {
      "x": 900,
      "y": 1190
    },
    "volunteer_program": {
      "x": 900,
      "y": 1330
    },
    "wastewater": {
      "x": 750,
      "y": 1890
    },
    "cold_storage": {
      "x": 750,
      "y": 1750
    },
    "community_foster_network": {
      "x": 450,
      "y": 1890
    },
    "dog_training_program": {
      "x": 450,
      "y": 1960
    },
    "dog_wash_stations": {
      "x": 300,
      "y": 1750
    },
    "membership_program": {
      "x": 300,
      "y": 2450
    },
    "stargazing": {
      "x": 1050,
      "y": 2520
    },
    "artisan_partnership_program": {
      "x": 900,
      "y": 2800
    },
    "agricultural_college_partnership": {
      "x": 900,
      "y": 2450
    },
    "grooming_studio": {
      "x": 300,
      "y": 2520
    },
    "gift_shop": {
      "x": 300,
      "y": 2870
    },
    "estate_bakery": {
      "x": 300,
      "y": 2590
    },
    "sauna_cold_plunge": {
      "x": 1050,
      "y": 2730
    },
    "grooming_training_program": {
      "x": 900,
      "y": 2520
    },
    "events_program": {
      "x": 300,
      "y": 2940
    },
    "inaugural_use": {
      "x": 1680,
      "y": 280
    },
    "build_visits": {
      "x": 1680,
      "y": 560
    },
    "witnessing_program": {
      "x": 1680,
      "y": 980
    },
    "donor_stay_program": {
      "x": 1680,
      "y": 1540
    },
    "founders_gathering": {
      "x": 1680,
      "y": 1960
    }
  },
  "edgeNotes": {},
  "phaseSeps": [
    {
      "fromPhase": 0,
      "toPhase": 1,
      "y": 350
    },
    {
      "fromPhase": 1,
      "toPhase": 2,
      "y": 1399
    },
    {
      "fromPhase": 2,
      "toPhase": 3,
      "y": 2099
    },
    {
      "fromPhase": 3,
      "toPhase": 4,
      "y": 2655
    }
  ],
  "exportedAt": "2026-02-21T10:01:06.748Z"
}